// AnimBlueprintGeneratedClass ABP_Ranged_Weapon.ABP_Ranged_Weapon_C
// Size: 0x6962 (Inherited: 0x2c0)
struct UABP_Ranged_Weapon_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2f8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x3a8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x500(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x658(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x680(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x6a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x800(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x828(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x850(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x9a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xb00(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0xb28(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xc30(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xc50(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0xc70(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_61; // 0xd78(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_60; // 0xdc8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0xe18(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_59; // 0xeb8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_58; // 0xf08(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0xf58(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0xff8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1098(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0x10c8(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1178(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x1280(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x1320(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1478(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x14a0(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x15a8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x15f0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x1638(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x1660(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x17b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x17e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1938(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x1960(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x1ab8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_57; // 0x1ae0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1b30(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0x1b60(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x1c10(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1d68(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1d90(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_56; // 0x1e50(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_55; // 0x1ea0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_54; // 0x1ef0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_53; // 0x1f40(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_52; // 0x1f90(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x1fe0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x2080(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x2120(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x21c0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x21f0(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_51; // 0x22a0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_50; // 0x22f0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_49; // 0x2340(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x2390(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x2430(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x24d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x2500(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_48; // 0x25b0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_47; // 0x2600(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x2650(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_46; // 0x26f0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_45; // 0x2740(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x2790(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x2830(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x28d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x2900(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x29b0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x2b08(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_44; // 0x2b30(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_43; // 0x2b80(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x2bd0(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_42; // 0x2c70(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x2cc0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x2d60(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_41; // 0x2e00(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2e50(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x2e80(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x2f30(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x3088(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x30b0(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x3150(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x3198(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x31c0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x3280(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x33d8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x3420(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x3448(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_40; // 0x3470(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_39; // 0x34c0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x3510(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_38; // 0x35b0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_37; // 0x3600(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3650(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x36f0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x3790(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x37c0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x3870(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x39c8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_36; // 0x39f0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_35; // 0x3a40(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x3a90(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_34; // 0x3b30(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_33; // 0x3b80(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x3bd0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x3c70(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x3d10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x3d40(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x3df0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x3f48(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_32; // 0x3f70(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_31; // 0x3fc0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x4010(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_30; // 0x40b0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_29; // 0x4100(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x4150(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x41f0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x4290(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x42c0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x4370(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x44c8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x44f0(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x4590(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x45d8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_28; // 0x4600(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_27; // 0x4650(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x46a0(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_26; // 0x4740(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_25; // 0x4790(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x47e0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x4880(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x4920(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x4950(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x4a00(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x4b58(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_24; // 0x4b80(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_23; // 0x4bd0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x4c20(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_22; // 0x4cc0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_21; // 0x4d10(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x4d60(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4e00(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x4ea0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x4ed0(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4f80(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5088(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x50a8(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_20; // 0x50c8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19; // 0x5118(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x5168(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x5208(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x5258(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x52a8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x5348(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x53e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x5418(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x54c8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x5518(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x5568(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x5608(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x5658(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x56a8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x5748(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x57e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x5818(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x58c8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x5a20(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x5a48(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x5a98(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x5ae8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x5b88(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x5bd8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x5c28(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x5cc8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x5d68(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x5d98(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x5e48(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x5e98(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x5ee8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x5f88(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x5fd8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x6028(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x60c8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x6168(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x6198(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6248(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x63a0(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x63c8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x6418(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x6468(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x6508(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x6558(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x65a8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6648(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x66e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6718(0xb0)
	enum class ENUM_RangedWeaponCategories CurrentRangedWeapon; // 0x67c8(0x01)
	bool IsAimingWeapon; // 0x67c9(0x01)
	bool IsHipFiring; // 0x67ca(0x01)
	char pad_67CB[0x1]; // 0x67cb(0x01)
	float FireWeaponBlendInTime; // 0x67cc(0x04)
	bool IsCrouching; // 0x67d0(0x01)
	bool HipOrAimFiring; // 0x67d1(0x01)
	char pad_67D2[0x2]; // 0x67d2(0x02)
	struct FVector RootJointOffset; // 0x67d4(0x0c)
	struct FVector LeftHandIKOffset; // 0x67e0(0x0c)
	float IsPlayingAsFemaleFloat; // 0x67ec(0x04)
	bool IsMovingOnGround; // 0x67f0(0x01)
	char pad_67F1[0x7]; // 0x67f1(0x07)
	struct TArray<enum class ENUM_RangedWeaponCategories> ShouldOffsetLeftElbow; // 0x67f8(0x10)
	float ShouldUseLeftElbowOffsetAlpha; // 0x6808(0x04)
	struct FVector LeftElbowOffset; // 0x680c(0x0c)
	bool WallJumpIsAvailable; // 0x6818(0x01)
	char pad_6819[0x7]; // 0x6819(0x07)
	struct TMap<enum class ENUM_RangedWeaponCategories, struct FVector> RootJointOffsetMap; // 0x6820(0x50)
	struct TMap<enum class ENUM_RangedWeaponCategories, struct FVector> LeftHandOffsetMap; // 0x6870(0x50)
	float WeaponScaleAlpha; // 0x68c0(0x04)
	struct FVector WeaponScaleVector; // 0x68c4(0x0c)
	enum class ETigerGender BodyType; // 0x68d0(0x01)
	char pad_68D1[0x7]; // 0x68d1(0x07)
	struct TMap<enum class ENUM_RangedWeaponCategories, float> WeaponScaleMap; // 0x68d8(0x50)
	bool IsPlayingAsFemaleBool; // 0x6928(0x01)
	bool IsSecondaryWeapon; // 0x6929(0x01)
	char pad_692A[0x6]; // 0x692a(0x06)
	struct UABP_Player_C* Anim Instance; // 0x6930(0x08)
	float AimSweepFloat; // 0x6938(0x04)
	char pad_693C[0x4]; // 0x693c(0x04)
	struct ATigerPlayer* Player; // 0x6940(0x08)
	bool Is in Reload; // 0x6948(0x01)
	char pad_6949[0x3]; // 0x6949(0x03)
	struct FRotator MagazineRotationAmount; // 0x694c(0x0c)
	bool RotatingMagazine; // 0x6958(0x01)
	char pad_6959[0x3]; // 0x6959(0x03)
	float Alpha; // 0x695c(0x04)
	bool Is Sprinting; // 0x6960(0x01)
	enum class ETigerClan Current Player Clan; // 0x6961(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void BlueprintInitializeAnimation(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_HideMagazine1(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_HideMagazine1 // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_HideMagazine2(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_HideMagazine2 // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_UnHideMagazine1(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_UnHideMagazine1 // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_UnHideMagazine2(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_UnHideMagazine2 // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnWeaponSpawnEvent(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.OnWeaponSpawnEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void ExecuteUbergraph_ABP_Ranged_Weapon(int32_t EntryPoint); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.ExecuteUbergraph_ABP_Ranged_Weapon // (Final|UbergraphFunction) // @ game+0x18b4070
};

