// AnimBlueprintGeneratedClass ABP_Civilian.ABP_Civilian_C
// Size: 0x3ed0 (Inherited: 0x430)
struct UABP_Civilian_C : UTigerNpcAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x430(0x08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x438(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x520(0x28)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_8; // 0x548(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x5d0(0x30)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_7; // 0x600(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x688(0x30)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_6; // 0x6b8(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x740(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x770(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x820(0xa0)
	struct FTigerFilteredLayeredBlend TigerAnimGraphNode_FilteredLayeredBlending; // 0x8c0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x988(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x9b0(0x48)
	struct FTigerAnimNode_RandomPlayer TigerAnimGraphNode_RandomPlayer; // 0x9f8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xa98(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xac0(0x158)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xc18(0x30)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xc48(0xc0)
	char pad_D08[0x8]; // 0xd08(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0xd10(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xef0(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x10d0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x10f0(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x1110(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1158(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1180(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x12d8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1378(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x13a0(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1420(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1468(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x15c0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1608(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1760(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1788(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x18e0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1908(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x19a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x19c8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x19f0(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1af8(0x80)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x1b78(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x1b98(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1bb8(0x30)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_5; // 0x1be8(0x88)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1c70(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1cf0(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1db0(0x30)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_4; // 0x1de0(0x88)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1e68(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1ee8(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1fa8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1fd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2000(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2028(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2050(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2078(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x20a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x20c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20f0(0x28)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_3; // 0x2118(0x88)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x21a0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x21c0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x21e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x22e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x23f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x24f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x2600(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2708(0x30)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName_2; // 0x2738(0x88)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x27c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x27e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x2800(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x2908(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x2a10(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x2b18(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x2c20(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2d28(0x30)
	struct FTigerAnimNode_PlaySequenceByName TigerAnimGraphNode_PlaySequenceByName; // 0x2d58(0x88)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2de0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2e00(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x2e20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x2f28(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x3030(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x3138(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x3240(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x3348(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3378(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3398(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x33b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x34c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x35c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x36d0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x37d8(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x38e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3960(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3990(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x3a10(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3a40(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3ae0(0x80)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0x3b60(0x90)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x3bf0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c38(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x3c68(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3d18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3d48(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3df8(0x28)
	bool bIsDedicatedServer; // 0x3e20(0x01)
	char pad_3E21[0x3]; // 0x3e21(0x03)
	struct FVector LeftFootstepPosition; // 0x3e24(0x0c)
	float LeftFootstepTime; // 0x3e30(0x04)
	float RightFootstepTime; // 0x3e34(0x04)
	struct FVector RightFootstepPosition; // 0x3e38(0x0c)
	struct FRotator CharacterRotation; // 0x3e44(0x0c)
	float YawDelta; // 0x3e50(0x04)
	float DeltaX; // 0x3e54(0x04)
	float YawDeltaSmooth; // 0x3e58(0x04)
	bool IsBeingFeedOn; // 0x3e5c(0x01)
	bool IsRecovering; // 0x3e5d(0x01)
	bool FullyRecoverd; // 0x3e5e(0x01)
	bool InContextIdle; // 0x3e5f(0x01)
	struct FName CachedContextBasedIdle; // 0x3e60(0x08)
	bool IsHoldingProp; // 0x3e68(0x01)
	char pad_3E69[0x3]; // 0x3e69(0x03)
	struct FName FaceAnimSlotName_00; // 0x3e6c(0x08)
	struct FName FaceAnimSlotName_01; // 0x3e74(0x08)
	struct FName FaceAnimSlotName_02; // 0x3e7c(0x08)
	struct FName FaceAnimSlotName_03; // 0x3e84(0x08)
	struct FRotator LookAtSpineRotator; // 0x3e8c(0x0c)
	struct FRotator LookAtHeadRotator; // 0x3e98(0x0c)
	float LookAtVertical; // 0x3ea4(0x04)
	float LookAtHorizontal; // 0x3ea8(0x04)
	float LookAtHorizontalSlow; // 0x3eac(0x04)
	float AimYawDelta; // 0x3eb0(0x04)
	float Speed_Smooth; // 0x3eb4(0x04)
	struct TArray<struct UAnimMontage*> React Montage; // 0x3eb8(0x10)
	struct UAkAudioEvent* FootstepAkEvent; // 0x3ec8(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Civilian.ABP_Civilian_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void PostFootStepAudio(); // Function ABP_Civilian.ABP_Civilian_C.PostFootStepAudio // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AddEmotionalAnimationSet(struct UTigerAnimationSetCollection* InSetCollection); // Function ABP_Civilian.ABP_Civilian_C.AddEmotionalAnimationSet // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void Facial Animations(); // Function ABP_Civilian.ABP_Civilian_C.Facial Animations // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void StopCapMontage(enum class ETigerAIAnimationMode A); // Function ABP_Civilian.ABP_Civilian_C.StopCapMontage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void HandleContextualIdle(); // Function ABP_Civilian.ABP_Civilian_C.HandleContextualIdle // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void HandleFootstepSound(float FootstepDuration, bool LeftFoot); // Function ABP_Civilian.ABP_Civilian_C.HandleFootstepSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_BBA6A9724AFCD837302A6AB8D3D55CBB(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_BBA6A9724AFCD837302A6AB8D3D55CBB // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_SequencePlayer_CA1CB30F44EF00F966251AAA867490CA(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_SequencePlayer_CA1CB30F44EF00F966251AAA867490CA // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_BlendListByBool_A6AB795945D148CB4AEE71AC2F76A9A2(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_BlendListByBool_A6AB795945D148CB4AEE71AC2F76A9A2 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_LayeredBoneBlend_D132CB474C4CD8732517EFAF61A0670E(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_LayeredBoneBlend_D132CB474C4CD8732517EFAF61A0670E // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_TigerAnimGraphNode_RandomPlayer_AD270F954A6AC11814CAFDA6C00BC755(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_TigerAnimGraphNode_RandomPlayer_AD270F954A6AC11814CAFDA6C00BC755 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_DDB556484047FAEBC14C5687AA7ED506(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_DDB556484047FAEBC14C5687AA7ED506 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_FF7B69DD43977067A7C8EAA305F7DE94(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_FF7B69DD43977067A7C8EAA305F7DE94 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_C2A09BAA45A8969D20CC9693267BE7A9(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_C2A09BAA45A8969D20CC9693267BE7A9 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_8A689E074CAAA0BCC42C20A2E224F2E6(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_8A689E074CAAA0BCC42C20A2E224F2E6 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_3B5B01C94F495AA698FAF9BA69180E2C(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_3B5B01C94F495AA698FAF9BA69180E2C // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_1410EC2340A6B877E3B6CFB8046D439A(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_1410EC2340A6B877E3B6CFB8046D439A // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_ModifyBone_8DCA473E4F0442A438726E9DC0F181A8(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_ModifyBone_8DCA473E4F0442A438726E9DC0F181A8 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_SequencePlayer_44626FDB45DD85C93968159051D3B35B(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_SequencePlayer_44626FDB45DD85C93968159051D3B35B // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_4D238E45428FCC9B6A39B0B930AC8AA4(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_4D238E45428FCC9B6A39B0B930AC8AA4 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_8A7EC1F94AABA14079965D87190BA410(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_8A7EC1F94AABA14079965D87190BA410 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_5E507CAD402D56D610FC95B131D51453(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_5E507CAD402D56D610FC95B131D51453 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_F680FFE542EA01E2748D7598FBD52DE5(); // Function ABP_Civilian.ABP_Civilian_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Civilian_AnimGraphNode_TransitionResult_F680FFE542EA01E2748D7598FBD52DE5 // (BlueprintEvent) // @ game+0x18b4070
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Civilian.ABP_Civilian_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnInitiateAnimationBlueprint(); // Function ABP_Civilian.ABP_Civilian_C.OnInitiateAnimationBlueprint // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void AddSets(struct UTigerAnimationSetCollection* SetCollection); // Function ABP_Civilian.ABP_Civilian_C.AddSets // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_FootStep_Left(); // Function ABP_Civilian.ABP_Civilian_C.AnimNotify_FootStep_Left // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_Footstep_Right(); // Function ABP_Civilian.ABP_Civilian_C.AnimNotify_Footstep_Right // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnFootstep(bool bIsLeftFoot, float FootstepDuration); // Function ABP_Civilian.ABP_Civilian_C.OnFootstep // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnNpcReactionEvent(struct FTigerNpcReactionEvent& ReactionEvent); // Function ABP_Civilian.ABP_Civilian_C.OnNpcReactionEvent // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_FullyRecovered(); // Function ABP_Civilian.ABP_Civilian_C.AnimNotify_FullyRecovered // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void AnimNotify_ResetFeedingState(); // Function ABP_Civilian.ABP_Civilian_C.AnimNotify_ResetFeedingState // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnAnimationModeChanged(enum class ETigerAIAnimationMode LastAnimationMode); // Function ABP_Civilian.ABP_Civilian_C.OnAnimationModeChanged // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnBumpedByPlayerEvent(struct ATigerPlayer* InPlayer, struct FVector& InDirectionToPlayer); // Function ABP_Civilian.ABP_Civilian_C.OnBumpedByPlayerEvent // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnSettle(struct FTigerSettleEvent& SettleEvent); // Function ABP_Civilian.ABP_Civilian_C.OnSettle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void ExecuteUbergraph_ABP_Civilian(int32_t EntryPoint); // Function ABP_Civilian.ABP_Civilian_C.ExecuteUbergraph_ABP_Civilian // (Final|UbergraphFunction|HasDefaults) // @ game+0x18b4070
};

