// AnimBlueprintGeneratedClass ABP_Paperdoll.ABP_Paperdoll_C
// Size: 0x2cb0 (Inherited: 0x3d0)
struct UABP_Paperdoll_C : UTigerPaperDollAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d0(0x08)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_16; // 0x3d8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_15; // 0x4c8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_14; // 0x5b8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_13; // 0x6a8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_12; // 0x798(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_11; // 0x888(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_10; // 0x978(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_9; // 0xa68(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_8; // 0xb58(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_7; // 0xc48(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_6; // 0xd38(0xf0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xe28(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xea8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xec8(0x20)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_5; // 0xee8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_4; // 0xfd8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_3; // 0x10c8(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x11b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x11e0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1338(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x13d8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1420(0x28)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_2; // 0x1448(0xf0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1538(0x158)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x1690(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1780(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x17a8(0x20)
	char pad_17C8[0x8]; // 0x17c8(0x08)
	struct FTigerAnimNode_IgnoreParentScaling TigerAnimGraphNode_IgnoreParentScaling_2; // 0x17d0(0x150)
	struct FTigerAnimNode_IgnoreParentScaling TigerAnimGraphNode_IgnoreParentScaling; // 0x1920(0x150)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1a70(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1b78(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1c80(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1d88(0x158)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1ee0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1f00(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1f28(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1f58(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2020(0x80)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x20a0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2140(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2298(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2318(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x23e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2460(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x24e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2560(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x25e0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x2660(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2728(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x27f0(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x28b8(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2980(0xb0)
	struct FTigerAnimNode_RandomPlayer TigerAnimGraphNode_RandomPlayer; // 0x2a30(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2ad0(0x80)
	struct FTigerFilteredLayeredBlend TigerAnimGraphNode_FilteredLayeredBlending; // 0x2b50(0xc8)
	bool bIsDefaultSequenceList; // 0x2c18(0x01)
	char pad_2C19[0x3]; // 0x2c19(0x03)
	struct FName FaceAnimSlotName00; // 0x2c1c(0x08)
	struct FName FaceAnimSlotName01; // 0x2c24(0x08)
	struct FName FaceAnimSlotName02; // 0x2c2c(0x08)
	struct FName FaceAnimSlotName03; // 0x2c34(0x08)
	float Start Position; // 0x2c3c(0x04)
	enum class ENUM_UIAnimationMode UIAnimationSelect; // 0x2c40(0x01)
	char pad_2C41[0xf]; // 0x2c41(0x0f)
	struct FTransform Scale Clavicle LReference Transform; // 0x2c50(0x30)
	struct FTransform Scale Clavicle RReference Transform; // 0x2c80(0x30)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Paperdoll.ABP_Paperdoll_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void FacialAnimations(); // Function ABP_Paperdoll.ABP_Paperdoll_C.FacialAnimations // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void SelectAnimationSets(struct UTigerAnimationSetCollection* Set Collection); // Function ABP_Paperdoll.ABP_Paperdoll_C.SelectAnimationSets // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_0C84F26241DF23504C8DBF9B4E6ED9D6(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_0C84F26241DF23504C8DBF9B4E6ED9D6 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_TigerAnimGraphNode_RandomPlayer_A8C728FF47A5802CD0C3EAB638BED191(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_TigerAnimGraphNode_RandomPlayer_A8C728FF47A5802CD0C3EAB638BED191 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_F6119FB64030A2FB3C6041B9E77579B3(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_F6119FB64030A2FB3C6041B9E77579B3 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_C42E041348A26E837E668D9F9E6B722F(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_C42E041348A26E837E668D9F9E6B722F // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_BB1D1FF74A496723387A3B8DBAADF705(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_BB1D1FF74A496723387A3B8DBAADF705 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_E582EC97449B0B37ADC0ACA05429B4C2(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_E582EC97449B0B37ADC0ACA05429B4C2 // (BlueprintEvent) // @ game+0x18b4070
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_CE1E43BE48777820551A1A88BB0B3107(); // Function ABP_Paperdoll.ABP_Paperdoll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Paperdoll_AnimGraphNode_SequencePlayer_CE1E43BE48777820551A1A88BB0B3107 // (BlueprintEvent) // @ game+0x18b4070
	void AddSets(struct UTigerAnimationSetCollection* SetCollection); // Function ABP_Paperdoll.ABP_Paperdoll_C.AddSets // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Paperdoll.ABP_Paperdoll_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void BlueprintInitializeAnimation(); // Function ABP_Paperdoll.ABP_Paperdoll_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void BlueprintBeginPlay(); // Function ABP_Paperdoll.ABP_Paperdoll_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void ClearProps(struct UAnimMontage* Montage, bool bInterrupted); // Function ABP_Paperdoll.ABP_Paperdoll_C.ClearProps // (BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void ExecuteUbergraph_ABP_Paperdoll(int32_t EntryPoint); // Function ABP_Paperdoll.ABP_Paperdoll_C.ExecuteUbergraph_ABP_Paperdoll // (Final|UbergraphFunction|HasDefaults) // @ game+0x18b4070
};

