// AnimBlueprintGeneratedClass ABP_Player.ABP_Player_C
// Size: 0x34b02 (Inherited: 0x1170)
struct UABP_Player_C : UTigerPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1170(0x08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_69; // 0x1178(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_61; // 0x1238(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_157; // 0x1390(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_156; // 0x13b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_155; // 0x13e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_154; // 0x1408(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_153; // 0x1430(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_152; // 0x1458(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_151; // 0x1480(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_11; // 0x14a8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8; // 0x14d8(0x118)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_180; // 0x15f0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_54; // 0x16f8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_54; // 0x1718(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_179; // 0x1738(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_178; // 0x1840(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_177; // 0x1948(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_176; // 0x1a50(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_175; // 0x1b58(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x1c60(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0x1c90(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_60; // 0x1da8(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_96; // 0x1f00(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_150; // 0x1fa0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_149; // 0x1fc8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_59; // 0x1ff0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_148; // 0x2148(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_39; // 0x2170(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_38; // 0x21b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_37; // 0x2200(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x2248(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_36; // 0x2278(0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x22c0(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_58; // 0x23d8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_147; // 0x2530(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_57; // 0x2558(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_95; // 0x26b0(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x2750(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_94; // 0x28e0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_27; // 0x2980(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_68; // 0x2a48(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_67; // 0x2b08(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_146; // 0x2bc8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_145; // 0x2bf0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_144; // 0x2c18(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_143; // 0x2c40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_142; // 0x2c68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_141; // 0x2c90(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x2cb8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_140; // 0x2d68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_139; // 0x2d90(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x2db8(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_66; // 0x2f48(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_56; // 0x3008(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_138; // 0x3160(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_55; // 0x3188(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_137; // 0x32e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_136; // 0x3308(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_135; // 0x3330(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x3358(0x190)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_54; // 0x34e8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_134; // 0x3640(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_93; // 0x3668(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_133; // 0x3708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_184; // 0x3730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_183; // 0x3758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_182; // 0x3780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_181; // 0x37a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_180; // 0x37d0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_142; // 0x37f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_82; // 0x3878(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_141; // 0x38a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_81; // 0x3928(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_80; // 0x3958(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_20; // 0x3988(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_14; // 0x3a38(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_132; // 0x3b08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_131; // 0x3b30(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_35; // 0x3b58(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_53; // 0x3ba0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_92; // 0x3cf8(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x3d98(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_34; // 0x3dc8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_140; // 0x3e90(0x80)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x3f10(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_91; // 0x3fb0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_139; // 0x4050(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_26; // 0x40d0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_138; // 0x4198(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_137; // 0x4218(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_136; // 0x4298(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_135; // 0x4318(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_25; // 0x4398(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24; // 0x4460(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23; // 0x4528(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x45f0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_179; // 0x4620(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_178; // 0x4648(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_177; // 0x4670(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_176; // 0x4698(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_175; // 0x46c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_174; // 0x46e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_173; // 0x4710(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_172; // 0x4738(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_171; // 0x4760(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_170; // 0x4788(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_169; // 0x47b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_168; // 0x47d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_167; // 0x4800(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_166; // 0x4828(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_165; // 0x4850(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_164; // 0x4878(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_134; // 0x48a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_79; // 0x4920(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_133; // 0x4950(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_78; // 0x49d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_132; // 0x4a00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_77; // 0x4a80(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_93; // 0x4ab0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_76; // 0x4b98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_131; // 0x4bc8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_75; // 0x4c48(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_130; // 0x4c78(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_90; // 0x4cf8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_129; // 0x4d98(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_74; // 0x4e18(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_53; // 0x4e48(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_53; // 0x4e68(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_174; // 0x4e88(0x108)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_92; // 0x4f90(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_73; // 0x5078(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_19; // 0x50a8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_128; // 0x5158(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_89; // 0x51d8(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_38; // 0x5278(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_65; // 0x5318(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_52; // 0x53d8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_130; // 0x5530(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_129; // 0x5558(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_34; // 0x5580(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x55c8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x55f8(0x118)
	struct FAnimNode_Slot AnimGraphNode_Slot_33; // 0x5710(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_64; // 0x5758(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_128; // 0x5818(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_88; // 0x5840(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_51; // 0x58e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_127; // 0x5a38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_126; // 0x5a60(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22; // 0x5a88(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_50; // 0x5b50(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_125; // 0x5ca8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_124; // 0x5cd0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x5cf8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x5d28(0x118)
	struct FAnimNode_Slot AnimGraphNode_Slot_32; // 0x5e40(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_63; // 0x5e88(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_49; // 0x5f48(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_123; // 0x60a0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_48; // 0x60c8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_122; // 0x6220(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_121; // 0x6248(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_120; // 0x6270(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_87; // 0x6298(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_62; // 0x6338(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_119; // 0x63f8(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x6420(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x6450(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_47; // 0x6568(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_118; // 0x66c0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_31; // 0x66e8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_117; // 0x6730(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_46; // 0x6758(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x68b0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x6960(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_116; // 0x6a10(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21; // 0x6a38(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_61; // 0x6b00(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x6bc0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x6c70(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x6d20(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_115; // 0x6dd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0x6df8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0x6e20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0x6e48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0x6e70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0x6e98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0x6ec0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0x6ee8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_173; // 0x6f10(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_52; // 0x7018(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_52; // 0x7038(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_172; // 0x7058(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_171; // 0x7160(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_170; // 0x7268(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_169; // 0x7370(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_168; // 0x7478(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_86; // 0x7580(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0x7620(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0x7648(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_60; // 0x7670(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0x7730(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_45; // 0x7758(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0x78b0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_44; // 0x78d8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0x7a30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0x7a58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0x7a80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0x7aa8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x7ad0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_43; // 0x7af8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x7c50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x7c78(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85; // 0x7ca0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x7d40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0x7d68(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_59; // 0x7d90(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x7e50(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_42; // 0x7e78(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x7fd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x7ff8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x8020(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_30; // 0x8048(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x8090(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_41; // 0x80b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x8210(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x8238(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_84; // 0x8260(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x8300(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_58; // 0x8490(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_40; // 0x8550(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x86a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x86d0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_83; // 0x86f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_82; // 0x8798(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x8838(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x8860(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_81; // 0x8888(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x8928(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x8950(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x8978(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_80; // 0x8b08(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_79; // 0x8ba8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_39; // 0x8c48(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0x8da0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x8ef8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x8f20(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_57; // 0x8f48(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20; // 0x9008(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x90d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x90f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x9120(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_56; // 0x9148(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x9208(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x9238(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0x9350(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_29; // 0x94a8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_28; // 0x94f0(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_78; // 0x9538(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_55; // 0x95d8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0x9698(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0x97f0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_77; // 0x9948(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_76; // 0x99e8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x9a88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x9ab0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x9ad8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x9b00(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_54; // 0x9b28(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_75; // 0x9be8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_53; // 0x9c88(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_74; // 0x9d48(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_163; // 0x9de8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_162; // 0x9e10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_161; // 0x9e38(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_127; // 0x9e60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_72; // 0x9ee0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_126; // 0x9f10(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_71; // 0x9f90(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_70; // 0x9fc0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_18; // 0x9ff0(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_13; // 0xa0a0(0xd0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0xa170(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0xa2c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0xa2f0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_27; // 0xa318(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_26; // 0xa360(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_33; // 0xa3a8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_125; // 0xa470(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0xa4f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0xa518(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_25; // 0xa540(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_52; // 0xa588(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0xa648(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_73; // 0xa7a0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0xa840(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0xa868(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0xa890(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0xa8b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0xa8e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0xaa38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0xaa60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0xaa88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0xaab0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0xaad8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0xac30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0xac58(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_51; // 0xac80(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0xad40(0x50)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_8; // 0xad90(0x38)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0xadc8(0x50)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_12; // 0xae18(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_72; // 0xaee8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xaf88(0x50)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_7; // 0xafd8(0x38)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xb010(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0xb060(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0xb088(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0xb1e0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_71; // 0xb208(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0xb2a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0xb2d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0xb2f8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_50; // 0xb320(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_70; // 0xb3e0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_49; // 0xb480(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19; // 0xb540(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0xb608(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0xb760(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0xb788(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_24; // 0xb7b0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_23; // 0xb7f8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_124; // 0xb840(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_123; // 0xb8c0(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_51; // 0xb940(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_51; // 0xb960(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_167; // 0xb980(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_166; // 0xba88(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_165; // 0xbb90(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_164; // 0xbc98(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_163; // 0xbda0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_162; // 0xbea8(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_69; // 0xbfb0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_69; // 0xc050(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_17; // 0xc080(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0xc130(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0xc288(0x158)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_91; // 0xc3e0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_90; // 0xc4c8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_68; // 0xc5b0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_89; // 0xc650(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_88; // 0xc738(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_67; // 0xc820(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_66; // 0xc8c0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_68; // 0xc960(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0xc990(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_11; // 0xca40(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_65; // 0xcb10(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_122; // 0xcbb0(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0xcc30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0xcc58(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_10; // 0xcc80(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0xcd50(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0xce18(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121; // 0xce40(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_9; // 0xcec0(0xd0)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xcf90(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_50; // 0xcfc0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_161; // 0xcfe0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_160; // 0xd0e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_159; // 0xd1f0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_50; // 0xd2f8(0x20)
	char pad_D318[0x8]; // 0xd318(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_18; // 0xd320(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_17; // 0xd500(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_158; // 0xd6e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_157; // 0xd7e8(0x108)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0xd8f0(0x18)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0xd908(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_64; // 0xda60(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0xdb00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0xdb28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_160; // 0xdb50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_159; // 0xdb78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_158; // 0xdba0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_67; // 0xdbc8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_87; // 0xdbf8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_63; // 0xdce0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_86; // 0xdd80(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_66; // 0xde68(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_85; // 0xde98(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_84; // 0xdf80(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_62; // 0xe068(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_65; // 0xe108(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0xe138(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0xe1e8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0xe340(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_48; // 0xe368(0xc0)
	char pad_E428[0x8]; // 0xe428(0x08)
	struct FTigerAnimNode_IgnoreParentScaling TigerAnimGraphNode_IgnoreParentScaling_2; // 0xe430(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0xe580(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_61; // 0xe6d8(0xa0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xe778(0x90)
	char pad_E808[0x8]; // 0xe808(0x08)
	struct FTigerAnimNode_IgnoreParentScaling TigerAnimGraphNode_IgnoreParentScaling; // 0xe810(0x150)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_47; // 0xe960(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120; // 0xea20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119; // 0xeaa0(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0xeb20(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_46; // 0xeb48(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0xec08(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_22; // 0xed60(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0xeda8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_60; // 0xedd0(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_156; // 0xee70(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_37; // 0xef78(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0xf018(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_155; // 0xf040(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_154; // 0xf148(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_153; // 0xf250(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_152; // 0xf358(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_151; // 0xf460(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_49; // 0xf568(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0xf588(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_150; // 0xf5b0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_49; // 0xf6b8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0xf6d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0xf700(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0xf858(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0xf920(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0xf948(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_21; // 0xf970(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0xf9b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0xfb10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0xfb38(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_36; // 0xfb60(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_20; // 0xfc00(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0xfc48(0x158)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_16; // 0xfda0(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_149; // 0xff80(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_48; // 0x10088(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_48; // 0x100a8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_19; // 0x100c8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x10110(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_59; // 0x10138(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_148; // 0x101d8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_47; // 0x102e0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x10300(0x158)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_47; // 0x10458(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_147; // 0x10478(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_146; // 0x10580(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_145; // 0x10688(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x10790(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x108e8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_144; // 0x10910(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_58; // 0x10a18(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x10ab8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x10c10(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x10d68(0x28)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_15; // 0x10d90(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_143; // 0x10f70(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_45; // 0x11078(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118; // 0x11138(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_142; // 0x111b8(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_44; // 0x112c0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x11380(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_18; // 0x113a8(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_141; // 0x113f0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_46; // 0x114f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_46; // 0x11518(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_17; // 0x11538(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_57; // 0x11580(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x11620(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117; // 0x11648(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116; // 0x116c8(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x11748(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_43; // 0x11790(0xc0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_6; // 0x11850(0x38)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_32; // 0x11888(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x11950(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x11aa8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x11af0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x11c48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x11c70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x11c98(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_140; // 0x11cc0(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x11dc8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x11f20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x11f48(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_45; // 0x11f70(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_45; // 0x11f90(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_139; // 0x11fb0(0x108)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_16; // 0x120b8(0xf0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_56; // 0x121a8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x12248(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_42; // 0x123a0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x12460(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x12488(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_55; // 0x124b0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x12550(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x126a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x126d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x126f8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_41; // 0x12720(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x127e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x12808(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_7; // 0x12830(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x128e0(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6; // 0x12908(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x129b8(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0x129e0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x12a90(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x12be8(0x28)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_15; // 0x12c10(0xf0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_54; // 0x12d00(0xa0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x12da0(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x12e50(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53; // 0x12f00(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x12fa0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x12fc8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x12ff0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_52; // 0x13018(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x130b8(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x130e0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x13190(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x132e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x13310(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x13338(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x133e8(0x158)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_12; // 0x13540(0xb0)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_11; // 0x135f0(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_40; // 0x136a0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x13760(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x138b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x138e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x13908(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x13930(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x13958(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_39; // 0x13ab0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x13b70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x13b98(0x28)
	struct FTigerFilteredLayeredBlend TigerAnimGraphNode_FilteredLayeredBlending; // 0x13bc0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x13c88(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x13cd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x13cf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_157; // 0x13d20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_156; // 0x13d48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_155; // 0x13d70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_154; // 0x13d98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_153; // 0x13dc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_152; // 0x13de8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_151; // 0x13e10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_150; // 0x13e38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_149; // 0x13e60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_148; // 0x13e88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_147; // 0x13eb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_146; // 0x13ed8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_145; // 0x13f00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_144; // 0x13f28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_143; // 0x13f50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_142; // 0x13f78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_141; // 0x13fa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_140; // 0x13fc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_139; // 0x13ff0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_138; // 0x14018(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_137; // 0x14040(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_136; // 0x14068(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_135; // 0x14090(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_134; // 0x140b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_133; // 0x140e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_132; // 0x14108(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_131; // 0x14130(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_130; // 0x14158(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_129; // 0x14180(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_128; // 0x141a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127; // 0x141d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_126; // 0x141f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125; // 0x14220(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124; // 0x14248(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123; // 0x14270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122; // 0x14298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121; // 0x142c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120; // 0x142e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119; // 0x14310(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118; // 0x14338(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_35; // 0x14360(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_138; // 0x14400(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_137; // 0x14508(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_136; // 0x14610(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_135; // 0x14718(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_134; // 0x14820(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_44; // 0x14928(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_44; // 0x14948(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_133; // 0x14968(0x108)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117; // 0x14a70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116; // 0x14a98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115; // 0x14ac0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_64; // 0x14ae8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115; // 0x14b18(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_34; // 0x14b98(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_63; // 0x14c38(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_51; // 0x14c68(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114; // 0x14d08(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113; // 0x14d88(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_50; // 0x14e08(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112; // 0x14ea8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_62; // 0x14f28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x14f58(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_61; // 0x15008(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111; // 0x15038(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_38; // 0x150b8(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x15178(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110; // 0x151c0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x15240(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109; // 0x15308(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0x15388(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_83; // 0x15428(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_82; // 0x15510(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_33; // 0x155f8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_37; // 0x15698(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_60; // 0x15758(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x15788(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_59; // 0x15838(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114; // 0x15868(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113; // 0x15890(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112; // 0x158b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111; // 0x158e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110; // 0x15908(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109; // 0x15930(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108; // 0x15958(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107; // 0x15980(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106; // 0x159a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105; // 0x159d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0x159f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0x15a20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0x15a48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0x15a70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0x15a98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0x15ac0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0x15ae8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x15b10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x15b38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x15b60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x15b88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x15bb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x15bd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x15c00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x15c28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x15c50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x15c78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x15ca0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x15cc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x15cf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x15d18(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_81; // 0x15d40(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_32; // 0x15e28(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x15ec8(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_31; // 0x15f18(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_5; // 0x15fe0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108; // 0x16018(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_132; // 0x16098(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_43; // 0x161a0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_43; // 0x161c0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_131; // 0x161e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_130; // 0x162e8(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_58; // 0x163f0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_80; // 0x16420(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_31; // 0x16508(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x165a8(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_30; // 0x165f8(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_4; // 0x166c0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107; // 0x166f8(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_129; // 0x16778(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_42; // 0x16880(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_42; // 0x168a0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_128; // 0x168c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_127; // 0x169c8(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_57; // 0x16ad0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_79; // 0x16b00(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_30; // 0x16be8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x16c88(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_29; // 0x16cd8(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_3; // 0x16da0(0x38)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_126; // 0x16dd8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_41; // 0x16ee0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_41; // 0x16f00(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_125; // 0x16f20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_124; // 0x17028(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106; // 0x17130(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_56; // 0x171b0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_123; // 0x171e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_122; // 0x172e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_121; // 0x173f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_120; // 0x174f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_119; // 0x17600(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_118; // 0x17708(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_117; // 0x17810(0x108)
	char pad_17918[0x8]; // 0x17918(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_14; // 0x17920(0x1e0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_40; // 0x17b00(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_40; // 0x17b20(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_13; // 0x17b40(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105; // 0x17d20(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_29; // 0x17da0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_55; // 0x17e40(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_116; // 0x17e70(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_115; // 0x17f78(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_114; // 0x18080(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_113; // 0x18188(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_112; // 0x18290(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_111; // 0x18398(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_110; // 0x184a0(0x108)
	char pad_185A8[0x8]; // 0x185a8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_12; // 0x185b0(0x1e0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_39; // 0x18790(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_39; // 0x187b0(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_11; // 0x187d0(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x189b0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_28; // 0x18a30(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_54; // 0x18ad0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_109; // 0x18b00(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_108; // 0x18c08(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_107; // 0x18d10(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_106; // 0x18e18(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_38; // 0x18f20(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_105; // 0x18f40(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_38; // 0x19048(0x20)
	char pad_19068[0x8]; // 0x19068(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_10; // 0x19070(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x19250(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_27; // 0x192d0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_53; // 0x19370(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_104; // 0x193a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_103; // 0x194a8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_37; // 0x195b0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_102; // 0x195d0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_101; // 0x196d8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_100; // 0x197e0(0x108)
	char pad_198E8[0x8]; // 0x198e8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_9; // 0x198f0(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_37; // 0x19ad0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x19af0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_26; // 0x19b70(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0x19c10(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_99; // 0x19c40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_98; // 0x19d48(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_97; // 0x19e50(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_96; // 0x19f58(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36; // 0x1a060(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_95; // 0x1a080(0x108)
	char pad_1A188[0x8]; // 0x1a188(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_8; // 0x1a190(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_36; // 0x1a370(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x1a390(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_25; // 0x1a410(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0x1a4b0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_94; // 0x1a4e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_93; // 0x1a5e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_92; // 0x1a6f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_91; // 0x1a7f8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35; // 0x1a900(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_90; // 0x1a920(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_35; // 0x1aa28(0x20)
	char pad_1AA48[0x8]; // 0x1aa48(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_7; // 0x1aa50(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x1ac30(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_24; // 0x1acb0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0x1ad50(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0x1ad80(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x1adb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x1add8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x1ae00(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_89; // 0x1ae28(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_88; // 0x1af30(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_34; // 0x1b038(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_87; // 0x1b058(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_86; // 0x1b160(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1b268(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_85; // 0x1b2b0(0x108)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_10; // 0x1b3b8(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_34; // 0x1b468(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0x1b488(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x1b528(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x1b5a8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x1b648(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x1b6c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x1b768(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_28; // 0x1b7e8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x1b8b0(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_78; // 0x1b930(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_77; // 0x1ba18(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_76; // 0x1bb00(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_27; // 0x1bbe8(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_23; // 0x1bcb0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0x1bd50(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_9; // 0x1bd80(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_84; // 0x1be30(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_83; // 0x1bf38(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33; // 0x1c040(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_82; // 0x1c060(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_81; // 0x1c168(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x1c270(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_80; // 0x1c2b8(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_6; // 0x1c3c0(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33; // 0x1c5a0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x1c5c0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x1c660(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x1c6e0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x1c780(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x1c800(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x1c8a0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_26; // 0x1c920(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x1c9e8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_75; // 0x1ca68(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_74; // 0x1cb50(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_73; // 0x1cc38(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_25; // 0x1cd20(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_22; // 0x1cde8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x1ce88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x1ceb8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x1cf68(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x1cf98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x1cfc0(0x28)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_8; // 0x1cfe8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32; // 0x1d098(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_79; // 0x1d0b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_78; // 0x1d1c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_77; // 0x1d2c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_76; // 0x1d3d0(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x1d4d8(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_75; // 0x1d520(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32; // 0x1d628(0x20)
	char pad_1D648[0x8]; // 0x1d648(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5; // 0x1d650(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x1d830(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x1d8d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x1d950(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x1d9d0(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_24; // 0x1da70(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x1db38(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_23; // 0x1dbd8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_72; // 0x1dca0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x1dd88(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x1de08(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_71; // 0x1de88(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70; // 0x1df70(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_21; // 0x1e058(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x1e0f8(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_7; // 0x1e128(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31; // 0x1e1d8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_74; // 0x1e1f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_73; // 0x1e300(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_72; // 0x1e408(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_71; // 0x1e510(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x1e618(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_70; // 0x1e660(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31; // 0x1e768(0x20)
	char pad_1E788[0x8]; // 0x1e788(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4; // 0x1e790(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x1e970(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x1ea10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x1ea90(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x1eb10(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_22; // 0x1ebb0(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x1ec78(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_21; // 0x1ed18(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_69; // 0x1ede0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x1eec8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x1ef48(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_68; // 0x1efc8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_67; // 0x1f0b0(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_20; // 0x1f198(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x1f238(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x1f268(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x1f318(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x1f348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x1f370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x1f398(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x1f3c0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x1f410(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_20; // 0x1f460(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x1f528(0x38)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_69; // 0x1f560(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30; // 0x1f668(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30; // 0x1f688(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_68; // 0x1f6a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_67; // 0x1f7b0(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x1f8b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x1f938(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_66; // 0x1f968(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_65; // 0x1fa70(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29; // 0x1fb78(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_64; // 0x1fb98(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_63; // 0x1fca0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_62; // 0x1fda8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_61; // 0x1feb0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_60; // 0x1ffb8(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x200c0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x20140(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x201e0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x20280(0x80)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_6; // 0x20300(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x203b0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29; // 0x203f8(0x20)
	char pad_20418[0x8]; // 0x20418(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0x20420(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x20600(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19; // 0x206a0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x20768(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x207e8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_66; // 0x20868(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_65; // 0x20950(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_64; // 0x20a38(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18; // 0x20b20(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_19; // 0x20be8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x20c88(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_5; // 0x20cb8(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_59; // 0x20d68(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_58; // 0x20e70(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28; // 0x20f78(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_57; // 0x20f98(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_56; // 0x210a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_55; // 0x211a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_54; // 0x212b0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_53; // 0x213b8(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x214c0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x21540(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x215e0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x21680(0x80)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x21700(0x1e0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x218e0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28; // 0x21928(0x20)
	char pad_21948[0x8]; // 0x21948(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x21950(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x21b30(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x21bd0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x21c98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x21d18(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_63; // 0x21d98(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_62; // 0x21e80(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_61; // 0x21f68(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0x22050(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_18; // 0x22118(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x221b8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x221e8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x22298(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x222c8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x22378(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_36; // 0x223f8(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_52; // 0x224b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_51; // 0x225c0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27; // 0x226c8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27; // 0x226e8(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x22708(0x30)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_17; // 0x22738(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_50; // 0x227d8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_49; // 0x228e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_48; // 0x229e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_47; // 0x22af0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_46; // 0x22bf8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26; // 0x22d00(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26; // 0x22d20(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_45; // 0x22d40(0x108)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x22e48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x22e70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x22e98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x22ec0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x22ee8(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x22f10(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x22fc0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x23040(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x230c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x23140(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25; // 0x231c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25; // 0x231e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_44; // 0x23200(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_16; // 0x23308(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x233a8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x233d8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_60; // 0x23408(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x234f0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_59; // 0x235b8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_58; // 0x236a0(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_35; // 0x23788(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x23848(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x23878(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x238a0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x23950(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x23980(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x239c8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x23a10(0x48)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_4; // 0x23a58(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x23b08(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_43; // 0x23b88(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24; // 0x23c90(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24; // 0x23cb0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_42; // 0x23cd0(0x108)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3; // 0x23dd8(0xf0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_34; // 0x23ec8(0xc0)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x23f88(0xf0)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x24078(0xf0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x24168(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x24230(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x242b0(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_15; // 0x24378(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x24418(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x24448(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x244f8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x24528(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x245c8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_57; // 0x24648(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_56; // 0x24730(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_55; // 0x24818(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_54; // 0x24900(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x249e8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x24a68(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x24b08(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x24ba8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x24c48(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x24ce8(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x24d18(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x24dc8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_33; // 0x24e48(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x24f08(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x24f88(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_53; // 0x25008(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_52; // 0x250f0(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23; // 0x251d8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23; // 0x251f8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41; // 0x25218(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_14; // 0x25320(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x253c0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x253f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x25418(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x25440(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_32; // 0x254c0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x25580(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x25600(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x25630(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x25658(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x25680(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x256a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x256d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x25750(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x25780(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x25800(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x25830(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x258b0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x258e0(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_31; // 0x25990(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x25a50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x25a78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x25aa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x25ac8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x25af0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x25b18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x25b40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x25b68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x25b90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x25bb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x25be0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x25c08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x25c30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x25c58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x25c80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x25ca8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x25cd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x25cf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x25d20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x25d48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x25d70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x25d98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x25dc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x25de8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x25e10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x25e38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x25e60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x25e88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x25eb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x25ed8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x25f00(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x25f50(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_51; // 0x25ff0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x260d8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_30; // 0x26158(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_29; // 0x26218(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x262d8(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_13; // 0x26358(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x263f8(0x30)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_28; // 0x26428(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x264e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x26568(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x265e8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_50; // 0x266b0(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x26798(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x26860(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22; // 0x268e0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22; // 0x26900(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_40; // 0x26920(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_12; // 0x26a28(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_39; // 0x26ac8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21; // 0x26bd0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21; // 0x26bf0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_38; // 0x26c10(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_11; // 0x26d18(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x26db8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x26de8(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_8; // 0x26e68(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_49; // 0x26f38(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_27; // 0x27020(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x270e0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x271a0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_10; // 0x27220(0xa0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x272c0(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_48; // 0x27390(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x27478(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x274f8(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20; // 0x275b8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20; // 0x275d8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_37; // 0x275f8(0x108)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0x27700(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_47; // 0x277c8(0xe8)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_3; // 0x278b0(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_36; // 0x27960(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19; // 0x27a68(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19; // 0x27a88(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35; // 0x27aa8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18; // 0x27bb0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18; // 0x27bd0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34; // 0x27bf0(0x108)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0x27cf8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_46; // 0x27dc0(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17; // 0x27ea8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17; // 0x27ec8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33; // 0x27ee8(0x108)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_45; // 0x27ff0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x280d8(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0x28158(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0x28228(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x282e8(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x283b0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x28470(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_9; // 0x284f0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_44; // 0x28590(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x28678(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x286f8(0xd0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32; // 0x287c8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0x288d0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0x288f0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31; // 0x28910(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30; // 0x28a18(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0x28b20(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0x28b40(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29; // 0x28b60(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x28c68(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_43; // 0x28d30(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_42; // 0x28e18(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_41; // 0x28f00(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x28fe8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x29018(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x29098(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_40; // 0x29168(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x29250(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x292d0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x29390(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x29450(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x29510(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x29530(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28; // 0x29550(0x108)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_39; // 0x29658(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x29740(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x297c0(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x29890(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x29950(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x29a18(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x29ad8(0x80)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_2; // 0x29b58(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x29c08(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x29c28(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27; // 0x29c48(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x29d50(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x29d70(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26; // 0x29d90(0x108)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x29e98(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_38; // 0x29f60(0xe8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25; // 0x2a048(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x2a150(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x2a170(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24; // 0x2a190(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23; // 0x2a298(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x2a3a0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x2a3c0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0x2a3e0(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x2a4e8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_37; // 0x2a5b0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_36; // 0x2a698(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_8; // 0x2a780(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x2a820(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x2a908(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x2a988(0xd0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x2aa58(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x2ab20(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x2ac08(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_7; // 0x2ac88(0xa0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x2ad28(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x2adf8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x2aee0(0xe8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x2afc8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x2b0d0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x2b0f0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x2b110(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x2b218(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x2b248(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x2b2f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x2b328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x2b350(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x2b378(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x2b440(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x2b4c0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x2b588(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x2b608(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x2b6c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x2b748(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x2b7c8(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x2b888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x2b8b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x2b8d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2b900(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x2b928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2b950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x2b978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x2b9a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x2b9c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x2b9f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x2ba18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x2ba40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x2ba68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x2ba90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2bab8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2bae0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2bb08(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x2bb30(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x2bbf8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x2bce0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x2bdc8(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x2be68(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x2be88(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x2bea8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x2bfb0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x2c0b8(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x2c1c0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x2c260(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x2c348(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x2c430(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x2c4d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x2c500(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x2c580(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x2c640(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x2c728(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x2c7c8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x2c890(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x2c958(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x2c9d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x2ca58(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x2cad8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x2cb08(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x2cb88(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x2cc48(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x2cd30(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x2cdd0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x2ce98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x2cf18(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x2cf98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x2cfc8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x2d048(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x2d108(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x2d1f0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x2d290(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x2d358(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x2d3d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x2d458(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x2d488(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x2d508(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x2d5c8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x2d6b0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2d750(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2d818(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x2d8e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2d960(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2d9e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x2da60(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2da90(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x2dab8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x2db80(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x2dc68(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x2dc88(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x2dca8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x2ddb0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x2deb8(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x2dfc0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x2e060(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x2e148(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x2e230(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x2e2d0(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x2e300(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x2e3c8(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x2e4b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x2e4d0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x2e4f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x2e5f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x2e700(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x2e808(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x2e8a8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x2e990(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x2ea78(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x2eb18(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x2eb48(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x2ec10(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x2ecf8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x2ed18(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x2ed38(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x2ee40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x2ef48(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x2f050(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x2f0f0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x2f1d8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x2f2c0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x2f360(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x2f390(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x2f458(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x2f540(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x2f560(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x2f580(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x2f688(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x2f790(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x2f898(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x2f938(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x2fa20(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x2fb08(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x2fba8(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x2fbd8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x2fca0(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2fd88(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2fda8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x2fdc8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2fed0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2ffd8(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x300e0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x30180(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x30268(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x30350(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x303f0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x30420(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x30448(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x30478(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x30528(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x30558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x30580(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x305a8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x30628(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x306e8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x307b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x30830(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x308b0(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x30970(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x30998(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x309c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x309e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x30a10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x30a38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x30a60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x30a88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x30ab0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x30ad8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x30bc0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x30ca8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x30d48(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x30d78(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x30e60(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x30f48(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x30fe8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x31018(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x31100(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x311e8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x31288(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x312b8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x313a0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x31488(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x31528(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x31558(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x31580(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x315b0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x31660(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x31690(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x31798(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x317b8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x317d8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x31878(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x31938(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x319b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x31a38(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x31ab8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x31b78(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x31bf8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x31c98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x31d38(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x31db8(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x31e78(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x31f18(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x31f98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x32018(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x32098(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x32158(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x321d8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x32278(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x32338(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x323b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x32438(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x324b8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x32578(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x325f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x32698(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x32738(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x327b8(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x32878(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x32918(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x32998(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x32a18(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x32a98(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x32b58(0x80)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle; // 0x32bd8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x32c88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x32cb8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x32d68(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x32db0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x32de0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x32e90(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x32fe8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x33010(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x33168(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x33190(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x332e8(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x333a8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x333f0(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x33438(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x33500(0x38)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x33538(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x335d8(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x33730(0x118)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x33848(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x338c8(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x33990(0x30)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_14; // 0x339c0(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_13; // 0x33ab0(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_12; // 0x33ba0(0xf0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x33c90(0x20)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_11; // 0x33cb0(0xf0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x33da0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x33dc0(0x158)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_10; // 0x33f18(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_9; // 0x34008(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_8; // 0x340f8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_7; // 0x341e8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_6; // 0x342d8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_5; // 0x343c8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_4; // 0x344b8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_3; // 0x345a8(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_2; // 0x34698(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x34788(0xf0)
	bool PoseInitialized; // 0x34878(0x01)
	char pad_34879[0x3]; // 0x34879(0x03)
	float RotationOffsetInterpSpeed; // 0x3487c(0x04)
	float ZOffsetInterpSpeed; // 0x34880(0x04)
	enum class ENUM_RangedWeaponCategories CurrentRangedWeapon; // 0x34884(0x01)
	enum class ENUM_MeleeWeaponCategories CurrentMeleeWeapon; // 0x34885(0x01)
	bool IsMale; // 0x34886(0x01)
	char pad_34887[0x1]; // 0x34887(0x01)
	float FireWeaponBlendInTime; // 0x34888(0x04)
	char pad_3488C[0x4]; // 0x3488c(0x04)
	struct UBlendSpaceBase* LastPowerAimOffset; // 0x34890(0x08)
	float PowerAimOffsetAlpha; // 0x34898(0x04)
	bool bHasValidPowerAimOffset; // 0x3489c(0x01)
	char pad_3489D[0x3]; // 0x3489d(0x03)
	struct TArray<enum class ENUM_RangedWeaponCategories> WPN Ranged - DualHanded; // 0x348a0(0x10)
	bool ShouldLeaveStop; // 0x348b0(0x01)
	char pad_348B1[0x7]; // 0x348b1(0x07)
	struct TArray<enum class ENUM_RangedWeaponCategories> IsDualHandRangedWeapon; // 0x348b8(0x10)
	struct TArray<enum class ENUM_MeleeWeaponCategories> WPN Melee - SingleHanded; // 0x348c8(0x10)
	struct TArray<enum class ENUM_RangedWeaponCategories> WPN Ranged - SingleHanded; // 0x348d8(0x10)
	enum class ETigerClan CurrentPlayerClan; // 0x348e8(0x01)
	char pad_348E9[0x7]; // 0x348e9(0x07)
	struct TMap<enum class EPhysicalSurface, struct FName> SurfaceToAudioName; // 0x348f0(0x50)
	bool RecentlyLeftWallSlide; // 0x34940(0x01)
	enum class ENUM_SettleType SettleEventEnum_Aim; // 0x34941(0x01)
	enum class ENUM_SettleType SettleEventEnum_Crouch; // 0x34942(0x01)
	char pad_34943[0x1]; // 0x34943(0x01)
	float OverrideRightHand; // 0x34944(0x04)
	float OverrideLeftHand; // 0x34948(0x04)
	bool ActivateBackFlip; // 0x3494c(0x01)
	bool R; // 0x3494d(0x01)
	char pad_3494E[0x2]; // 0x3494e(0x02)
	struct TArray<enum class ENUM_RangedWeaponCategories> WPN Ranged - TwoHanded; // 0x34950(0x10)
	float Override Right Hand Null; // 0x34960(0x04)
	float Override Left Hand Null; // 0x34964(0x04)
	enum class ENUM_SettleType SettleEventEnum_HideWeapon; // 0x34968(0x01)
	char pad_34969[0x7]; // 0x34969(0x07)
	struct TArray<enum class ENUM_MeleeWeaponCategories> WPN Melee - DualHanded; // 0x34970(0x10)
	struct TArray<enum class ENUM_RangedWeaponCategories> OneHandedHipWeaponsMovingList; // 0x34980(0x10)
	bool (Fp)OneHandedHipWeaponsMoving; // 0x34990(0x01)
	bool Has Input? (before setting var); // 0x34991(0x01)
	char pad_34992[0x2]; // 0x34992(0x02)
	float RecoilKickAlpha; // 0x34994(0x04)
	bool IsSecondMagazine; // 0x34998(0x01)
	bool (Fp)OneHandedHipWeapons; // 0x34999(0x01)
	char pad_3499A[0x6]; // 0x3499a(0x06)
	struct TArray<enum class ENUM_RangedWeaponCategories> OneHandedHipWeaponsList; // 0x349a0(0x10)
	struct TMap<enum class ENUM_RangedWeaponCategories, float> RecoilShakeAlphaAddMap; // 0x349b0(0x50)
	struct TArray<enum class ENUM_RangedWeaponCategories> RecoilShakeWeaponsMap; // 0x34a00(0x10)
	struct TMap<enum class ENUM_RangedWeaponCategories, float> ADSRecoilKickAlpha; // 0x34a10(0x50)
	struct FRotator MagazineRotationAmount; // 0x34a60(0x0c)
	bool ShouldMagazineMoveWhileShooting; // 0x34a6c(0x01)
	char pad_34A6D[0x3]; // 0x34a6d(0x03)
	float WeaponArmPoseAlpha; // 0x34a70(0x04)
	bool IsUnarmed; // 0x34a74(0x01)
	char pad_34A75[0x3]; // 0x34a75(0x03)
	struct UAnimMetaData* Array Element; // 0x34a78(0x08)
	struct FName CurrentPhysMaterial; // 0x34a80(0x08)
	struct FName PhysMaterialSet; // 0x34a88(0x08)
	bool TwistBonesEnabled; // 0x34a90(0x01)
	char pad_34A91[0xf]; // 0x34a91(0x0f)
	struct FTransform ScaleClavicleLReferenceTransform; // 0x34aa0(0x30)
	struct FTransform ScaleClavicleRReferenceTransform; // 0x34ad0(0x30)
	bool ScaleReferencePosesSet; // 0x34b00(0x01)
	bool ScaleResetToReferencePoses; // 0x34b01(0x01)

	void DrawAnimationLayer(struct FPoseLink DrawInPose, struct FPoseLink& DrawAnimationLayer); // Function ABP_Player.ABP_Player_C.DrawAnimationLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void SoaringLeapLeaningLayer(struct FPoseLink SoringLeapInPose, struct FPoseLink& SoaringLeapLeaningLayer); // Function ABP_Player.ABP_Player_C.SoaringLeapLeaningLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void DiabloAnimationLayer(struct FPoseLink InPose, struct FPoseLink& DiabloAnimationLayer); // Function ABP_Player.ABP_Player_C.DiabloAnimationLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void MeleeAnimationLayer(struct FPoseLink MeleeInPose, struct FPoseLink& MeleeAnimationLayer); // Function ABP_Player.ABP_Player_C.MeleeAnimationLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
