// WidgetBlueprintGeneratedClass TBP_UI_SystemMenuGameplaySettings.TBP_UI_SystemMenuGameplaySettings_C
// Size: 0x710 (Inherited: 0x298)
struct UTBP_UI_SystemMenuGameplaySettings_C : UTigerMenuWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x298(0x08)
	struct UTBP_UI_StyledComboBox_C* AudioLanguageSelect; // 0x2a0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* AutoSprintItem; // 0x2a8(0x08)
	struct UTBP_UI_CheckBox_C* AutoSprintToggle; // 0x2b0(0x08)
	struct UTBP_UI_CheckBox_C* AutoSwapDefaultPistol; // 0x2b8(0x08)
	struct UTBP_UI_ConfirmMenu_C* ConflictStreamerPrompt; // 0x2c0(0x08)
	struct UVerticalBox* CrossplayDescription; // 0x2c8(0x08)
	struct UTBP_UI_SliderWBox_C* DampenHorizontalStrengthSlider; // 0x2d0(0x08)
	struct UTBP_UI_SliderWBox_C* DampenVerticalStrengthSlider; // 0x2d8(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* EnableCrossplayItem; // 0x2e0(0x08)
	struct UTBP_UI_CheckBox_C* EnableCrossplayToggle; // 0x2e8(0x08)
	struct UTBP_UI_MatchMaker_TabButton_C* Gamepad_Submenu_Button; // 0x2f0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadAdaptiveTriggersItem; // 0x2f8(0x08)
	struct UTBP_UI_CheckBox_C* GamepadAdaptiveTriggersToggle; // 0x300(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadAdaptiveTriggerVibrationItem; // 0x308(0x08)
	struct UTBP_UI_CheckBox_C* GamepadAdaptiveTriggerVibrationToggle; // 0x310(0x08)
	struct UTBP_UI_CheckBox_C* GamepadAimAssistRotationToggle; // 0x318(0x08)
	struct UTBP_UI_CheckBox_C* GamepadAimAssistSlowDownToggle; // 0x320(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostDelayTimeItem; // 0x328(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostDelayTimeSlider; // 0x330(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostHorizontalADSStrengthItem; // 0x338(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostHorizontalADSStrengthSlider; // 0x340(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostHorizontalScopedStrengthItem; // 0x348(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostHorizontalScopedStrengthSlider; // 0x350(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostHorizontalStrengthItem; // 0x358(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostHorizontalStrengthSlider; // 0x360(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostItem; // 0x368(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostRampTimeItem; // 0x370(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostRampTimeSlider; // 0x378(0x08)
	struct UTBP_UI_CheckBox_C* GamepadBoostToggle; // 0x380(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostVerticalADSStrengthItem; // 0x388(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostVerticalADSStrengthSlider; // 0x390(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostVerticalScopedStrengthItem; // 0x398(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostVerticalScopedStrengthSlider; // 0x3a0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostVerticalStrengthItem; // 0x3a8(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostVerticalStrengthSlider; // 0x3b0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadBoostZoneItem; // 0x3b8(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadBoostZoneSlider; // 0x3c0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenHorizontalADSStrengthItem; // 0x3c8(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDampenHorizontalADSStrengthSlider; // 0x3d0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenHorizontalScopedStrengthItem; // 0x3d8(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDampenHorizontalScopedStrengthSlider; // 0x3e0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenHorizontalStrengthItem; // 0x3e8(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenItem; // 0x3f0(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenTimeItem; // 0x3f8(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDampenTimeSlider; // 0x400(0x08)
	struct UTBP_UI_CheckBox_C* GamepadDampenToggle; // 0x408(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenVerticalADSStrengthItem; // 0x410(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDampenVerticalADSStrengthSlider; // 0x418(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenVerticalScopedStrengthItem; // 0x420(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDampenVerticalScopedStrengthSlider; // 0x428(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenVerticalStrengthItem; // 0x430(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* GamepadDampenZoneItem; // 0x438(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDampenZoneSlider; // 0x440(0x08)
	struct UTBP_UI_SliderWBox_C* GamepadDeadZoneSlider; // 0x448(0x08)
	struct UTBP_UI_CheckBox_C* GamepadInvertXToggle; // 0x450(0x08)
	struct UTBP_UI_CheckBox_C* GamepadInvertYToggle; // 0x458(0x08)
	struct UVerticalBox* GamepadSubItemBox; // 0x460(0x08)
	struct UTBP_UI_StyledComboBox_C* GamepadWeaponCycleStylePreset; // 0x468(0x08)
	struct UTBP_UI_MatchMaker_TabButton_C* Gameplay_Submenu_Button; // 0x470(0x08)
	struct UWidgetSwitcher* GameplaySettingsSwitcher; // 0x478(0x08)
	struct UVerticalBox* GeneralSubItemBox; // 0x480(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* HoldForHeightenedSensesItem; // 0x488(0x08)
	struct UTBP_UI_CheckBox_C* HoldForHeightenedSensesToggle; // 0x490(0x08)
	struct UTBP_UI_CheckBox_C* HoldForInventoryToggleKeyboard; // 0x498(0x08)
	struct UTBP_UI_CheckBox_C* HoldJumpToClimbGamepad; // 0x4a0(0x08)
	struct UTBP_UI_CheckBox_C* HoldJumpToClimbKeyboard; // 0x4a8(0x08)
	struct UTBP_UI_CheckBox_C* HoldToAimToggle; // 0x4b0(0x08)
	struct UTBP_UI_SliderWBox_C* HorizontalGamepadAimingSensitivitySlider; // 0x4b8(0x08)
	struct UTBP_UI_SliderWBox_C* HorizontalGamepadScopedSensitivitySlider; // 0x4c0(0x08)
	struct UTBP_UI_SliderWBox_C* HorizontalGamepadSensitivitySlider; // 0x4c8(0x08)
	struct UTBP_UI_SliderWBox_C* HorizontalMouseAimingSensitivitySlider; // 0x4d0(0x08)
	struct UTBP_UI_SliderWBox_C* HorizontalMouseScopedSensitivitySlider; // 0x4d8(0x08)
	struct UTBP_UI_SliderWBox_C* HorizontalMouseSensitivitySlider; // 0x4e0(0x08)
	struct UTBP_UI_StyledComboBox_C* InputCurveSelect; // 0x4e8(0x08)
	struct UTBP_UI_StyledComboBox_C* InputPresets; // 0x4f0(0x08)
	struct UTBP_UI_MatchMaker_TabButton_C* KeyboardMouse_Submenu_Button; // 0x4f8(0x08)
	struct UVerticalBox* KeyboardMouseSubItemBox; // 0x500(0x08)
	struct UTBP_UI_MatchMaker_TabButton_C* Language_Submenu_Button; // 0x508(0x08)
	struct UVerticalBox* LanguageSubItemBox; // 0x510(0x08)
	struct UTBP_UI_CheckBox_C* MouseInvertXToggle; // 0x518(0x08)
	struct UTBP_UI_CheckBox_C* MouseInvertYToggle; // 0x520(0x08)
	struct UTBP_UI_StyledComboBox_C* MouseWeaponCycleStylePreset; // 0x528(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* MuteGeneralChatItem; // 0x530(0x08)
	struct UTBP_UI_CheckBox_C* MuteGeneralChatToggle; // 0x538(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* RotateMiniMapItem; // 0x540(0x08)
	struct UTBP_UI_CheckBox_C* RotateMiniMapToggle; // 0x548(0x08)
	struct UTBP_UI_SliderWBox_C* RumbleIntensitySlider; // 0x550(0x08)
	struct UTBP_UI_SystemMenuSettingDescription_C* SettingDescriptionWidget; // 0x558(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* ShowAdvancedOptionsItem; // 0x560(0x08)
	struct UTBP_UI_CheckBox_C* ShowAdvancedOptionsToggle; // 0x568(0x08)
	struct UTBP_UI_Scrollbox_C* TBP_UI_Scrollbox_106; // 0x570(0x08)
	struct UTBP_UI_Scrollbox_C* TBP_UI_Scrollbox_226; // 0x578(0x08)
	struct UTBP_UI_Scrollbox_C* TBP_UI_Scrollbox_323; // 0x580(0x08)
	struct UTBP_UI_Submenu_Header_C* TBP_UI_Submenu_Header; // 0x588(0x08)
	struct UTBP_UI_StyledComboBox_C* TextLanguageSelect; // 0x590(0x08)
	struct UTigerStyledRichTextBlock* TigerStyledRichTextBlock_166; // 0x598(0x08)
	struct UTigerStyledRichTextBlock* TigerStyledRichTextBlock_383; // 0x5a0(0x08)
	struct UTBP_UI_SystemMenuItem_C* TutorialRetryButton; // 0x5a8(0x08)
	struct UTBP_UI_SystemMenuSettingsListItem_C* TutorialRetryItem; // 0x5b0(0x08)
	struct UTBP_UI_SliderWBox_C* VerticalGamepadAimingSensitivitySlider; // 0x5b8(0x08)
	struct UTBP_UI_SliderWBox_C* VerticalGamepadScopedSensitivitySlider; // 0x5c0(0x08)
	struct UTBP_UI_SliderWBox_C* VerticalGamepadSensitivitySlider; // 0x5c8(0x08)
	struct UTBP_UI_SliderWBox_C* VerticalMouseAimingSensitivitySlider; // 0x5d0(0x08)
	struct UTBP_UI_SliderWBox_C* VerticalMouseScopedSensitivitySlider; // 0x5d8(0x08)
	struct UTBP_UI_SliderWBox_C* VerticalMouseSensitivitySlider; // 0x5e0(0x08)
	struct UTBP_UI_SystemMenuItem_C* CurrentlySelectedSystemMenuItem; // 0x5e8(0x08)
	struct TArray<struct FIntPoint> AvailableResolutions; // 0x5f0(0x10)
	struct FIntPoint CurrentlySelectedResolution; // 0x600(0x08)
	struct FText Submenu_Gameplay; // 0x608(0x18)
	struct FText Submenu_KeyboardMouse; // 0x620(0x18)
	struct FText Submenu_Gamepad; // 0x638(0x18)
	struct FText Submenu_Language; // 0x650(0x18)
	struct TArray<struct FText> InputTexts; // 0x668(0x10)
	struct TArray<struct FString> AvailableAudioLanguages; // 0x678(0x10)
	struct TArray<struct FString> AvailableTextLanguages; // 0x688(0x10)
	struct TMap<struct FString, struct FText> AudioLanguageDisplayNames; // 0x698(0x50)
	struct TSoftObjectPtr<UTigerGameFlowStateBoot> BootFlow; // 0x6e8(0x28)

	void HasUnappliedChanges(bool& OutHasUnappliedChanges); // Function TBP_UI_SystemMenuGameplaySettings.TBP_UI_SystemMenuGameplaySettings_C.HasUnappliedChanges // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void ApplyChanges(bool& OutShouldShowRevertPrompt, bool& OutNeedsRestart); // Function TBP_UI_SystemMenuGameplaySettings.TBP_UI_SystemMenuGameplaySettings_C.ApplyChanges // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void SetInputCurve(int32_t InCurveIndex); // Function TBP_UI_SystemMenuGameplaySettings.TBP_UI_SystemMenuGameplaySettings_C.SetInputCurve // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void BindCurvesToListItems(); // Function TBP_UI_SystemMenuGameplaySettings.TBP_UI_SystemMenuGameplaySettings_C.BindCurvesToListItems // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
