// Class Tiger.ChooseNextWaypoint
// Size: 0xe8 (Inherited: 0x70)
struct UChooseNextWaypoint : UBTTaskNode {
	struct FBlackboardKeySelector Index; // 0x70(0x28)
	struct FBlackboardKeySelector Waypoint; // 0x98(0x28)
	struct FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0(0x28)
};

// Class Tiger.TigerBuff
// Size: 0x268 (Inherited: 0x28)
struct UTigerBuff : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FTigerCharacterStatModification StatModification; // 0x30(0xa8)
	struct FTigerStatusEffect StatusEffect; // 0xd8(0x0d)
	char pad_E5[0x3]; // 0xe5(0x03)
	float Duration; // 0xe8(0x04)
	bool bDoesTick; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)
	float TimeBetweenTicks; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FTigerNiagaraAttachment ActivatedNiagaraAttachment; // 0xf8(0x48)
	struct FTigerNiagaraAttachment NiagaraAttachment; // 0x140(0x48)
	struct TArray<struct FTigerNiagaraAttachment> AdditionalNiagaraAttachments; // 0x188(0x10)
	struct FTigerNiagaraAttachment DeactivatedNiagaraAttachment; // 0x198(0x48)
	bool bOnlySpawnBuffParticleOnLocalPlayer; // 0x1e0(0x01)
	bool bShowParticlesOnHiddenEnemies; // 0x1e1(0x01)
	bool bAttachToMesh; // 0x1e2(0x01)
	char pad_1E3[0x1]; // 0x1e3(0x01)
	struct FName AttachPoint; // 0x1e4(0x08)
	bool bBuffParticleTypeAbsoluteRotation; // 0x1ec(0x01)
	char pad_1ED[0x3]; // 0x1ed(0x03)
	struct UParticleSystem* BuffParticleType; // 0x1f0(0x08)
	bool bSpawnActivatedParticleOnRefresh; // 0x1f8(0x01)
	bool bOnlySpawnActivatedParticleOnLocalPlayer; // 0x1f9(0x01)
	bool bAttachActivatedParticle; // 0x1fa(0x01)
	bool bActivatedParticleTypeAbsoluteRotation; // 0x1fb(0x01)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	struct UParticleSystem* ActivatedParticleType; // 0x200(0x08)
	bool bOnlySpawnDeactivatedParticleOnLocalPlayer; // 0x208(0x01)
	bool bAttachDeactivatedParticle; // 0x209(0x01)
	bool bDeactivatedParticleTypeAbsoluteRotation; // 0x20a(0x01)
	char pad_20B[0x5]; // 0x20b(0x05)
	struct UParticleSystem* DeactivatedParticleType; // 0x210(0x08)
	struct FName ActivationMontageName; // 0x218(0x08)
	struct UAkAudioEvent* ActivatedSFX; // 0x220(0x08)
	struct UAkAudioEvent* DeactivatedSFX; // 0x228(0x08)
	bool bStacks; // 0x230(0x01)
	bool bOnlyStackWithDifferentCasters; // 0x231(0x01)
	char pad_232[0x2]; // 0x232(0x02)
	int32_t MaxStacks; // 0x234(0x04)
	bool bKeepAfterDeath; // 0x238(0x01)
	char pad_239[0x3]; // 0x239(0x03)
	int32_t RemoveBuffOnActions; // 0x23c(0x04)
	bool bShowOnUI; // 0x240(0x01)
	char pad_241[0x7]; // 0x241(0x07)
	struct UTexture2D* StatusImage; // 0x248(0x08)
	enum class ETigerBuffStatusType StatusType; // 0x250(0x01)
	enum class ETigerBuffProgressType ProgressType; // 0x251(0x01)
	char pad_252[0x6]; // 0x252(0x06)
	struct ATigerBuffPostProcess* PostProcessEffect; // 0x258(0x08)
	uint64_t PersistentTelemetryID; // 0x260(0x08)

	void OnRefreshed(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.OnRefreshed // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnDeactivated(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.OnDeactivated // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnActivated(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.OnActivated // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	struct UTigerBuffInstance* FindBuffInstance(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.FindBuffInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec340
};

// Class Tiger.TigerBuffStun
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffStun : UTigerBuff {
};

// Class Tiger.TigerBuffBlockAILogic
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffBlockAILogic : UTigerBuff {
};

// Class Tiger.TigerBuffImmobilize
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffImmobilize : UTigerBuff {
};

// Class Tiger.TigerBuffGround
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffGround : UTigerBuff {
};

// Class Tiger.TigerBuffInvulnerable
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffInvulnerable : UTigerBuff {
};

// Class Tiger.TigerBuffInvisible
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffInvisible : UTigerBuff {
};

// Class Tiger.TigerBuffDisableClimbing
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffDisableClimbing : UTigerBuff {
};

// Class Tiger.TigerBuffBlockOffensiveActions
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffBlockOffensiveActions : UTigerBuff {
};

// Class Tiger.TigerKeyTextureMapping
// Size: 0x80 (Inherited: 0x30)
struct UTigerKeyTextureMapping : UDataAsset {
	struct TMap<struct FKey, struct UTexture2D*> KeyTextures; // 0x30(0x50)
};

// Class Tiger.PatrolComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UPatrolComponent : UActorComponent {
};

// Class Tiger.TigerActivatedAudioComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UTigerActivatedAudioComponent : UActorComponent {
	bool bApplyOcclusion; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct UAkAudioEvent* AkEventToPost; // 0xb8(0x08)
	struct UAkAudioEvent* AkStopEventToPost; // 0xc0(0x08)
	bool bDrawActivationDebug; // 0xc8(0x01)
	char pad_C9[0x17]; // 0xc9(0x17)
};

// Class Tiger.TigerRebuildableActor
// Size: 0x240 (Inherited: 0x228)
struct ATigerRebuildableActor : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct TArray<struct USceneComponent*> BuildCreatedComponents; // 0x230(0x10)

	void OnRebuild(); // Function Tiger.TigerRebuildableActor.OnRebuild // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	struct USceneComponent* ConvertToBuildComponent(struct USceneComponent* BlueprintCreatedComponent); // Function Tiger.TigerRebuildableActor.ConvertToBuildComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x150ce40
};

// Class Tiger.TigerActivatedObject
// Size: 0x280 (Inherited: 0x240)
struct ATigerActivatedObject : ATigerRebuildableActor {
	struct UStaticMeshComponent* BaseMesh; // 0x240(0x08)
	struct UAkAudioEvent* ActivationAudioEvent; // 0x248(0x08)
	bool bActivationAudioShouldPlay; // 0x250(0x01)
	bool bTriggerOnlyOnPlayers; // 0x251(0x01)
	bool bUseAudioActivationRadius; // 0x252(0x01)
	char pad_253[0x1]; // 0x253(0x01)
	float ActivationRadius; // 0x254(0x04)
	float AudioFadeOutDuration; // 0x258(0x04)
	bool bAllowOnHitEvents; // 0x25c(0x01)
	char pad_25D[0x3]; // 0x25d(0x03)
	struct TWeakObjectPtr<struct UPrimitiveComponent> WeakCharacterTrigger; // 0x260(0x08)
	char pad_268[0x18]; // 0x268(0x18)

	void SetCharacterTriggerComponent(struct UPrimitiveComponent* TriggerComponent); // Function Tiger.TigerActivatedObject.SetCharacterTriggerComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x13ca760
	void OnObjectDeactivated(); // Function Tiger.TigerActivatedObject.OnObjectDeactivated // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnObjectActivated(); // Function Tiger.TigerActivatedObject.OnObjectActivated // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnEndCharacterOverlap(struct ATigerCharacter* OverlappingCharacter, int32_t TotalOverlapCount); // Function Tiger.TigerActivatedObject.OnEndCharacterOverlap // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnCharacterHit(struct ATigerCharacter* InOverlappingCharacter, struct FVector InNormalImpulse, struct FHitResult& InHitResult); // Function Tiger.TigerActivatedObject.OnCharacterHit // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x18b4070
	void OnBeginCharacterOverlap(struct ATigerCharacter* OverlappingCharacter, int32_t TotalOverlapCount); // Function Tiger.TigerActivatedObject.OnBeginCharacterOverlap // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void EndCharacterOverlap(struct UPrimitiveComponent* InOverlappedComponent, struct AActor* InOtherActor, struct UPrimitiveComponent* InOtherComp, int32_t InOtherBodyIndex); // Function Tiger.TigerActivatedObject.EndCharacterOverlap // (Final|Native|Private) // @ game+0x13ca160
	void CharacterHit(struct UPrimitiveComponent* InHitComponent, struct AActor* InOtherActor, struct UPrimitiveComponent* InOtherComp, struct FVector InNormalImpulse, struct FHitResult& InHit); // Function Tiger.TigerActivatedObject.CharacterHit // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x13c9f80
	void BeginCharacterOverlap(struct UPrimitiveComponent* InOverlappedComponent, struct AActor* InOtherActor, struct UPrimitiveComponent* InOtherComp, int32_t InOtherBodyIndex, bool bInFromSweep, struct FHitResult& InSweepResult); // Function Tiger.TigerActivatedObject.BeginCharacterOverlap // (Final|Native|Private|HasOutParms) // @ game+0x13c9b00
};

// Class Tiger.TigerActivatedObjectSubsystem
// Size: 0xc0 (Inherited: 0x30)
struct UTigerActivatedObjectSubsystem : UGameInstanceSubsystem {
	char pad_30[0x90]; // 0x30(0x90)
};

// Class Tiger.TigerCameraBehavior
// Size: 0xe8 (Inherited: 0x28)
struct UTigerCameraBehavior : UObject {
	struct UTigerCameraPreset* CameraPreset; // 0x28(0x08)
	char pad_30[0xb8]; // 0x30(0xb8)
};

// Class Tiger.TigerActiveCameraBehavior
// Size: 0x128 (Inherited: 0xe8)
struct UTigerActiveCameraBehavior : UTigerCameraBehavior {
	char pad_E8[0x40]; // 0xe8(0x40)
};

// Class Tiger.TigerAdditiveCameraBehavior
// Size: 0x128 (Inherited: 0xe8)
struct UTigerAdditiveCameraBehavior : UTigerCameraBehavior {
	char pad_E8[0x40]; // 0xe8(0x40)
};

// Class Tiger.TigerAIAwayFromSuspiciousService
// Size: 0x140 (Inherited: 0x70)
struct UTigerAIAwayFromSuspiciousService : UBTService {
	struct FBox SearchFleeSpotBox; // 0x70(0x1c)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FBlackboardKeySelector FleePoint; // 0x90(0x28)
	struct FBlackboardKeySelector CurrentMasqueradeTarget; // 0xb8(0x28)
	struct FBlackboardKeySelector WantsToReportPlayer; // 0xe0(0x28)
	float KeepFleeingFromSpecificPlayerRadiusSquared; // 0x108(0x04)
	float BoxCenterDistanceFromNPCPosition; // 0x10c(0x04)
	uint32_t NumberOfTimesToRandomForAFleeSpot; // 0x110(0x04)
	bool bShowDebugFeatures; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	struct TWeakObjectPtr<struct ATigerPlayer> PlayerFleeingFrom; // 0x118(0x08)
	char pad_120[0x20]; // 0x120(0x20)
};

// Class Tiger.TigerAiBarkTask
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiBarkTask : UBTTaskNode {
	struct FTigerNpcVoCategory BarkToPlay; // 0x70(0x08)
};

// Class Tiger.TigerAiBaseController
// Size: 0x3b0 (Inherited: 0x330)
struct ATigerAiBaseController : AAIController {
	struct FVector SpawnPoint; // 0x330(0x0c)
	char pad_33C[0x4]; // 0x33c(0x04)
	struct UTigerSightConfigAsset* SightConfigAsset; // 0x340(0x08)
	char pad_348[0x68]; // 0x348(0x68)

	void UnregisterMovementTicket(); // Function Tiger.TigerAiBaseController.UnregisterMovementTicket // (Final|Native|Protected|BlueprintCallable) // @ game+0x13ca7f0
	float PlayAnimationUnreliable(struct UAnimMontage* Animation); // Function Tiger.TigerAiBaseController.PlayAnimationUnreliable // (Final|Native|Public|BlueprintCallable) // @ game+0x13ca6c0
	float PlayAnimationFromNameUnreliable(struct FName Animation); // Function Tiger.TigerAiBaseController.PlayAnimationFromNameUnreliable // (Final|Native|Public|BlueprintCallable) // @ game+0x13ca620
	bool HasPathToLocation(struct FVector& Location); // Function Tiger.TigerAiBaseController.HasPathToLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ca580
	bool GetSightProperties(enum class ETigerNPCType NPCType, struct FTigerSightConfigProperties& OutSightProps); // Function Tiger.TigerAiBaseController.GetSightProperties // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ca460
	struct UAISenseConfig_Sight* GetSightConfig(); // Function Tiger.TigerAiBaseController.GetSightConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ca430
	struct ATigerBaseNPC* GetBaseNpcPawn(); // Function Tiger.TigerAiBaseController.GetBaseNpcPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ca400
	bool FindPointOnAiNavMeshWithinExtent(struct FVector& Origin, struct FVector& Extent, struct FVector& OutLocation); // Function Tiger.TigerAiBaseController.FindPointOnAiNavMeshWithinExtent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ca2c0
};

// Class Tiger.TigerAIBenchmarkDiablerizeTask
// Size: 0xa8 (Inherited: 0x98)
struct UTigerAIBenchmarkDiablerizeTask : UBTTask_BlackboardBase {
	float MaximumDiablerizeDistance; // 0x98(0x04)
	char pad_9C[0xc]; // 0x9c(0x0c)
};

// Class Tiger.TigerAiBenchmarkDisciplineTask
// Size: 0xd8 (Inherited: 0x98)
struct UTigerAiBenchmarkDisciplineTask : UBTTask_BlackboardBase {
	struct ATigerLocalAIControllerBase* AIControllerBase; // 0x98(0x08)
	struct ATigerPlayerController* TigerPlayerController; // 0xa0(0x08)
	struct ATigerCharacter* AiTigerCharacter; // 0xa8(0x08)
	struct ATigerPlayer* TigerPlayer; // 0xb0(0x08)
	struct UTigerDisciplineComponent* DisciplineComponent; // 0xb8(0x08)
	struct UTigerDisciplineBase* CurrentDisciplineBase; // 0xc0(0x08)
	char pad_C8[0x10]; // 0xc8(0x10)
};

// Class Tiger.TigerAIBenchmarkFindPlayerTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIBenchmarkFindPlayerTask : UBTTask_BlackboardBase {
	bool bUseHeightenedSensesSearchRadius; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float CustomSearchSphereRadius; // 0x9c(0x04)
	bool bDrawSearchSphere; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float MaxVerticalPositionOffset; // 0xa4(0x04)
	float RaycastDistance; // 0xa8(0x04)
	int32_t SearchLowLevelThreshold; // 0xac(0x04)
	float SearchLowHealthPercentageThreshold; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// Class Tiger.TigerAiCalculateFiringLocationsScoreService
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAiCalculateFiringLocationsScoreService : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool bDebugDrawLocations; // 0x98(0x01)
	bool bDebugDrawSweepChecks; // 0x99(0x01)
	bool bDebugDrawInvalidLocationReason; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Tiger.TigerAiCanCrouch
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCanCrouch : UBTDecorator {
	float MinCrouchDistanceBuffer; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class Tiger.TigerAiCanFleeDecorator
// Size: 0x68 (Inherited: 0x68)
struct UTigerAiCanFleeDecorator : UBTDecorator {
};

// Class Tiger.TigerAICanInvestigateDecorator
// Size: 0x90 (Inherited: 0x68)
struct UTigerAICanInvestigateDecorator : UBTDecorator {
	struct FBlackboardKeySelector CurrentSuspiciousTarget; // 0x68(0x28)
};

// Class Tiger.TigerAiCanUseWeaponPowerDecorator
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCanUseWeaponPowerDecorator : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAICAPBase
// Size: 0x258 (Inherited: 0x228)
struct ATigerAICAPBase : AActor {
	struct TArray<struct ATigerNPC*> NPCUsingCAP; // 0x228(0x10)
	struct TArray<struct UShapeComponent*> Colliders; // 0x238(0x10)
	float Cooldown; // 0x248(0x04)
	int32_t NumberOfSlots; // 0x24c(0x04)
	bool bShouldAdjustTransform; // 0x250(0x01)
	bool bAllowExternalProps; // 0x251(0x01)
	char pad_252[0x6]; // 0x252(0x06)

	bool OnCheckNPCEligibility(struct ATigerNPC* NPC); // Function Tiger.TigerAICAPBase.OnCheckNPCEligibility // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	bool CapIsEmpty(); // Function Tiger.TigerAICAPBase.CapIsEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13c9f50
	void BeginOverlappedActor(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Tiger.TigerAICAPBase.BeginOverlappedActor // (Native|Public|HasOutParms) // @ game+0x13c9d30
};

// Class Tiger.TigerAICAP
// Size: 0x268 (Inherited: 0x258)
struct ATigerAICAP : ATigerAICAPBase {
	struct TArray<struct UTigerAICommandBase*> Commands; // 0x258(0x10)
};

// Class Tiger.TigerAiCheckCanDiablerize
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCheckCanDiablerize : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAiCheckIsTargetDowned
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCheckIsTargetDowned : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAIClearMasqueradeTargetTask
// Size: 0x70 (Inherited: 0x70)
struct UTigerAIClearMasqueradeTargetTask : UBTTaskNode {
};

// Class Tiger.TigerAICommandBase
// Size: 0x40 (Inherited: 0x28)
struct UTigerAICommandBase : UObject {
	struct ATigerAIController* Owner; // 0x28(0x08)
	struct AActor* WorldReferenceActor; // 0x30(0x08)
	float FailSafeMaxTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	void DeactivateCommand(bool bHasFinished); // Function Tiger.TigerAICommandBase.DeactivateCommand // (Native|Public|BlueprintCallable) // @ game+0x13cdd10
};

// Class Tiger.TigerAICommandAbandonCAP
// Size: 0x48 (Inherited: 0x40)
struct UTigerAICommandAbandonCAP : UTigerAICommandBase {
	float ChanceToAbandonCAP; // 0x40(0x04)
	bool bShouldFindSpline; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class Tiger.TigerAICommandComponent
// Size: 0x140 (Inherited: 0xb0)
struct UTigerAICommandComponent : UActorComponent {
	char pad_B0[0x40]; // 0xb0(0x40)
	struct ATigerAiPermanentCap* PermanentCap; // 0xf0(0x08)
	struct ATigerNPC* Owner; // 0xf8(0x08)
	struct UTigerAICommandBase* ActiveCommand; // 0x100(0x08)
	struct UAnimMontage* LastPlayedCapMontage; // 0x108(0x08)
	struct FTigerCommandQueue CommandQueue; // 0x110(0x10)
	struct FName ContextBaseIdle; // 0x120(0x08)
	char pad_128[0x18]; // 0x128(0x18)

	void SetContextIdle(struct FName ContextName); // Function Tiger.TigerAICommandComponent.SetContextIdle // (Final|Native|Public|BlueprintCallable) // @ game+0x13cdf80
	void InterruptAndClearCommands(); // Function Tiger.TigerAICommandComponent.InterruptAndClearCommands // (Final|Native|Public|BlueprintCallable) // @ game+0x13cde80
	struct UTigerAICommandBase* AddCommand(struct UTigerAICommandBase* Command, struct ATigerAICAPBase* CommandGiver); // Function Tiger.TigerAICommandComponent.AddCommand // (Final|Native|Public|BlueprintCallable) // @ game+0x13cda40
};

// Class Tiger.TigerAICommandContextualAction
// Size: 0x80 (Inherited: 0x40)
struct UTigerAICommandContextualAction : UTigerAICommandBase {
	struct TArray<struct FTigerContextualAnimationWrapper> ContextualAnimations; // 0x40(0x10)
	float WaitTimeBefore; // 0x50(0x04)
	float WaitTimeBeforeRandomDeviation; // 0x54(0x04)
	float WaitTimeAfter; // 0x58(0x04)
	float WaitTimeAfterRandomDeviation; // 0x5c(0x04)
	char pad_60[0x20]; // 0x60(0x20)
};

// Class Tiger.TigerAICommandMoveTo
// Size: 0x68 (Inherited: 0x40)
struct UTigerAICommandMoveTo : UTigerAICommandBase {
	struct FTigerAIMoveToLocationData MoveToData; // 0x40(0x18)
	char pad_58[0x10]; // 0x58(0x10)
};

// Class Tiger.TigerAICommandPlayerProximityWait
// Size: 0x48 (Inherited: 0x40)
struct UTigerAICommandPlayerProximityWait : UTigerAICommandBase {
	float SquaredPlayerProximityRadiusRequired; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Tiger.TigerAICommandWaitForOrder
// Size: 0x48 (Inherited: 0x40)
struct UTigerAICommandWaitForOrder : UTigerAICommandBase {
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Tiger.TigerAIController
// Size: 0x498 (Inherited: 0x3b0)
struct ATigerAIController : ATigerAiBaseController {
	struct FName LureTargetKeyName; // 0x3b0(0x08)
	struct FName CurrentMasqueradeTargetKeyName; // 0x3b8(0x08)
	struct FName TargetPositionKeyName; // 0x3c0(0x08)
	struct FName MasqueradeBreachTargetKey; // 0x3c8(0x08)
	struct FName BehaviorIsActiveKeyName; // 0x3d0(0x08)
	struct FName SpawnPointKeyName; // 0x3d8(0x08)
	struct FName ActiveCAPKeyName; // 0x3e0(0x08)
	struct UBehaviorTree* LureBehaviorTree; // 0x3e8(0x08)
	struct UBehaviorTree* BloodDrainedBehaviorTree; // 0x3f0(0x08)
	struct UBehaviorTree* EmptyBehaviorTree; // 0x3f8(0x08)
	struct UTigerFearValueAsset* FearValueAsset; // 0x400(0x08)
	float OutOfCombatHealthRegenerationDelay; // 0x408(0x04)
	float OutOfCombatHealthRegenerationTickInterval; // 0x40c(0x04)
	float OutOfCombatTickHealthPercentage; // 0x410(0x04)
	float TimeWhenEnteredBloodDrainedState; // 0x414(0x04)
	float CheckForPlayerWeaponsInterval; // 0x418(0x04)
	float CheckForPlayerWeaponsDeviation; // 0x41c(0x04)
	float BaseThreatRadiusForEquippedRanged; // 0x420(0x04)
	float BaseThreatRadiusForEquippedMelee; // 0x424(0x04)
	float FearValue; // 0x428(0x04)
	float MaxFearValue; // 0x42c(0x04)
	float MinCrouchDistanceFromPlayer; // 0x430(0x04)
	float ChanceToFleeWhenEnteringThreatenedState; // 0x434(0x04)
	char pad_438[0x30]; // 0x438(0x30)
	struct UTigerNpcMovementRestrictionBoundsData* MovementRestrictionBoundsData; // 0x468(0x08)
	struct UTigerNpcMovementRestrictionBoundsData* TargetMovementRestrictionBoundsData; // 0x470(0x08)
	char pad_478[0x20]; // 0x478(0x20)

	void SetupData(enum class ETigerNPCType InNpcType); // Function Tiger.TigerAIController.SetupData // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void SetNewReactionData(struct FTigerNpcReactionEvent& ReactionEvent); // Function Tiger.TigerAIController.SetNewReactionData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13ce2a0
	struct FTigerNpcReactionEvent SetLastReactionData(); // Function Tiger.TigerAIController.SetLastReactionData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ce1f0
	void SetFearValue(float InFearValue); // Function Tiger.TigerAIController.SetFearValue // (Final|Native|Public|BlueprintCallable) // @ game+0x13ce170
	void SetCurrentMasqueradeTarget(struct UBlackboardComponent* BBComp, struct ATigerCharacter* InLookAtTarget); // Function Tiger.TigerAIController.SetCurrentMasqueradeTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x13ce010
	void RunDefaultBehavior(); // Function Tiger.TigerAIController.RunDefaultBehavior // (Final|Native|Public|BlueprintCallable) // @ game+0x13cdf60
	void RequestInvestigationTicket(struct ATigerPlayer* TigerPlayer); // Function Tiger.TigerAIController.RequestInvestigationTicket // (Final|Native|Public|BlueprintCallable) // @ game+0x13cded0
	bool IsReacting(); // Function Tiger.TigerAIController.IsReacting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cdea0
	struct ATigerNPC* GetTigerPawn(); // Function Tiger.TigerAIController.GetTigerPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cde60
	float GetMaxFearValue(); // Function Tiger.TigerAIController.GetMaxFearValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cde40
	float GetFearValue(); // Function Tiger.TigerAIController.GetFearValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cde20
	float GetFearPercentage(); // Function Tiger.TigerAIController.GetFearPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cddf0
	enum class ETigerAIMasqueradeState GetCurrentBehaviorState(); // Function Tiger.TigerAIController.GetCurrentBehaviorState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cddd0
	struct ATigerAICAPBase* GetActiveCAP(); // Function Tiger.TigerAIController.GetActiveCAP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cdda0
	void ClearCurrentMasqueradeTarget(struct UBlackboardComponent* BBComp); // Function Tiger.TigerAIController.ClearCurrentMasqueradeTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x13cdc80
	void CancelLureBehavior(); // Function Tiger.TigerAIController.CancelLureBehavior // (Final|Native|Public|BlueprintCallable) // @ game+0x13cdc60
	void AdjustFearValue(float Adjustment); // Function Tiger.TigerAIController.AdjustFearValue // (Final|Native|Public|BlueprintCallable) // @ game+0x13cdb10
};

// Class Tiger.TigerAiMovementBudgetAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerAiMovementBudgetAsset : UDataAsset {
	struct TMap<struct FName, struct FTigerAiMovementBudget> MovementBudgets; // 0x30(0x50)
};

// Class Tiger.TigerAICoordinator
// Size: 0x3f8 (Inherited: 0xb0)
struct UTigerAICoordinator : UActorComponent {
	int32_t AttackingNpcForPlayerLimit; // 0xb0(0x04)
	float SprintTimeUntilReport; // 0xb4(0x04)
	float ClimbTimeUntilReport; // 0xb8(0x04)
	float AirTimeUntilReport; // 0xbc(0x04)
	float SuspicionStateTime; // 0xc0(0x04)
	float ThreatStateTime; // 0xc4(0x04)
	float SuspiciousStateEscapeRadiusSquared; // 0xc8(0x04)
	float ThreatenedStateEscapeRadiusSquared; // 0xcc(0x04)
	float MakeNearbyNPCsSuspiciousRadius; // 0xd0(0x04)
	float FearValueDecreasePerSecond; // 0xd4(0x04)
	float CrimeActionCooldownDistance; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	float CrimeActionMasqueradePointThreshold; // 0xe0(0x04)
	float PatrollingHelicopterEventRadius; // 0xe4(0x04)
	float PatrollingHelicopterLowestResponseHeight; // 0xe8(0x04)
	float PatrollingHelicopterEventTimeOut; // 0xec(0x04)
	float PatrollingHelicopterTimeBetweenGunfireEventPositionUpdate; // 0xf0(0x04)
	float TimeInSmokeUntilRemoval; // 0xf4(0x04)
	bool bUseMovementTickets; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
	struct UTigerAiMovementBudgetAsset* MovementBudgetAsset; // 0x100(0x08)
	bool bPatrollingHelicotpersAreActive; // 0x108(0x01)
	char pad_109[0x97]; // 0x109(0x97)
	struct TArray<struct ATigerEntityPatrollingHelicopter*> EntityPatrollingHelicopters; // 0x1a0(0x10)
	char pad_1B0[0x80]; // 0x1b0(0x80)
	struct TArray<struct UTigerAiEntityPlatoon*> EntityPlatoons; // 0x230(0x10)
	struct TArray<struct UTigerAiSquad*> Squads; // 0x240(0x10)
	char pad_250[0xa0]; // 0x250(0xa0)
	struct ATigerPlayerGrid* PlayerGrid; // 0x2f0(0x08)
	char pad_2F8[0xc8]; // 0x2f8(0xc8)
	struct TArray<struct FTigerPlayerActionProcessData> DelayedPlayerActionProcesses; // 0x3c0(0x10)
	char pad_3D0[0x28]; // 0x3d0(0x28)

	void SetNPCSightModifier(float Modifier); // Function Tiger.TigerAICoordinator.SetNPCSightModifier // (Final|Native|Public|BlueprintCallable) // @ game+0x13ce220
	void SetEnableAICoordinator(bool bEnabled); // Function Tiger.TigerAICoordinator.SetEnableAICoordinator // (Final|Native|Public|BlueprintCallable) // @ game+0x13ce0e0
	void CacheFearValueThresholds(struct UTigerFearValueAsset* CivFearValueAsset, struct UTigerFearValueAsset* PolFearValueAsset); // Function Tiger.TigerAICoordinator.CacheFearValueThresholds // (Final|Native|Public|BlueprintCallable) // @ game+0x13cdb90
};

// Class Tiger.TigerAiDisciplineTaskBase
// Size: 0xc8 (Inherited: 0x98)
struct UTigerAiDisciplineTaskBase : UBTTask_BlackboardBase {
	struct ATigerLocalAIController* LocalAIController; // 0x98(0x08)
	struct ATigerCharacter* AiTigerCharacter; // 0xa0(0x08)
	struct UTigerDisciplineComponent* DisciplineComponent; // 0xa8(0x08)
	struct UTigerDisciplineBase* CurrentDisciplineBase; // 0xb0(0x08)
	char pad_B8[0x10]; // 0xb8(0x10)
};

// Class Tiger.TigerAiEntityMovementModeService
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAiEntityMovementModeService : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	struct FBlackboardKeySelector bCanShootKey; // 0x98(0x28)
	float StartSprintDistanceBuffer; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// Class Tiger.TigerAiEntityPlatoon
// Size: 0x58 (Inherited: 0x28)
struct UTigerAiEntityPlatoon : UObject {
	char pad_28[0x30]; // 0x28(0x30)
};

// Class Tiger.TigerAIEntityReactPlayersService
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAIEntityReactPlayersService : UBTService {
	struct FBlackboardKeySelector SuspiciousTarget; // 0x70(0x28)
	float ThresholdDistanceSquared; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAiFindFiringLocation
// Size: 0x118 (Inherited: 0x70)
struct UTigerAiFindFiringLocation : UBTTaskNode {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector FiringLocationKey; // 0x98(0x28)
	struct FBlackboardKeySelector FiringLocationIndexKey; // 0xc0(0x28)
	struct FBlackboardKeySelector bCanShootKey; // 0xe8(0x28)
	float ClaimedLocationDuration; // 0x110(0x04)
	bool bDebugDraw; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
};

// Class Tiger.TigerAIFireAtActorTask
// Size: 0xe8 (Inherited: 0x98)
struct UTigerAIFireAtActorTask : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector TargetToShootActorKey; // 0x98(0x28)
	struct FBlackboardKeySelector CanShootKey; // 0xc0(0x28)
};

// Class Tiger.TigerAIFleeFromThreatService
// Size: 0x140 (Inherited: 0x70)
struct UTigerAIFleeFromThreatService : UBTService {
	struct FBox SearchFleeSpotBox; // 0x70(0x1c)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FBlackboardKeySelector FleePoint; // 0x90(0x28)
	struct FBlackboardKeySelector ClosestThreatPosition; // 0xb8(0x28)
	struct FBlackboardKeySelector CurrentMasqueradeTarget; // 0xe0(0x28)
	float KeepFleeingFromSpecificPlayerRadiusSquared; // 0x108(0x04)
	float BoxCenterDistanceFromNPCPosition; // 0x10c(0x04)
	bool bShowDebugFeatures; // 0x110(0x01)
	char pad_111[0x3]; // 0x111(0x03)
	struct TWeakObjectPtr<struct ATigerPlayer> PlayerFleeingFrom; // 0x114(0x08)
	char pad_11C[0x24]; // 0x11c(0x24)
};

// Class Tiger.TigerAIGetSuspectTargetService
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAIGetSuspectTargetService : UBTService {
	struct FBlackboardKeySelector SuspectPosition; // 0x70(0x28)
	struct FBlackboardKeySelector CurrentSuspectTarget; // 0x98(0x28)
	bool bShowDebugFeatures; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
};

// Class Tiger.TigerAiGiveOrderToSquad
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiGiveOrderToSquad : UBTTaskNode {
	enum class ETigerNpcSquadOrder OrderToGive; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerAiSpawningCap
// Size: 0x290 (Inherited: 0x258)
struct ATigerAiSpawningCap : ATigerAICAPBase {
	struct USceneComponent* SceneComp; // 0x258(0x08)
	struct UChildActorComponent* NPCSpawner; // 0x260(0x08)
	struct FName SpawningGroup; // 0x268(0x08)
	struct FName SpawnedNpcMovementGroup; // 0x270(0x08)
	struct FGuid SpawningSubGroupId; // 0x278(0x10)
	char pad_288[0x8]; // 0x288(0x08)
};

// Class Tiger.TigerAIGroupCAP
// Size: 0x2a0 (Inherited: 0x290)
struct ATigerAIGroupCAP : ATigerAiSpawningCap {
	struct TArray<struct FTigerAiGroupCapSlot> CapSlots; // 0x290(0x10)

	bool TriggerNextCommandForSlot(struct ATigerNPC* NPC, int32_t CapSlotIndex); // Function Tiger.TigerAIGroupCAP.TriggerNextCommandForSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x13d2730
	bool OnRequestNewCommands(struct ATigerNPC* NPC); // Function Tiger.TigerAIGroupCAP.OnRequestNewCommands // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	bool OnIsAvailableCheck(); // Function Tiger.TigerAIGroupCAP.OnIsAvailableCheck // (Native|Event|Public|BlueprintEvent) // @ game+0x13d25c0
	bool IsSlotAvailable(int32_t Index); // Function Tiger.TigerAIGroupCAP.IsSlotAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13d2520
	int32_t GetSlotAssignedToNPC(struct ATigerNPC* NPC); // Function Tiger.TigerAIGroupCAP.GetSlotAssignedToNPC // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13d2460
	struct UTigerAICommandBase* GetNextCommand(struct FTigerAiGroupCapSlot& CapSlot, int32_t CapSlotIndex); // Function Tiger.TigerAIGroupCAP.GetNextCommand // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13d2310
	void CapCommandStarted(int32_t CapSlotIndex, int32_t CommandIndex); // Function Tiger.TigerAIGroupCAP.CapCommandStarted // (Final|Native|Public|BlueprintCallable) // @ game+0x13d2180
	bool AssignNpcToSlot(int32_t SlotIndex, struct ATigerNPC* NPC); // Function Tiger.TigerAIGroupCAP.AssignNpcToSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x13d20b0
};

// Class Tiger.TigerAiHasCurrentSquadOrder
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiHasCurrentSquadOrder : UBTDecorator {
	enum class ETigerNpcSquadOrder SquadOrderToCompare; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAiHasPlayerInSightDecorator
// Size: 0x68 (Inherited: 0x68)
struct UTigerAiHasPlayerInSightDecorator : UBTDecorator {
};

// Class Tiger.TigerAiIsHeightElevationBlockingVision
// Size: 0xc0 (Inherited: 0x68)
struct UTigerAiIsHeightElevationBlockingVision : UBTDecorator {
	struct FBlackboardKeySelector TargetLocationKey; // 0x68(0x28)
	struct FBlackboardKeySelector bCanSeeTargetKey; // 0x90(0x28)
	float MaxVerticalAngleToTarget; // 0xb8(0x04)
	float LargeEnoughHeightDifference; // 0xbc(0x04)
};

// Class Tiger.TigerAiIsInMovementRestrictionBoundsArea
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiIsInMovementRestrictionBoundsArea : UBTDecorator {
	enum class ETigerNpcMovementRestrictionBoundsArea AreaToCompare; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAiIsMovingOutOfBounds
// Size: 0x98 (Inherited: 0x68)
struct UTigerAiIsMovingOutOfBounds : UBTDecorator {
	struct FBlackboardKeySelector TargetPositionKey; // 0x68(0x28)
	float OutOfBoundsDistance; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Tiger.TigerAIIsReactingDecorator
// Size: 0x68 (Inherited: 0x68)
struct UTigerAIIsReactingDecorator : UBTDecorator {
};

// Class Tiger.TigerAiIsSquadCaptain
// Size: 0x68 (Inherited: 0x68)
struct UTigerAiIsSquadCaptain : UBTDecorator {
};

// Class Tiger.TigerAiJudgeController
// Size: 0x3f0 (Inherited: 0x3b0)
struct ATigerAiJudgeController : ATigerAiBaseController {
	struct UTigerAiJudgeSmComponent* JudgeStateMachineComp; // 0x3b0(0x08)
	struct FTigerSightConfigProperties StandardSightProperties; // 0x3b8(0x1c)
	struct FTigerSightConfigProperties CombatSightProperties; // 0x3d4(0x1c)

	void PlayTimedAnimationTriggers(struct TArray<struct FTigerTimedAnimationTrigger>& AnimationTriggers); // Function Tiger.TigerAiJudgeController.PlayTimedAnimationTriggers // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13d25f0
	struct ATigerJudge* GetJudgePawn(); // Function Tiger.TigerAiJudgeController.GetJudgePawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13cde60
};

// Class Tiger.TigerAiJudgeSmComponent
// Size: 0x178 (Inherited: 0xb0)
struct UTigerAiJudgeSmComponent : UActorComponent {
	struct TArray<struct ATigerPlayer*> CurrentlyPerceivedPlayersBySight; // 0xb0(0x10)
	struct TArray<struct ATigerPlayer*> BloodhuntedPlayersWithinCombatRadius; // 0xc0(0x10)
	struct UTigerJudgeBaseState* StartingState; // 0xd0(0x08)
	struct UTigerJudgeBaseState* DownedState; // 0xd8(0x08)
	struct UTigerJudgeBaseState* FeedingState; // 0xe0(0x08)
	struct UTigerJudgeBaseState* ActiveState; // 0xe8(0x08)
	struct TMap<struct UTigerJudgeBaseState*, struct UTigerJudgeBaseState*> InstancedStates; // 0xf0(0x50)
	float CombatRadiusSq; // 0x140(0x04)
	bool bIsSeeingAnyBloodhuntedPlayer; // 0x144(0x01)
	char pad_145[0x33]; // 0x145(0x33)

	void SwitchToState(struct UTigerJudgeBaseState* NewStateType); // Function Tiger.TigerAiJudgeSmComponent.SwitchToState // (Native|Public|BlueprintCallable) // @ game+0x13d26a0
	void AddMasqueradePointsToSeenPlayers(float AdjustAmount, float TimeBetweenAddingPoints); // Function Tiger.TigerAiJudgeSmComponent.AddMasqueradePointsToSeenPlayers // (Final|Native|Public|BlueprintCallable) // @ game+0x13d1fe0
};

// Class Tiger.TigerAimAssist
// Size: 0xa0 (Inherited: 0x28)
struct UTigerAimAssist : UObject {
	struct ATigerPlayerController* PlayerController; // 0x28(0x08)
	struct FTigerAimAssistState State; // 0x30(0x68)
	char pad_98[0x8]; // 0x98(0x08)
};

// Class Tiger.TigerAimAssistSettings
// Size: 0x200 (Inherited: 0x28)
struct UTigerAimAssistSettings : UObject {
	struct FTigerAimAssistModeConfig Modes[0x4]; // 0x28(0x1a0)
	struct FVector2D BaseSlowdownAssistRadiusCm; // 0x1c8(0x08)
	struct FVector2D BaseSlowdownAssistStrength; // 0x1d0(0x08)
	struct FVector2D BaseRotationAssistRadiusCm; // 0x1d8(0x08)
	struct FVector2D BaseRotationAssistStrength; // 0x1e0(0x08)
	float MinRangeCm; // 0x1e8(0x04)
	float MaxRangeCm; // 0x1ec(0x04)
	struct FVector2D MaxRotationAssistDegreesPerSecond; // 0x1f0(0x08)
	float NoEffectScoreMultiplier; // 0x1f8(0x04)
	float RotationAssistMinimumMoveSpeed; // 0x1fc(0x04)
};

// Class Tiger.TigerAimingCameraBehavior
// Size: 0x128 (Inherited: 0x128)
struct UTigerAimingCameraBehavior : UTigerActiveCameraBehavior {
};

// Class Tiger.TigerAiMoveAsyncTask
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAiMoveAsyncTask : UBTTask_BlackboardBase {
	float AcceptableRadiusSq; // 0x98(0x04)
	float ObservedBlackboardValueToleranceSq; // 0x9c(0x04)
};

// Class Tiger.TigerAiMoveToTask
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerAiMoveToTask : UBTTask_MoveTo {
	bool bResetMoveTargetOnEnd; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// Class Tiger.TigerAiPathToTargetService
// Size: 0x158 (Inherited: 0x70)
struct UTigerAiPathToTargetService : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	struct FBlackboardKeySelector SuitableEdgeLocationKey; // 0x98(0x28)
	struct FBlackboardKeySelector IsTargetOutOfBoundsKey; // 0xc0(0x28)
	struct FBlackboardKeySelector HasPathToTargetKey; // 0xe8(0x28)
	struct FBlackboardKeySelector IsPathOutOfBoundsKey; // 0x110(0x28)
	float OutOfBoundsDistance; // 0x138(0x04)
	float HeightDifferenceOutOfBounds; // 0x13c(0x04)
	bool bDebugDraw; // 0x140(0x01)
	char pad_141[0x17]; // 0x141(0x17)
};

// Class Tiger.TigerAIPerceptionSystem
// Size: 0x130 (Inherited: 0x130)
struct UTigerAIPerceptionSystem : UAIPerceptionSystem {
};

// Class Tiger.TigerAiPerfBenchUseWeapon
// Size: 0x90 (Inherited: 0x70)
struct UTigerAiPerfBenchUseWeapon : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
};

// Class Tiger.TigerAiPermanentCap
// Size: 0x2c8 (Inherited: 0x290)
struct ATigerAiPermanentCap : ATigerAiSpawningCap {
	struct TArray<struct UTigerAICommandBase*> Commands; // 0x290(0x10)
	enum class ETigerCivilianEmotionalState EmotionalState; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct FName CapContextBase; // 0x2a4(0x08)
	int32_t CapContextStartingIndex; // 0x2ac(0x04)
	struct UTigerNPCAsset* NpcAssetToSpawn; // 0x2b0(0x08)
	int32_t LoopingStartIndex; // 0x2b8(0x04)
	struct TWeakObjectPtr<struct ATigerNPC> PermanentNpc; // 0x2bc(0x08)
	char pad_2C4[0x4]; // 0x2c4(0x04)
};

// Class Tiger.TigerAIPetClearPathToMaster
// Size: 0x70 (Inherited: 0x70)
struct UTigerAIPetClearPathToMaster : UBTTaskNode {
};

// Class Tiger.TigerAIPetComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UTigerAIPetComponent : UActorComponent {
	char pad_B0[0x40]; // 0xb0(0x40)

	bool HasGotEndPoint(); // Function Tiger.TigerAIPetComponent.HasGotEndPoint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13d2500
	struct TArray<struct FVector> GetMasterPlayersStoredPath(); // Function Tiger.TigerAIPetComponent.GetMasterPlayersStoredPath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13d2280
	struct FVector GetEndPoint(); // Function Tiger.TigerAIPetComponent.GetEndPoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x13d2250
};

// Class Tiger.TigerAIPetFindEndOfMastersPath
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIPetFindEndOfMastersPath : UBTTaskNode {
	struct FBlackboardKeySelector MasterPlayer; // 0x70(0x28)
};

// Class Tiger.TigerAIPetPreparePathContinuing
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIPetPreparePathContinuing : UBTTaskNode {
	struct FBlackboardKeySelector MasterPlayer; // 0x70(0x28)
};

// Class Tiger.TigerAIPetStoreValidMasterPos
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIPetStoreValidMasterPos : UBTTaskNode {
	struct FBlackboardKeySelector MasterPlayer; // 0x70(0x28)
};

// Class Tiger.TigerAIPlayAnimationTask
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAIPlayAnimationTask : UBTTaskNode {
	struct UAnimMontage* AnimationToPlay; // 0x70(0x08)
	struct FBlackboardKeySelector ContextualActionPointKey; // 0x78(0x28)
	struct UBehaviorTreeComponent* MyOwnerComp; // 0xa0(0x08)
	char pad_A8[0x20]; // 0xa8(0x20)
};

// Class Tiger.TigerAiPlayerAtWpRangeDecorator
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiPlayerAtWpRangeDecorator : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAIPlayerClearPrioritiesTask
// Size: 0x98 (Inherited: 0x98)
struct UTigerAIPlayerClearPrioritiesTask : UBTTask_BlackboardBase {
};

// Class Tiger.TigerAIPlayerClimbIfPossibleTask
// Size: 0xd0 (Inherited: 0x70)
struct UTigerAIPlayerClimbIfPossibleTask : UBTTaskNode {
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x70(0x08)
	struct ATigerPlayerController* PlayerController; // 0x78(0x08)
	struct ATigerPlayerCameraManager* PlayerCamera; // 0x80(0x08)
	struct ATigerPlayer* CurrentPawn; // 0x88(0x08)
	struct UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90(0x08)
	struct UTigerTraversalClimbState* ClimbState; // 0x98(0x08)
	struct UTigerTraversalStateClimbingConfig* ClimbConfig; // 0xa0(0x08)
	float AngleFromForward; // 0xa8(0x04)
	char pad_AC[0x24]; // 0xac(0x24)
};

// Class Tiger.TigerAiPlayerCombatService
// Size: 0xd8 (Inherited: 0x70)
struct UTigerAiPlayerCombatService : UBTService {
	struct TMap<enum class ETigerWeaponType, struct FWeaponDistanceDesc> WeaponRanges; // 0x70(0x50)
	struct ATigerLocalAIController* LocalAIController; // 0xc0(0x08)
	struct AActor* CurrentLureTarget; // 0xc8(0x08)
	char pad_D0[0x8]; // 0xd0(0x08)
};

// Class Tiger.TigerAiPlayerDiablerizeTask
// Size: 0xc0 (Inherited: 0x98)
struct UTigerAiPlayerDiablerizeTask : UBTTask_BlackboardBase {
	float MaximumDiablerizeDistance; // 0x98(0x04)
	char pad_9C[0x24]; // 0x9c(0x24)
};

// Class Tiger.TigerAiPlayerEquipRangedWeapon
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiPlayerEquipRangedWeapon : UBTTaskNode {
	char pad_70[0x8]; // 0x70(0x08)
};

// Class Tiger.TigerAIPlayerFeeding
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAIPlayerFeeding : UBTTask_BlackboardBase {
	float MaximumFeedingDistance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAIPlayerFindBloodHuntedTask
// Size: 0x70 (Inherited: 0x70)
struct UTigerAIPlayerFindBloodHuntedTask : UBTTaskNode {
};

// Class Tiger.TigerAIPlayerFindCivilianTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIPlayerFindCivilianTask : UBTTask_BlackboardBase {
	bool bUseHeightenedSensesSearchRadius; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float CustomSearchSphereRadius; // 0x9c(0x04)
	bool bDrawSearchSphere; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float MaxVerticalPositionOffset; // 0xa4(0x04)
	float RaycastDistance; // 0xa8(0x04)
	int32_t SearchLowResonanceThreshold; // 0xac(0x04)
	float SearchLowHealthPercentageThreshold; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// Class Tiger.TigerAIPlayerFindClosestItemTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIPlayerFindClosestItemTask : UBTTask_BlackboardBase {
	float MaxVerticalPositionOffset; // 0x98(0x04)
	float RaycastDistance; // 0x9c(0x04)
	float SearchSphereRadius; // 0xa0(0x04)
	char pad_A4[0x14]; // 0xa4(0x14)
};

// Class Tiger.TigerAIPlayerFindNewPointTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIPlayerFindNewPointTask : UBTTask_BlackboardBase {
	float NavigablePointRadius; // 0x98(0x04)
	float MaxCenterDistance; // 0x9c(0x04)
	char pad_A0[0x18]; // 0xa0(0x18)
};

// Class Tiger.TigerAiPlayerMainStateService
// Size: 0xe8 (Inherited: 0x70)
struct UTigerAiPlayerMainStateService : UBTService {
	char pad_70[0x8]; // 0x70(0x08)
	struct ATigerLocalAIController* LocalAIController; // 0x78(0x08)
	struct ATigerPlayer* AiPlayer; // 0x80(0x08)
	struct ATigerCharacter* TargetCharacter; // 0x88(0x08)
	struct UTigerInventoryComponent* LocalAiInventory; // 0x90(0x08)
	struct ATigerCharacter* ClosestHostileCharacterFleeingFrom; // 0x98(0x08)
	char pad_A0[0x30]; // 0xa0(0x30)
	float FleeAttackDistance; // 0xd0(0x04)
	char pad_D4[0x14]; // 0xd4(0x14)

	void OnReactionDelayPassed(struct AActor* InActor); // Function Tiger.TigerAiPlayerMainStateService.OnReactionDelayPassed // (Final|Native|Private) // @ game+0x13d6ec0
	void OnPerceptionUpdated(struct AActor* InActor, struct FAIStimulus InStimulus); // Function Tiger.TigerAiPlayerMainStateService.OnPerceptionUpdated // (Final|Native|Private) // @ game+0x13d6d30
	void OnDiablerizeStateChanged(bool InIsDiablerizeActive, bool InIsTarget); // Function Tiger.TigerAiPlayerMainStateService.OnDiablerizeStateChanged // (Final|Native|Private) // @ game+0x13d6be0
};

// Class Tiger.TigerAIPlayerMoveToTask
// Size: 0x150 (Inherited: 0xb0)
struct UTigerAIPlayerMoveToTask : UBTTask_MoveTo {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct UTigerAIPlayerClimbIfPossibleTask* ClimbTask; // 0xb8(0x08)
	struct UTigerAIPlayerSlideIfPossibleTask* SlideTask; // 0xc0(0x08)
	struct UTigerAIPlayerWallGrindTask* WallGrindTask; // 0xc8(0x08)
	float CheckStuckDelay; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	float CheckClimbTaskTransitionsDelay; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	float CheckSlideTaskTransitionsDelay; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	float JumpGapTransitionsDelay; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct ATigerLocalAIController* LocalAIController; // 0xf0(0x08)
	struct ATigerPlayer* CurrentTigerPlayer; // 0xf8(0x08)
	char pad_100[0x50]; // 0x100(0x50)

	void OnLifeStatusChanged(enum class ETigerPlayerLifeStatus InNewLifeStatus); // Function Tiger.TigerAIPlayerMoveToTask.OnLifeStatusChanged // (Final|Native|Public) // @ game+0x13d6cb0
};

// Class Tiger.TigerAIPlayerOpenInteractiveTask
// Size: 0xc8 (Inherited: 0x98)
struct UTigerAIPlayerOpenInteractiveTask : UBTTask_BlackboardBase {
	char pad_98[0x30]; // 0x98(0x30)
};

// Class Tiger.TigerAIPlayerPickPriorityTask
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAIPlayerPickPriorityTask : UBTTask_BlackboardBase {
	float MaxVerticalPositionOffset; // 0x98(0x04)
	float RaycastDistance; // 0x9c(0x04)
};

// Class Tiger.TigerAIPlayerPickUpItemTask
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAIPlayerPickUpItemTask : UBTTask_BlackboardBase {
	float MaximumLootingDistance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAIPlayerSlideIfPossibleTask
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAIPlayerSlideIfPossibleTask : UBTTaskNode {
	float MinimumSlideDistanceSqrd; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct ATigerLocalAIController* LocalAIController; // 0x78(0x08)
	struct ATigerPlayerController* PlayerController; // 0x80(0x08)
	struct ATigerPlayer* CurrentPawn; // 0x88(0x08)
	struct UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90(0x08)
	struct UTigerTraversalSlideState* SlideState; // 0x98(0x08)
};

// Class Tiger.TigerAIPlayerTravelBloodVeinTask
// Size: 0xa8 (Inherited: 0x98)
struct UTigerAIPlayerTravelBloodVeinTask : UBTTask_BlackboardBase {
	struct UCurveFloat* JumpProbabilityDistribution; // 0x98(0x08)
	enum class ETigerJumpDistribution JumpDistributionType; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class Tiger.TigerAIPlayerUseHealingItem
// Size: 0x90 (Inherited: 0x70)
struct UTigerAIPlayerUseHealingItem : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
};

// Class Tiger.TigerAiPlayerUseWeapon
// Size: 0x90 (Inherited: 0x70)
struct UTigerAiPlayerUseWeapon : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
};

// Class Tiger.TigerAiPlayerUseWeaponPower
// Size: 0x98 (Inherited: 0x70)
struct UTigerAiPlayerUseWeaponPower : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
	struct UTigerDisciplineBase* WeaponAbility; // 0x90(0x08)
};

// Class Tiger.TigerAIPlayerWallGrindTask
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAIPlayerWallGrindTask : UBTTaskNode {
	char pad_70[0x8]; // 0x70(0x08)
	struct ATigerLocalAIController* LocalAIController; // 0x78(0x08)
	struct ATigerPlayerController* PlayerController; // 0x80(0x08)
	struct ATigerPlayer* CurrentPawn; // 0x88(0x08)
	struct UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90(0x08)
	struct UTigerTraversalWallGrindState* GrindState; // 0x98(0x08)
};

// Class Tiger.TigerAiReloadWeaponTask
// Size: 0x80 (Inherited: 0x70)
struct UTigerAiReloadWeaponTask : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)

	void OnReloadAborted(bool bInWeaponDropped); // Function Tiger.TigerAiReloadWeaponTask.OnReloadAborted // (Final|Native|Private) // @ game+0x13d6f50
};

// Class Tiger.TigerAiReportNewThreatTask
// Size: 0x98 (Inherited: 0x70)
struct UTigerAiReportNewThreatTask : UBTTaskNode {
	struct FBlackboardKeySelector PlayerToReportKey; // 0x70(0x28)
};

// Class Tiger.TigerAIReportSuspciousPlayer
// Size: 0xe8 (Inherited: 0x70)
struct UTigerAIReportSuspciousPlayer : UBTTaskNode {
	struct FBlackboardKeySelector PoliceTarget; // 0x70(0x28)
	struct FBlackboardKeySelector CurrentMasqueradeTarget; // 0x98(0x28)
	struct FBlackboardKeySelector PlayerNeedsToBeReported; // 0xc0(0x28)
};

// Class Tiger.TigerAiRequestOutOfBoundsPursuitSquad
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAiRequestOutOfBoundsPursuitSquad : UBTTaskNode {
	struct FBlackboardKeySelector TargetPlayer; // 0x70(0x28)
	float NearbySquadDistance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAISense_Masquerade
// Size: 0x90 (Inherited: 0x80)
struct UTigerAISense_Masquerade : UAISense {
	struct TArray<struct FTigerAIMasqueradeEvent> MasqueradeEvents; // 0x80(0x10)

	void ReportPlayerAction(struct ATigerPlayer* Instigator, struct FTigerAIPlayerAction& PlayerAction); // Function Tiger.TigerAISense_Masquerade.ReportPlayerAction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x13d6fe0
};

// Class Tiger.TigerAISenseConfig_Masquerade
// Size: 0x50 (Inherited: 0x48)
struct UTigerAISenseConfig_Masquerade : UAISenseConfig {
	struct UTigerAISense_Masquerade* Implementation; // 0x48(0x08)
};

// Class Tiger.TigerAISense_Sight
// Size: 0x170 (Inherited: 0x170)
struct UTigerAISense_Sight : UAISense_Sight {
};

// Class Tiger.TigerAISenseConfig_Sight
// Size: 0x78 (Inherited: 0x48)
struct UTigerAISenseConfig_Sight : UAISenseConfig {
	struct UTigerAISense_Sight* Implementation; // 0x48(0x08)
	float SightRadius; // 0x50(0x04)
	float LoseSightRadius; // 0x54(0x04)
	float PeripheralVisionAngleDegrees; // 0x58(0x04)
	float CloseSightRadius; // 0x5c(0x04)
	float CloseLoseSightRadius; // 0x60(0x04)
	float ClosePeripheralVisionAngleDegrees; // 0x64(0x04)
	float HeightDifference; // 0x68(0x04)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x6c(0x04)
	float AutoSuccessRangeFromLastSeenLocation; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Tiger.TigerSightConfigAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerSightConfigAsset : UDataAsset {
	struct TMap<enum class ETigerNPCType, struct FTigerSightConfigData> SightData; // 0x30(0x50)
};

// Class Tiger.TigerAiSetCrouchedTask
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiSetCrouchedTask : UBTTaskNode {
	bool bShouldCrouch; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerAiSetMovementMode
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiSetMovementMode : UBTTaskNode {
	enum class ETigerAIAnimationMode MovementMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerAiShouldFireFleeDecorator
// Size: 0x98 (Inherited: 0x90)
struct UTigerAiShouldFireFleeDecorator : UBTDecorator_BlackboardBase {
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerAiShouldReloadDecorator
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiShouldReloadDecorator : UBTDecorator {
	bool bBaseUponFullAmmoPercentage; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float ReloadAmmoPercentage; // 0x6c(0x04)
};

// Class Tiger.TigerAiShouldReportNewThreatDecorator
// Size: 0x90 (Inherited: 0x68)
struct UTigerAiShouldReportNewThreatDecorator : UBTDecorator {
	struct FBlackboardKeySelector PlayerToReportKey; // 0x68(0x28)
};

// Class Tiger.TigerAiShouldRequestOutOfBoundsPursuitSquad
// Size: 0x98 (Inherited: 0x68)
struct UTigerAiShouldRequestOutOfBoundsPursuitSquad : UBTDecorator {
	struct FBlackboardKeySelector CurrentTargetKey; // 0x68(0x28)
	float MaxDistanceFromCurrentSquad; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Tiger.TigerAiShouldUseDisciplineBase
// Size: 0x98 (Inherited: 0x68)
struct UTigerAiShouldUseDisciplineBase : UBTDecorator {
	float LowHealthPercentage; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct ATigerLocalAIController* LocalAIController; // 0x70(0x08)
	struct ATigerPlayerController* LocalAiPlayerController; // 0x78(0x08)
	struct ATigerPlayer* AiTigerPlayer; // 0x80(0x08)
	struct UTigerDisciplineComponent* DisciplineComponent; // 0x88(0x08)
	struct ATigerCharacter* AiTigerCharacter; // 0x90(0x08)
};

// Class Tiger.TigerAiShouldUseArchDiscipline
// Size: 0xb0 (Inherited: 0x98)
struct UTigerAiShouldUseArchDiscipline : UTigerAiShouldUseDisciplineBase {
	float ShockwavePunchMinimumTargetDistance; // 0x98(0x04)
	float EarthshockUseWithoutJumpChance; // 0x9c(0x04)
	float TrapsAndScoutsUseNearLootDistance; // 0xa0(0x04)
	float ScoutsRedeployChance; // 0xa4(0x04)
	float RejuvenatingVoiceLowHealthPercentage; // 0xa8(0x04)
	float TankyChargeUseDistance; // 0xac(0x04)
};

// Class Tiger.TigerAiShouldUseClanDiscipline
// Size: 0xa8 (Inherited: 0x98)
struct UTigerAiShouldUseClanDiscipline : UTigerAiShouldUseDisciplineBase {
	float DisableNearTargetDistance; // 0x98(0x04)
	float SoaringLeapRayClearance; // 0x9c(0x04)
	float VanishCombatUseChance; // 0xa0(0x04)
	float ProjectionDashUseDistance; // 0xa4(0x04)
};

// Class Tiger.TigerNPCSpawningBase
// Size: 0x270 (Inherited: 0x228)
struct ATigerNPCSpawningBase : AActor {
	struct ATigerAISplinePath* AISplinePath; // 0x228(0x08)
	struct FName SpawningGroup; // 0x230(0x08)
	int32_t SpawnAmount; // 0x238(0x04)
	struct FGuid SpawningSubGroupId; // 0x23c(0x10)
	float Prio; // 0x24c(0x04)
	bool bShouldBeManuallyActivated; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FName MovementGroup; // 0x254(0x08)
	char pad_25C[0x14]; // 0x25c(0x14)

	struct TArray<struct ATigerBaseNPC*> ManuallySpawnNPCs(int32_t Budget, int32_t OverrideSpawnAmount); // Function Tiger.TigerNPCSpawningBase.ManuallySpawnNPCs // (Final|Native|Public|BlueprintCallable) // @ game+0x14abb50
};

// Class Tiger.TigerAISpawner
// Size: 0x278 (Inherited: 0x270)
struct ATigerAISpawner : ATigerNPCSpawningBase {
	struct UTigerNPCAsset* NPCAsset; // 0x270(0x08)
};

// Class Tiger.TigerAISplinePath
// Size: 0x2d0 (Inherited: 0x228)
struct ATigerAISplinePath : AActor {
	struct FTigerAISplinePathData PathData; // 0x228(0xa0)
	char pad_2C8[0x8]; // 0x2c8(0x08)
};

// Class Tiger.TigerAiSplinePathHub
// Size: 0x240 (Inherited: 0x228)
struct ATigerAiSplinePathHub : AActor {
	struct TArray<struct FTigerAISplinePathConnection> SplineConnections; // 0x228(0x10)
	float ConnectionRadius; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
};

// Class Tiger.TigerAiSquad
// Size: 0x68 (Inherited: 0x28)
struct UTigerAiSquad : UObject {
	char pad_28[0x40]; // 0x28(0x40)
};

// Class Tiger.TigerAiSquadFormationService
// Size: 0xb0 (Inherited: 0x70)
struct UTigerAiSquadFormationService : UBTService {
	struct FBlackboardKeySelector FormationLocationKey; // 0x70(0x28)
	bool bDebugDraw; // 0x98(0x01)
	char pad_99[0x17]; // 0x99(0x17)
};

// Class Tiger.TigerAIsRespondingToRoar
// Size: 0x68 (Inherited: 0x68)
struct UTigerAIsRespondingToRoar : UBTDecorator {
};

// Class Tiger.TigerAiStopActiveCapTask
// Size: 0x70 (Inherited: 0x70)
struct UTigerAiStopActiveCapTask : UBTTaskNode {
};

// Class Tiger.TigerAiTargetOutOfBounds
// Size: 0xe0 (Inherited: 0x68)
struct UTigerAiTargetOutOfBounds : UBTDecorator {
	struct FBlackboardKeySelector IsTargetOutOfBoundsKey; // 0x68(0x28)
	struct FBlackboardKeySelector HasPathToTargetKey; // 0x90(0x28)
	struct FBlackboardKeySelector IsPathOutOfBoundsKey; // 0xb8(0x28)
};

// Class Tiger.TigerAIThreateningTargetService
// Size: 0x148 (Inherited: 0x70)
struct UTigerAIThreateningTargetService : UBTService {
	struct FBlackboardKeySelector ThreatPosition; // 0x70(0x28)
	struct FBlackboardKeySelector CurrentThreatTarget; // 0x98(0x28)
	struct FBlackboardKeySelector SuggestedNonObstructedPosition; // 0xc0(0x28)
	struct FBlackboardKeySelector bIsAllowedToChaseKey; // 0xe8(0x28)
	struct FBlackboardKeySelector bCanShoot; // 0x110(0x28)
	bool bUseAttackPermissions; // 0x138(0x01)
	bool bShowDebugFeatures; // 0x139(0x01)
	char pad_13A[0xe]; // 0x13a(0x0e)
};

// Class Tiger.TigerAIThreateningTargetEntityService
// Size: 0x170 (Inherited: 0x148)
struct UTigerAIThreateningTargetEntityService : UTigerAIThreateningTargetService {
	struct FBlackboardKeySelector MasqueradeBreachTargetKey; // 0x148(0x28)
};

// Class Tiger.TigerAiTryFindLocationAgainstElevatedTarget
// Size: 0xd0 (Inherited: 0x70)
struct UTigerAiTryFindLocationAgainstElevatedTarget : UBTTaskNode {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	struct FBlackboardKeySelector SuggestedLocationKey; // 0x98(0x28)
	float MaxStepbackDistance; // 0xc0(0x04)
	float MinStepbackDistance; // 0xc4(0x04)
	float DesiredMaxVerticalAngle; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
};

// Class Tiger.TigerAIUpdateBloodDrainedService
// Size: 0x78 (Inherited: 0x70)
struct UTigerAIUpdateBloodDrainedService : UBTService {
	float MaxTimeInBloodDrainedState; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Tiger.TigerAIUpdateWaypoint
// Size: 0xf0 (Inherited: 0x70)
struct UTigerAIUpdateWaypoint : UBTService {
	struct FBlackboardKeySelector Index; // 0x70(0x28)
	struct FBlackboardKeySelector Waypoint; // 0x98(0x28)
	struct FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0(0x28)
	float Distance; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// Class Tiger.TigerAiUseArchetypeDisciplineTask
// Size: 0xc8 (Inherited: 0xc8)
struct UTigerAiUseArchetypeDisciplineTask : UTigerAiDisciplineTaskBase {
};

// Class Tiger.TigerAiUseClanDisciplineTask
// Size: 0xc8 (Inherited: 0xc8)
struct UTigerAiUseClanDisciplineTask : UTigerAiDisciplineTaskBase {
};

// Class Tiger.TigerFearValueAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerFearValueAsset : UDataAsset {
	struct TMap<enum class ETigerAIMasqueradeState, float> FearValueThresholds; // 0x30(0x50)
};

// Class Tiger.TigerNpcPropAsset
// Size: 0x58 (Inherited: 0x30)
struct UTigerNpcPropAsset : UDataAsset {
	struct TArray<struct FName> TagsToAddToNpc; // 0x30(0x10)
	struct UTigerAnimationSetAsset* PropAnimationSet; // 0x40(0x08)
	struct TArray<struct FName> HeldPropAttachments; // 0x48(0x10)
};

// Class Tiger.TigerNPCVisualAsset
// Size: 0x150 (Inherited: 0x30)
struct UTigerNPCVisualAsset : UDataAsset {
	struct FName MainTag; // 0x30(0x08)
	struct TArray<struct FName> AdditionalTags; // 0x38(0x10)
	struct USkeletalMesh* SkeletalMesh; // 0x48(0x08)
	struct TArray<struct USkeletalMesh*> HeadSkeletalMeshes; // 0x50(0x10)
	struct TArray<struct USkeletalMesh*> HairSkeletalMeshes; // 0x60(0x10)
	struct TArray<struct UTigerColorSetAsset*> ColorSetAssets; // 0x70(0x10)
	struct TArray<struct UTigerLinearColorSetAsset*> HairColorSetAssets; // 0x80(0x10)
	struct UMaterialInstance* DefaultMaterial; // 0x90(0x08)
	bool bShowHeart; // 0x98(0x01)
	enum class ETigerGender Gender; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
	struct UAnimInstance* HairAnimationBlueprint; // 0xa0(0x08)
	bool bUseCharacterPreset; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
	struct TSoftObjectPtr<UTigerCharacterPreset> CharacterPreset; // 0xb0(0x28)
	struct UAnimInstance* AnimationInstanceClass; // 0xd8(0x08)
	enum class ETigerCivilianEmotionalState EmotionalState; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	float ChanceForProp; // 0xe4(0x04)
	struct TMap<struct UTigerNpcPropAsset*, float> PossibleNpcProps; // 0xe8(0x50)
	float WalkSpeed; // 0x138(0x04)
	float WalkTurnSpeed; // 0x13c(0x04)
	float SprintSpeed; // 0x140(0x04)
	float SprintTurnSpeed; // 0x144(0x04)
	float StrafeSpeed; // 0x148(0x04)
	float StrafeTurnSpeed; // 0x14c(0x04)
};

// Class Tiger.TigerNPCBehaviorAsset
// Size: 0x210 (Inherited: 0x30)
struct UTigerNPCBehaviorAsset : UDataAsset {
	struct ATigerBaseNPC* NPCBlueprint; // 0x30(0x08)
	struct UTigerMasqueradeActionResponse* MasqueradeActionResponseClass; // 0x38(0x08)
	struct UBehaviorTree* DefaultBehaviorTree; // 0x40(0x08)
	struct TMap<enum class ETigerAIMasqueradeState, struct UBehaviorTree*> BehaviorTrees; // 0x48(0x50)
	struct TArray<struct UActorComponent*> AdditionalComponentClasses; // 0x98(0x10)
	struct UTigerWeapon* WeaponClass; // 0xa8(0x08)
	enum class ETigerNPCType NPCType; // 0xb0(0x01)
	enum class ETigerAIAnimationMode AnimationMode; // 0xb1(0x01)
	char pad_B2[0x2]; // 0xb2(0x02)
	struct FTigerCharacterStatModification BaseStatModifications; // 0xb4(0xa8)
	struct FTigerCharacterStatModification BaseGroupStatModifications; // 0x15c(0xa8)
	bool bUseGroupStats; // 0x204(0x01)
	char pad_205[0x3]; // 0x205(0x03)
	float OverrideBaseMaxHealth; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Tiger.TigerNPCAsset
// Size: 0x50 (Inherited: 0x30)
struct UTigerNPCAsset : UDataAsset {
	struct TArray<struct FTigerRandomVisualAsset> NormalizedVisualAssets; // 0x30(0x10)
	struct UTigerNPCBehaviorAsset* BehaviorAsset; // 0x40(0x08)
	struct UTigerGrimoireEntry* GrimoireEntry; // 0x48(0x08)
};

// Class Tiger.TigerColorSetAsset
// Size: 0xd0 (Inherited: 0x30)
struct UTigerColorSetAsset : UDataAsset {
	struct TMap<struct FName, struct FColor> ColorSets; // 0x30(0x50)
	struct TMap<struct FName, float> ScalarParameters; // 0x80(0x50)
};

// Class Tiger.TigerNPCCheatCommandsAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerNPCCheatCommandsAsset : UDataAsset {
	struct TMap<struct FName, struct UTigerNPCAsset*> Commands; // 0x30(0x50)
};

// Class Tiger.TigerLinearColorSetAsset
// Size: 0xd0 (Inherited: 0x30)
struct UTigerLinearColorSetAsset : UDataAsset {
	struct TMap<struct FName, struct FLinearColor> ColorSets; // 0x30(0x50)
	struct TMap<struct FName, float> ScalarParameters; // 0x80(0x50)
};

// Class Tiger.TigerAIWithinMovementBoundsServices
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIWithinMovementBoundsServices : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
};

// Class Tiger.TigerDisciplineMetaData
// Size: 0x30 (Inherited: 0x28)
struct UTigerDisciplineMetaData : UAnimMetaData {
	enum class ETigerDisciplinesEnum DisicplineType; // 0x28(0x01)
	bool bAllowRotationLerp; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
};

// Class Tiger.TigerAnimationSet
// Size: 0x360 (Inherited: 0x28)
struct UTigerAnimationSet : UObject {
	struct TArray<struct UTigerAnimationSetAsset*> ParentSets; // 0x28(0x10)
	struct TMap<struct FName, struct UAnimSequence*> Sequences; // 0x38(0x50)
	struct TMap<struct FName, struct UAnimMontage*> Montages; // 0x88(0x50)
	struct TMap<struct FName, struct UTigerMontageList*> MontageLists; // 0xd8(0x50)
	struct TMap<struct FName, struct UBlendSpace*> BlendSpaces; // 0x128(0x50)
	struct TMap<struct FName, struct UBlendSpace1D*> BlendSpaces1D; // 0x178(0x50)
	struct TMap<struct FName, struct UTigerRandomSequenceList*> RandomSequenceLists; // 0x1c8(0x50)
	struct TMap<struct FName, struct UTigerCustomSequenceList*> CustomSequences; // 0x218(0x50)
	struct TMap<struct FName, struct UTigerCustomMontageList*> CustomMontages; // 0x268(0x50)
	struct TMap<struct FName, struct UTigerCustomBlendSpaceList*> CustomBlendSpaces; // 0x2b8(0x50)
	struct TMap<struct FName, struct UTigerCustomBlendSpace1DList*> CustomBlendSpaces1D; // 0x308(0x50)
	int32_t Priority; // 0x358(0x04)
	char pad_35C[0x4]; // 0x35c(0x04)
};

// Class Tiger.TigerAnimationSetAsset
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimationSetAsset : UDataAsset {
	struct UTigerAnimationSet* Set; // 0x30(0x08)
};

// Class Tiger.TigerAnimationSetCollection
// Size: 0x40 (Inherited: 0x28)
struct UTigerAnimationSetCollection : UObject {
	struct UTigerAnimationSet* ResultSet; // 0x28(0x08)
	struct TArray<struct UTigerAnimationSet*> AnimationSets; // 0x30(0x10)

	void AddSet(struct UTigerAnimationSetAsset* Asset); // Function Tiger.TigerAnimationSetCollection.AddSet // (Final|Native|Public|BlueprintCallable) // @ game+0x13db430
};

// Class Tiger.TigerMontageList
// Size: 0x38 (Inherited: 0x28)
struct UTigerMontageList : UObject {
	struct TArray<struct UAnimMontage*> MontageList; // 0x28(0x10)

	struct UAnimMontage* GetRandomMontage(); // Function Tiger.TigerMontageList.GetRandomMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13db4c0
};

// Class Tiger.TigerCustomSequenceList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomSequenceList : UObject {
};

// Class Tiger.TigerCustomSequenceListClan
// Size: 0x48 (Inherited: 0x28)
struct UTigerCustomSequenceListClan : UTigerCustomSequenceList {
	struct UAnimSequence* Sequences[0x4]; // 0x28(0x20)
};

// Class Tiger.TigerCustomSequenceListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomSequenceListGender : UTigerCustomSequenceList {
	struct UAnimSequence* Sequences[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomSequenceListClanAndGender
// Size: 0x68 (Inherited: 0x28)
struct UTigerCustomSequenceListClanAndGender : UTigerCustomSequenceList {
	struct FTigerPlayerSequenceByClan SequencesByClan[0x2]; // 0x28(0x40)
};

// Class Tiger.TigerCustomMontageList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomMontageList : UObject {
};

// Class Tiger.TigerCustomMontageListClan
// Size: 0x48 (Inherited: 0x28)
struct UTigerCustomMontageListClan : UTigerCustomMontageList {
	struct UAnimMontage* Montages[0x4]; // 0x28(0x20)
};

// Class Tiger.TigerCustomMontageListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomMontageListGender : UTigerCustomMontageList {
	struct UAnimMontage* Montages[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomMontageListClanAndGender
// Size: 0x68 (Inherited: 0x28)
struct UTigerCustomMontageListClanAndGender : UTigerCustomMontageList {
	struct FTigerPlayerMontageByClan MontagesByClan[0x2]; // 0x28(0x40)
};

// Class Tiger.TigerCustomMontageListMeleeWeapon
// Size: 0x78 (Inherited: 0x28)
struct UTigerCustomMontageListMeleeWeapon : UTigerCustomMontageList {
	struct TMap<struct UTigerMeleeWeapon*, struct UAnimMontage*> Montages; // 0x28(0x50)
};

// Class Tiger.TigerCustomBlendSpaceList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomBlendSpaceList : UObject {
};

// Class Tiger.TigerCustomBlendSpaceListClan
// Size: 0x48 (Inherited: 0x28)
struct UTigerCustomBlendSpaceListClan : UTigerCustomBlendSpaceList {
	struct UBlendSpace* BlendSpaces[0x4]; // 0x28(0x20)
};

// Class Tiger.TigerCustomBlendSpaceListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomBlendSpaceListGender : UTigerCustomBlendSpaceList {
	struct UBlendSpace* BlendSpaces[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomBlendSpaceListClanAndGender
// Size: 0x68 (Inherited: 0x28)
struct UTigerCustomBlendSpaceListClanAndGender : UTigerCustomBlendSpaceList {
	struct FTigerPlayerBlendSpaceByClan BlendSpacesByClan[0x2]; // 0x28(0x40)
};

// Class Tiger.TigerCustomBlendSpace1DList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DList : UObject {
};

// Class Tiger.TigerCustomBlendSpace1DListClan
// Size: 0x48 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DListClan : UTigerCustomBlendSpace1DList {
	struct UBlendSpace1D* BlendSpaces[0x4]; // 0x28(0x20)
};

// Class Tiger.TigerCustomBlendSpace1DListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DListGender : UTigerCustomBlendSpace1DList {
	struct UBlendSpace1D* BlendSpaces[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomBlendSpace1DListClanAndGender
// Size: 0x68 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DListClanAndGender : UTigerCustomBlendSpace1DList {
	struct FTigerPlayerBlendSpace1DByClan BlendSpacesByClan[0x2]; // 0x28(0x40)
};

// Class Tiger.TigerAnimIKWindow
// Size: 0x78 (Inherited: 0x30)
struct UTigerAnimIKWindow : UAnimNotifyState {
	struct FName SocketName; // 0x30(0x08)
	struct FName SocketToLineTraceFrom; // 0x38(0x08)
	enum class ETigerIKDirection IKSearchDirection; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName TargetJoint; // 0x44(0x08)
	float TargetJointVerticalOffsetAmount; // 0x4c(0x04)
	float TargetJointHorizontalOffsetAmount; // 0x50(0x04)
	float TargetJointDepthOffsetAmount; // 0x54(0x04)
	float IKResultVerticalAdjustment; // 0x58(0x04)
	float IKResultHorizontalAdjustment; // 0x5c(0x04)
	float IKResultDepthAdjustment; // 0x60(0x04)
	float IKResultAlpha; // 0x64(0x04)
	bool bIKShouldRemainActiveWhenAnimationLoops; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float InOutBlendSpeed; // 0x6c(0x04)
	bool bShouldBlendInAndOut; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerFaceCurvesAnimationMap
// Size: 0xc8 (Inherited: 0x28)
struct UTigerFaceCurvesAnimationMap : UObject {
	struct TMap<struct FName, struct UAnimSequence*> CurveAnimations; // 0x28(0x50)
	struct TMap<struct FName, struct UAnimMontage*> FaceMontages; // 0x78(0x50)
};

// Class Tiger.TigerAnimInstance
// Size: 0x3c0 (Inherited: 0x2c0)
struct UTigerAnimInstance : UAnimInstance {
	enum class ETigerEquippedWeaponType EquippedWeaponType; // 0x2b8(0x01)
	bool bOwnerIsLocked; // 0x2b9(0x01)
	struct UPoseAsset* FacePoseAsset; // 0x2c0(0x08)
	struct UAnimSequence* FacePoseAnimation; // 0x2c8(0x08)
	struct UBlendSpace* BlockStanceBlendSpace; // 0x2d0(0x08)
	struct UAnimSequence* BodyModifierJointScalings; // 0x2d8(0x08)
	char pad_2E2[0x4e]; // 0x2e2(0x4e)
	struct UTigerAnimationSetAsset* DefaultAnimationSet; // 0x330(0x08)
	struct UTigerFaceCurvesAnimationMap* FaceCurvesAnimationMap; // 0x338(0x08)
	struct TArray<struct FName> AvailableFaceCurves; // 0x340(0x10)
	struct UTigerAnimationFilter* FacialAnimationFilter; // 0x350(0x08)
	struct UTigerAnimationSetCollection* AnimationSetCollection; // 0x358(0x08)
	struct UTigerAnimationSetCollection* PreviousAnimationSetCollection; // 0x360(0x08)
	struct UAnimMontage* LatestFacialAnim; // 0x368(0x08)
	struct FVector Velocity; // 0x370(0x0c)
	struct FVector PreviousVelocity; // 0x37c(0x0c)
	float Speed; // 0x388(0x04)
	float Direction; // 0x38c(0x04)
	float AimAnglePitch; // 0x390(0x04)
	float AimAngleYaw; // 0x394(0x04)
	char pad_398[0x4]; // 0x398(0x04)
	bool bIsDead; // 0x39c(0x01)
	bool bShooting; // 0x39d(0x01)
	bool bIsBlocking; // 0x39e(0x01)
	bool bIsMontagePlaying; // 0x39f(0x01)
	char pad_3A0[0x4]; // 0x3a0(0x04)
	float MaxRootYawOffset; // 0x3a4(0x04)
	float MaxAimingRootYawOffset; // 0x3a8(0x04)
	float RootYawOffset; // 0x3ac(0x04)
	float SmoothCharacterYaw; // 0x3b0(0x04)
	float CharacterYawLastTick; // 0x3b4(0x04)
	float CharacterYawChangeOverFrame; // 0x3b8(0x04)
	float CharacterDeltaYawSmooth; // 0x3bc(0x04)

	void WeaponTypeBranch(enum class ETigerEquippedWeaponType& WeaponType); // Function Tiger.TigerAnimInstance.WeaponTypeBranch // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x13df850
	void UpdateAnimNotifyIKAlphaBlendOnBones(float DeltaTime); // Function Tiger.TigerAnimInstance.UpdateAnimNotifyIKAlphaBlendOnBones // (Final|Native|Public|BlueprintCallable) // @ game+0x13df7d0
	void TurnInPlace(bool bInIsStandingOnGround); // Function Tiger.TigerAnimInstance.TurnInPlace // (Final|Native|Public|BlueprintCallable) // @ game+0x13df740
	void OnSuccessfulMeleeHit(); // Function Tiger.TigerAnimInstance.OnSuccessfulMeleeHit // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnSettle(struct FTigerSettleEvent& SettleEvent); // Function Tiger.TigerAnimInstance.OnSettle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnMeleeAttack(int32_t InAttackIndex); // Function Tiger.TigerAnimInstance.OnMeleeAttack // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnInitiateAnimationBlueprint(); // Function Tiger.TigerAnimInstance.OnInitiateAnimationBlueprint // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnFootstep(bool bIsLeftFoot, float FootstepDuration); // Function Tiger.TigerAnimInstance.OnFootstep // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnFiredWeapon(bool bInSecondaryWeaponFired); // Function Tiger.TigerAnimInstance.OnFiredWeapon // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnChangeAnimationSet(); // Function Tiger.TigerAnimInstance.OnChangeAnimationSet // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	bool IsActiveMontageRootMotion(); // Function Tiger.TigerAnimInstance.IsActiveMontageRootMotion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df640
	struct UAnimSequence* GetSequence(struct FName SequenceName); // Function Tiger.TigerAnimInstance.GetSequence // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df5a0
	struct UAnimMontage* GetRandomMontage(struct FName MontageListName); // Function Tiger.TigerAnimInstance.GetRandomMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df500
	struct UTigerRandomSequenceList* GetRandomAnimationSequenceList(struct FName SequenceListName); // Function Tiger.TigerAnimInstance.GetRandomAnimationSequenceList // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df460
	struct UTigerRandomSequenceList* GetPreviousRandomAnimationSequenceList(struct FName SequenceListName); // Function Tiger.TigerAnimInstance.GetPreviousRandomAnimationSequenceList // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df3c0
	struct UBlendSpace* GetPreviousBlendSpace(struct FName BlendSpaceName); // Function Tiger.TigerAnimInstance.GetPreviousBlendSpace // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df320
	struct UAnimMontage* GetMontage(struct FName InMontageName); // Function Tiger.TigerAnimInstance.GetMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df280
	void GetFaceAnimSlotsWithActiveCurves(struct FName& OutSlot0, struct FName& OutSlot1, struct FName& OutSlot2, struct FName& OutSlot3); // Function Tiger.TigerAnimInstance.GetFaceAnimSlotsWithActiveCurves // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13df040
	struct UAnimSequence* GetFaceAnimationForCurve(struct FName& CurveName); // Function Tiger.TigerAnimInstance.GetFaceAnimationForCurve // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x13df1e0
	struct UBlendSpace1D* GetBlendSpace1D(struct FName BlendSpace1DName); // Function Tiger.TigerAnimInstance.GetBlendSpace1D // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13dee60
	struct UBlendSpace* GetBlendSpace(struct FName BlendSpaceName); // Function Tiger.TigerAnimInstance.GetBlendSpace // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13def00
	struct UTigerAnimationSetAsset* GetAnimSetAssetFromWeaponClass(struct UTigerWeapon* InWeaponClass); // Function Tiger.TigerAnimInstance.GetAnimSetAssetFromWeaponClass // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	bool GetAnimNotifyIKDataForBone(struct FName BoneName, struct FTigerAnimNotifyIKData& IKData); // Function Tiger.TigerAnimInstance.GetAnimNotifyIKDataForBone // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ded30
	void ApplyBlendShapeScalarValues(struct TArray<struct FTigerCharacterBlendShapeScalarValue>& InBlendShapeScalarValues); // Function Tiger.TigerAnimInstance.ApplyBlendShapeScalarValues // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13dec80
	void AddSets(struct UTigerAnimationSetCollection* SetCollection); // Function Tiger.TigerAnimInstance.AddSets // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void AbortFacialAnimCallback(); // Function Tiger.TigerAnimInstance.AbortFacialAnimCallback // (Final|Native|Public) // @ game+0x13dec60
	void AbortAnimation(float BlendOutTime, struct UAnimMontage* AnimationMontage, bool bStopAllIfNullMontage); // Function Tiger.TigerAnimInstance.AbortAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x13deb40
};

// Class Tiger.TigerAnimNotiftyStateFlying
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotiftyStateFlying : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotify_AddProps
// Size: 0x50 (Inherited: 0x38)
struct UTigerAnimNotify_AddProps : UAnimNotify {
	struct ATigerPropDummy* PropDummyClass; // 0x38(0x08)
	struct TArray<struct FName> PropsToSpawn; // 0x40(0x10)
};

// Class Tiger.TigerAnimNotify_CameraAnimation
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_CameraAnimation : UAnimNotify {
	struct UCameraAnim* CameraAnimation; // 0x38(0x08)
	float AnimationRate; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotify_CameraShake
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_CameraShake : UAnimNotify {
	struct UMatineeCameraShake* ShakeType; // 0x38(0x08)
	float ShakeScale; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotify_Discipline
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Discipline : UAnimNotify {
	enum class ETigerDisciplinesEnum Discipline; // 0x38(0x01)
	enum class ETigerDisciplineEvent DisciplineEvent; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Tiger.TigerAnimNotify_DropProps
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_DropProps : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_Footstep
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Footstep : UAnimNotify {
	bool bIsLeftFoot; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float FootstepDuration; // 0x3c(0x04)

	void SetData(bool bIsLeftFootIn, float FootstepDurationIn); // Function Tiger.TigerAnimNotify_Footstep.SetData // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x13df670
};

// Class Tiger.TigerAnimNotify_Melee
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Melee : UAnimNotify {
	struct FName EventName; // 0x38(0x08)
};

// Class Tiger.TigerAnimNotify_NiagaraEffect
// Size: 0x80 (Inherited: 0x38)
struct UTigerAnimNotify_NiagaraEffect : UAnimNotify {
	struct FSoftObjectPath NiagaraPath; // 0x38(0x18)
	struct UNiagaraSystem* CachedNiagaraEffect; // 0x50(0x08)
	struct FName AttachPointName; // 0x58(0x08)
	struct FVector EffectLocation; // 0x60(0x0c)
	struct FRotator EffectRotation; // 0x6c(0x0c)
	enum class EAttachLocation AttachLocationRule; // 0x78(0x01)
	bool bOnlySpawnOnLocalPlayer; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class Tiger.TigerAnimNotify_ParticleEffect
// Size: 0xd0 (Inherited: 0x90)
struct UTigerAnimNotify_ParticleEffect : UAnimNotify_PlayParticleEffect {
	struct UParticleSystem* IndoorPSTemplate; // 0x90(0x08)
	struct UParticleSystem* OutdoorPSTemplate; // 0x98(0x08)
	enum class ETigerPlayOnClients PlayOnClients; // 0xa0(0x01)
	char pad_A1[0x1f]; // 0xa1(0x1f)
	struct UTigerParticleStrategyChooseSystem* ChooseParticleSystemOverride; // 0xc0(0x08)
	struct UTigerParticleStrategyPostSpawn* ParticlePostSpawnModification; // 0xc8(0x08)
};

// Class Tiger.TigerAnimNotify_PlayCharEffect
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_PlayCharEffect : UAnimNotify {
	struct UTigerCharacterEffect* Effect; // 0x38(0x08)
	struct FName SocketToUse; // 0x40(0x08)
};

// Class Tiger.TigerAnimNotify_PlayVoEvent
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_PlayVoEvent : UAnimNotify {
	struct FTigerNpcVoCategory VoCategory; // 0x38(0x08)
};

// Class Tiger.TigerAnimNotify_PrimeWeapon
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_PrimeWeapon : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_Ragdoll
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_Ragdoll : UAnimNotify {
	struct FName RagdollOnlyBelowBone; // 0x38(0x08)
	bool bIncludeNamedBone; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float VelocityScale; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotify_Recklessness
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Recklessness : UAnimNotify {
	bool bActivate; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Tiger.TigerAnimNotify_ReloadSlot
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadSlot : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_ReloadComplete
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadComplete : UTigerAnimNotify_ReloadSlot {
};

// Class Tiger.TigerAnimNotify_ReloadFull
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadFull : UTigerAnimNotify_ReloadSlot {
};

// Class Tiger.TigerAnimNotify_ReloadSingle
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadSingle : UTigerAnimNotify_ReloadSlot {
};

// Class Tiger.TigerAnimNotify_SetCapContext
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_SetCapContext : UAnimNotify {
	struct FName ContextName; // 0x38(0x08)
};

// Class Tiger.TigerAnimNotify_SpawnMesh
// Size: 0x70 (Inherited: 0x38)
struct UTigerAnimNotify_SpawnMesh : UAnimNotify {
	struct UStaticMesh* MeshToSpawn; // 0x38(0x08)
	struct FName SocketToSpawnFrom; // 0x40(0x08)
	struct FVector Direction[0x2]; // 0x48(0x18)
	float Speed[0x2]; // 0x60(0x08)
	float RandomAngularImpulseStrength; // 0x68(0x04)
	bool bShowInEditor; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
};

// Class Tiger.TigerAnimNotify_TriggerUpdateWpnAppearance
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_TriggerUpdateWpnAppearance : UAnimNotify {
};

// Class Tiger.TigerAnimNotifyState_AbortAnimationOnInput
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_AbortAnimationOnInput : UAnimNotifyState {
	float BlendOutTime; // 0x30(0x04)
	bool bShouldAbortOnMovement; // 0x34(0x01)
	bool bShouldAbortOnHeldBlock; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
};

// Class Tiger.TigerAnimNotifyState_CameraPresetOverride
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_CameraPresetOverride : UAnimNotifyState {
	struct UTigerCameraPreset* CameraPreset; // 0x30(0x08)
};

// Class Tiger.TigerAnimNotifyState_CancelReactionIfThreatened
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_CancelReactionIfThreatened : UAnimNotifyState {
	enum class ETigerAIAnimationMode StateToCancelFor; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)

	void OnReactionCanceled(struct ATigerNPC* NPC); // Function Tiger.TigerAnimNotifyState_CancelReactionIfThreatened.OnReactionCanceled // (Event|Public|BlueprintEvent|Const) // @ game+0x18b4070
};

// Class Tiger.TigerAnimNotifyState_DamageImmunity
// Size: 0x40 (Inherited: 0x30)
struct UTigerAnimNotifyState_DamageImmunity : UAnimNotifyState {
	struct TArray<struct UDamageType*> ImmunityTo; // 0x30(0x10)
};

// Class Tiger.TigerAnimNotifyState_EnableTurnStart
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_EnableTurnStart : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_EnableWeaponHitbox
// Size: 0x50 (Inherited: 0x30)
struct UTigerAnimNotifyState_EnableWeaponHitbox : UAnimNotifyState {
	char pad_30[0x10]; // 0x30(0x10)
	struct UCurveFloat* pitchOffsetCurve; // 0x40(0x08)
	int32_t WeaponIndex; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Tiger.TigerAnimNotifyState_FaceCameraDirection
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_FaceCameraDirection : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_HeavyAttackRange
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_HeavyAttackRange : UAnimNotifyState {

	void OnChargeUpEnded(struct ATigerPlayer* Player, struct UTigerMeleeWeapon* EquippedWeapon, float ChargeUpRatio); // Function Tiger.TigerAnimNotifyState_HeavyAttackRange.OnChargeUpEnded // (Event|Public|BlueprintEvent|Const) // @ game+0x18b4070
	struct UTigerMeleeWeapon* GetEquippedWeapon(struct USkeletalMeshComponent* MeshComp); // Function Tiger.TigerAnimNotifyState_HeavyAttackRange.GetEquippedWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13defa0
};

// Class Tiger.TigerAnimNotifyState_HideWeapon
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_HideWeapon : UAnimNotifyState {
	enum class ETigerTriggerUpdateWpnAppearance WeaponAppearanceUpdate; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Tiger.TigerAnimNotifyState_Invulnerability
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_Invulnerability : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_LockOwner
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_LockOwner : UAnimNotifyState {
	bool bStopActiveMovement; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Tiger.TigerAnimNotifyState_MeleeRecoveryEnableMove
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_MeleeRecoveryEnableMove : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_OverrideCanInteractInDodge
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_OverrideCanInteractInDodge : UAnimNotifyState {
	struct UTigerMeleeWeapon* RequiredWeapon; // 0x30(0x08)
};

// Class Tiger.TigerAnimNotifyState_RangedHitAnimInterruptRange
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_RangedHitAnimInterruptRange : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_ResetCloth
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_ResetCloth : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_TimedIndoorOutDoorParticleEffect
// Size: 0x78 (Inherited: 0x30)
struct UTigerAnimNotifyState_TimedIndoorOutDoorParticleEffect : UAnimNotifyState {
	struct UParticleSystem* IndoorPSTemplate; // 0x30(0x08)
	struct UParticleSystem* OutdoorPSTemplate; // 0x38(0x08)
	enum class ETigerPlayOnClients PlayOnClients; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName SocketName; // 0x44(0x08)
	struct FVector LocationOffset; // 0x4c(0x0c)
	struct FRotator RotationOffset; // 0x58(0x0c)
	bool bDestroyAtEnd; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct UTigerParticleStrategyChooseSystem* ChooseParticleSystemOverride; // 0x68(0x08)
	struct UTigerParticleStrategyPostSpawn* ParticlePostSpawnModification; // 0x70(0x08)
};

// Class Tiger.TigerAnimNotifyState_WallGrindFX
// Size: 0x40 (Inherited: 0x30)
struct UTigerAnimNotifyState_WallGrindFX : UAnimNotifyState {
	struct TArray<struct FName> SocketsToUse; // 0x30(0x10)
};

// Class Tiger.TigerAnimNotifyState_WeaponGlow
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_WeaponGlow : UAnimNotifyState {

	void OnWeaponGlowEnd(struct USkeletalMeshComponent* WeaponMeshComponent, struct UTigerMeleeWeaponTrailConfig* WeaponEffectsConfig); // Function Tiger.TigerAnimNotifyState_WeaponGlow.OnWeaponGlowEnd // (Event|Protected|BlueprintEvent|Const) // @ game+0x18b4070
	void OnWeaponGlowBegin(struct USkeletalMeshComponent* WeaponMeshComponent, struct UTigerMeleeWeaponTrailConfig* WeaponEffectsConfig); // Function Tiger.TigerAnimNotifyState_WeaponGlow.OnWeaponGlowBegin // (Event|Protected|BlueprintEvent|Const) // @ game+0x18b4070
};

// Class Tiger.TigerAnimNotifyStateAttachMesh
// Size: 0x48 (Inherited: 0x30)
struct UTigerAnimNotifyStateAttachMesh : UAnimNotifyState {
	struct UStaticMesh* MeshToSpawn; // 0x30(0x08)
	struct FName SocketName; // 0x38(0x08)
	bool bShowInEditor; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float PropTimeout; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotifyStateJdgSword
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyStateJdgSword : UAnimNotifyState {
};

// Class Tiger.TigerANS_DeltaCorrectionWindow
// Size: 0x30 (Inherited: 0x30)
struct UTigerANS_DeltaCorrectionWindow : UAnimNotifyState {
};

// Class Tiger.TigerAnsSidewaysClimbBlocker
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnsSidewaysClimbBlocker : UAnimNotifyState {
};

// Class Tiger.TigerApartmentArchetype
// Size: 0x250 (Inherited: 0x228)
struct ATigerApartmentArchetype : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct USceneComponent* Min; // 0x230(0x08)
	struct USceneComponent* Max; // 0x238(0x08)
	struct TArray<struct UMaterialInterface*> PossibleWallpapers; // 0x240(0x10)
};

// Class Tiger.TigerApartmentLight
// Size: 0x228 (Inherited: 0x228)
struct ATigerApartmentLight : AActor {
};

// Class Tiger.TigerWidget
// Size: 0x280 (Inherited: 0x260)
struct UTigerWidget : UUserWidget {
	char pad_260[0x8]; // 0x260(0x08)
	struct UTigerTooltipWidget* TigerTooltipWidget; // 0x268(0x08)
	struct TArray<struct FTigerTooltipAction> TooltipActions; // 0x270(0x10)

	void UpdateScrollOffsetFromGamepadInput(struct UScrollBox* ScrollBox); // Function Tiger.TigerWidget.UpdateScrollOffsetFromGamepadInput // (Final|Native|Public|BlueprintCallable) // @ game+0x15664f0
	bool ShouldIgnoreVisibilityChanges(); // Function Tiger.TigerWidget.ShouldIgnoreVisibilityChanges // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x15664c0
	struct UTigerTooltipWidget* ReuseOrCreateNewTooltipWidget(struct UTigerTooltipWidget* InTooltipClass); // Function Tiger.TigerWidget.ReuseOrCreateNewTooltipWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x1566420
	void RemoveTooltipInputListeners(); // Function Tiger.TigerWidget.RemoveTooltipInputListeners // (Final|Native|Public|BlueprintCallable) // @ game+0x1566400
	void PostAkEvent(struct UAkAudioEvent* AudioEvent); // Function Tiger.TigerWidget.PostAkEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x15662e0
	void OnPlayerStateReceived(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerWidget.OnPlayerStateReceived // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	bool IsSharkmobAccountLoginsEnabled(); // Function Tiger.TigerWidget.IsSharkmobAccountLoginsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1566260
	void IncrementCollapseVisibility(); // Function Tiger.TigerWidget.IncrementCollapseVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x1566240
	struct ATigerPlayer* GetViewTargetTigerPlayer(); // Function Tiger.TigerWidget.GetViewTargetTigerPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565e90
	struct ATigerSpectatorPawn* GetTigerSpectator(); // Function Tiger.TigerWidget.GetTigerSpectator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565e60
	struct ATigerPlayerState* GetTigerPlayerState(); // Function Tiger.TigerWidget.GetTigerPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565e30
	struct ATigerPlayerController* GetTigerPlayerController(); // Function Tiger.TigerWidget.GetTigerPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565e00
	struct ATigerPlayer* GetTigerPlayer(); // Function Tiger.TigerWidget.GetTigerPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565dd0
	struct UTigerPersistentPlayerState* GetTigerPersistentPlayerState(); // Function Tiger.TigerWidget.GetTigerPersistentPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565da0
	struct ATigerMatchHUD* GetTigerMatchHUD(); // Function Tiger.TigerWidget.GetTigerMatchHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565d70
	struct ATigerMatchGameState* GetTigerMatchGameState(); // Function Tiger.TigerWidget.GetTigerMatchGameState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565d40
	struct ATigerElysiumHUD* GetTigerElysiumHUD(); // Function Tiger.TigerWidget.GetTigerElysiumHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565d10
	struct ATigerHUD* GetTigerBaseHUD(); // Function Tiger.TigerWidget.GetTigerBaseHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565ce0
	struct ATigerPlayer* GetSpectatedTigerPlayer(); // Function Tiger.TigerWidget.GetSpectatedTigerPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565cb0
	float GetScrollOffsetFromGamepadInput(); // Function Tiger.TigerWidget.GetScrollOffsetFromGamepadInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565c80
	struct UWidget* GetRootWidget(); // Function Tiger.TigerWidget.GetRootWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565c50
	struct UTigerPartyManager* GetPartyManager(); // Function Tiger.TigerWidget.GetPartyManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1565b40
	void DecrementCollapseVisibility(); // Function Tiger.TigerWidget.DecrementCollapseVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x1565a80
	struct UTigerTooltipWidget* ConstructTooltipWidget(); // Function Tiger.TigerWidget.ConstructTooltipWidget // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void CallReleasedForAction(struct FName& InputAction); // Function Tiger.TigerWidget.CallReleasedForAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1565950
	void CallPressedForAction(struct FName& InputAction); // Function Tiger.TigerWidget.CallPressedForAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15658c0
	void AddTooltipInputListeners(); // Function Tiger.TigerWidget.AddTooltipInputListeners // (Final|Native|Public|BlueprintCallable) // @ game+0x1565810
	void AddTooltipAction(struct FTigerTooltipAction& NewTooltipAction, struct FDelegate& OnPressed, struct FDelegate& OnReleased); // Function Tiger.TigerWidget.AddTooltipAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1565630
};

// Class Tiger.TigerArchetypeLevelWidget
// Size: 0x290 (Inherited: 0x280)
struct UTigerArchetypeLevelWidget : UTigerWidget {
	int32_t ArchetypeLevel; // 0x280(0x04)
	struct TWeakObjectPtr<struct ATigerPlayer> RepresentedPlayer; // 0x284(0x08)
	char pad_28C[0x4]; // 0x28c(0x04)

	void UpdateArchetypeLevel(); // Function Tiger.TigerArchetypeLevelWidget.UpdateArchetypeLevel // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnSelectedPerksUpdated(); // Function Tiger.TigerArchetypeLevelWidget.OnSelectedPerksUpdated // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnSelectedCharacterChanged(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerArchetypeLevelWidget.OnSelectedCharacterChanged // (Final|Native|Protected) // @ game+0x13e3fa0
	void OnArchetypeChanged(struct UTigerPlayerClanData* InClanData, struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeLevelWidget.OnArchetypeChanged // (Final|Native|Protected) // @ game+0x13e3a30
	void Init(struct ATigerPlayer* InRepresentedPlayer); // Function Tiger.TigerArchetypeLevelWidget.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x13e39a0
};

// Class Tiger.TigerArchetypeRewardData
// Size: 0xc0 (Inherited: 0x30)
struct UTigerArchetypeRewardData : UDataAsset {
	struct FTigerArchetype Archetypes[0x9]; // 0x30(0x90)

	struct TArray<struct FTigerItemId> GetRewardsInLevelRange(enum class ETigerPowerKitType InType, int32_t InLowerLevel, int32_t InUpperLevel); // Function Tiger.TigerArchetypeRewardData.GetRewardsInLevelRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3790
	struct TArray<struct FTigerItemId> GetRewardsBeforeLevel(enum class ETigerPowerKitType InType, int32_t InLevel); // Function Tiger.TigerArchetypeRewardData.GetRewardsBeforeLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3680
	struct TArray<struct FTigerItemId> GetRewardsAfterLevel(enum class ETigerPowerKitType InType, int32_t InLevel); // Function Tiger.TigerArchetypeRewardData.GetRewardsAfterLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3570
	struct TArray<struct FTigerItemId> GetRewards(enum class ETigerPowerKitType InType); // Function Tiger.TigerArchetypeRewardData.GetRewards // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3490
	struct FTigerItemId GetRewardForLevel(enum class ETigerPowerKitType InType, int32_t InLevel); // Function Tiger.TigerArchetypeRewardData.GetRewardForLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e33b0
	bool GetNextLevelReward(enum class ETigerPowerKitType InType, int32_t InLevel, struct FTigerArchetypeReward& OutArchetypeReward); // Function Tiger.TigerArchetypeRewardData.GetNextLevelReward // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3280
	struct TArray<struct FTigerArchetypeReward> GetLevelRewards(enum class ETigerPowerKitType InType); // Function Tiger.TigerArchetypeRewardData.GetLevelRewards // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e31a0
	void GetFirstAndLastRewardLevels(enum class ETigerPowerKitType InType, int32_t& OutFirstRewardLevel, int32_t& OutLastRewardLevel); // Function Tiger.TigerArchetypeRewardData.GetFirstAndLastRewardLevels // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3080
	int32_t FindRewardUnlockLevel(enum class ETigerPowerKitType InType, struct UTigerInventoryItemBase* InRewardItem); // Function Tiger.TigerArchetypeRewardData.FindRewardUnlockLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e2f70
};

// Class Tiger.TigerMenuWidget
// Size: 0x298 (Inherited: 0x280)
struct UTigerMenuWidget : UTigerWidget {
	struct UTigerSharedMouseCursor* SharedMouseCursor; // 0x280(0x08)
	bool bStopPlayerInteractionsOnOpen; // 0x288(0x01)
	bool bShouldShowMouseCursorOnOpenWithGamepad; // 0x289(0x01)
	char pad_28A[0x1]; // 0x28a(0x01)
	bool bShouldCloseOtherMenusOnOpen; // 0x28b(0x01)
	char pad_28C[0x2]; // 0x28c(0x02)
	bool bShouldThrottleFrameRate; // 0x28e(0x01)
	char pad_28F[0x9]; // 0x28f(0x09)

	bool TryMakeDateTime(int32_t InYear, int32_t InMonth, int32_t InDay, struct FDateTime& OutDateTime); // Function Tiger.TigerMenuWidget.TryMakeDateTime // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x14a38d0
	void Open(); // Function Tiger.TigerMenuWidget.Open // (Native|Public|BlueprintCallable) // @ game+0x14a37b0
	void OnPersistentPlayerStateInitialized(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerMenuWidget.OnPersistentPlayerStateInitialized // (Native|Event|Protected|BlueprintEvent) // @ game+0x1436060
	void OnPersistentPlayerInitialized(struct ATigerPlayerController* InPlayerController); // Function Tiger.TigerMenuWidget.OnPersistentPlayerInitialized // (Final|Native|Protected) // @ game+0x14a3690
	void OnOpen(); // Function Tiger.TigerMenuWidget.OnOpen // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnClose(); // Function Tiger.TigerMenuWidget.OnClose // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	bool IsOpen(); // Function Tiger.TigerMenuWidget.IsOpen // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14a3600
	void Close(); // Function Tiger.TigerMenuWidget.Close // (Native|Public|BlueprintCallable) // @ game+0x1435fb0
};

// Class Tiger.TigerIngameSubmenuWidget
// Size: 0x2c0 (Inherited: 0x298)
struct UTigerIngameSubmenuWidget : UTigerMenuWidget {
	struct FText MenuName; // 0x298(0x18)
	struct UTigerIngameMenuWidget* MenuContainer; // 0x2b0(0x08)
	bool InGameMenuEnabled; // 0x2b8(0x01)
	enum class ETigerNewNotificationMenuOptions NewNotificationMenuOption; // 0x2b9(0x01)
	char pad_2BA[0x6]; // 0x2ba(0x06)

	void UnregisterSharedInputs(); // Function Tiger.TigerIngameSubmenuWidget.UnregisterSharedInputs // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void RegisterSharedInputs(); // Function Tiger.TigerIngameSubmenuWidget.RegisterSharedInputs // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	bool GetIsTransitioning(); // Function Tiger.TigerIngameSubmenuWidget.GetIsTransitioning // (Final|Native|Public) // @ game+0x146ee70
};

// Class Tiger.TigerSceneBackgroundUI
// Size: 0x3c0 (Inherited: 0x2c0)
struct UTigerSceneBackgroundUI : UTigerIngameSubmenuWidget {
	struct TSoftObjectPtr<UWorld> DefaultSubLevel; // 0x2c0(0x28)
	char pad_2E8[0x8]; // 0x2e8(0x08)
	struct UTigerSubLevelList* SubLevelList; // 0x2f0(0x08)
	struct FName DefaultCameraTag; // 0x2f8(0x08)
	struct FName SpawnLocationTag; // 0x300(0x08)
	struct FViewTargetTransitionParams CameraTransitionParams; // 0x308(0x10)
	struct TSoftObjectPtr<UTigerItemPreviewAsset> ItemPreviews; // 0x318(0x28)
	struct FName ItemParentTag; // 0x340(0x08)
	struct ATigerSingleChildActor* ItemParentActor; // 0x348(0x08)
	struct TSoftClassPtr<UObject> CurrentPreviewItem; // 0x350(0x28)
	struct TArray<struct ACineCameraActor*> CinematicCameras; // 0x378(0x10)
	char pad_388[0x20]; // 0x388(0x20)
	struct FMulticastInlineDelegate OnBackgroundShown; // 0x3a8(0x10)
	char pad_3B8[0x8]; // 0x3b8(0x08)

	bool TransitionToCameraWithTag(struct FName& CameraTag, bool bUseCameraTransition); // Function Tiger.TigerSceneBackgroundUI.TransitionToCameraWithTag // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1517770
	void ShowDefaultBackgroundScene(); // Function Tiger.TigerSceneBackgroundUI.ShowDefaultBackgroundScene // (Final|Native|Protected|BlueprintCallable) // @ game+0x15176a0
	void ShowBackgroundScene(int32_t InSubLevelIndex); // Function Tiger.TigerSceneBackgroundUI.ShowBackgroundScene // (Final|Native|Protected|BlueprintCallable) // @ game+0x1517610
	void RetryPreviewItem(); // Function Tiger.TigerSceneBackgroundUI.RetryPreviewItem // (Final|Native|Protected) // @ game+0x15175f0
	void PreviewReward(struct FTigerItemId ItemId); // Function Tiger.TigerSceneBackgroundUI.PreviewReward // (Final|Native|Protected|BlueprintCallable) // @ game+0x1517560
	void PreviewItem(struct TSoftClassPtr<UObject>& InItemClassPath); // Function Tiger.TigerSceneBackgroundUI.PreviewItem // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x15174a0
	void OnPreviewItemUpdated(struct UTigerInventoryItemBase* InPreviewItem, struct ATigerBattlepassRewardPreview* InPreviewActor, struct UTigerInventoryItemBase* InCombinedItemParent); // Function Tiger.TigerSceneBackgroundUI.OnPreviewItemUpdated // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnPreviewItemOpened(); // Function Tiger.TigerSceneBackgroundUI.OnPreviewItemOpened // (Final|Native|Protected|BlueprintCallable) // @ game+0x15173f0
	void OnBackgroundSceneShownNative(); // Function Tiger.TigerSceneBackgroundUI.OnBackgroundSceneShownNative // (Native|Protected) // @ game+0x1435f90
	void OnBackgroundSceneShown(); // Function Tiger.TigerSceneBackgroundUI.OnBackgroundSceneShown // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnBackgroundSceneLoadedNative(); // Function Tiger.TigerSceneBackgroundUI.OnBackgroundSceneLoadedNative // (Final|Native|Protected) // @ game+0x15173d0
	void HidePreviewItem(); // Function Tiger.TigerSceneBackgroundUI.HidePreviewItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x15173b0
	struct TArray<struct AActor*> GetCurrentPaperDollArray(struct FName InBattlePassSubLevelName); // Function Tiger.TigerSceneBackgroundUI.GetCurrentPaperDollArray // (Final|Native|Protected|BlueprintCallable) // @ game+0x1517280
};

// Class Tiger.TigerArchetypeSelectElysiumUI
// Size: 0x3e0 (Inherited: 0x3c0)
struct UTigerArchetypeSelectElysiumUI : UTigerSceneBackgroundUI {
	struct TArray<struct FTigerPersistentPlayerCharacter> PlayerCharacters; // 0x3c0(0x10)
	struct FTigerItemId AdditionalCharacterSlotItem; // 0x3d0(0x08)
	char NumCharacterSlots; // 0x3d8(0x01)
	char pad_3D9[0x7]; // 0x3d9(0x07)

	void SelectCharacter(struct FTigerPersistentCharacterID InCharacterId); // Function Tiger.TigerArchetypeSelectElysiumUI.SelectCharacter // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e40e0
	void OnSelectedCharacterChanged(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerArchetypeSelectElysiumUI.OnSelectedCharacterChanged // (Final|Native|Protected) // @ game+0x13e4030
	void OnPlayerInventoryChanged(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerArchetypeSelectElysiumUI.OnPlayerInventoryChanged // (Final|Native|Protected) // @ game+0x13e3f10
	void OnGotPlayerCharacters(struct TArray<struct FTigerPersistentPlayerCharacter>& InCharacters, struct FString InErrorString); // Function Tiger.TigerArchetypeSelectElysiumUI.OnGotPlayerCharacters // (Final|Native|Protected|HasOutParms) // @ game+0x13e3c50
	void OnBuyCharacterSlotServerResponse(bool bInSuccess, struct FTigerItemId& InItemId, struct FString InErrorMessage); // Function Tiger.TigerArchetypeSelectElysiumUI.OnBuyCharacterSlotServerResponse // (Final|Native|Protected|HasOutParms) // @ game+0x13e3b00
	void OnBuyCharacterSlotResults(bool bInSuccess, struct FString InErrorString); // Function Tiger.TigerArchetypeSelectElysiumUI.OnBuyCharacterSlotResults // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnArchetypeChanged(struct UTigerPowerKit* InArchetypeData, struct TArray<int32_t>& InPlayerArchetypeCharacterIndices); // Function Tiger.TigerArchetypeSelectElysiumUI.OnArchetypeChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	struct FTigerItemIdWithPrice GetAdditionalSlotPrice(); // Function Tiger.TigerArchetypeSelectElysiumUI.GetAdditionalSlotPrice // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e3040
	void CreateNewCharacter(struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeSelectElysiumUI.CreateNewCharacter // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e2e10
	void ChangeArchetype(struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeSelectElysiumUI.ChangeArchetype // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e2d80
	void BuyAdditionalCharacterSlot(); // Function Tiger.TigerArchetypeSelectElysiumUI.BuyAdditionalCharacterSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e2d60
};

// Class Tiger.TigerArchetypeSelectPragueUI
// Size: 0x310 (Inherited: 0x298)
struct UTigerArchetypeSelectPragueUI : UTigerMenuWidget {
	int32_t GroupSize; // 0x298(0x04)
	int32_t PreGameStateEndTime; // 0x29c(0x04)
	struct FString PreHighlightTag; // 0x2a0(0x10)
	struct FName CameraLevelName; // 0x2b0(0x08)
	float TimeLeftUntilStateChange; // 0x2b8(0x04)
	enum class ETigerArchetypeSelectUiState UiState; // 0x2bc(0x01)
	char pad_2BD[0x3]; // 0x2bd(0x03)
	struct TArray<struct FTigerPersistentPlayerCharacter> PlayerCharacters; // 0x2c0(0x10)
	enum class ETigerPowerKitType SelectedArchetypeType; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct UTigerPreMatchPaperDollComponent* PreMatchPaperDollComp; // 0x2d8(0x08)
	char pad_2E0[0x30]; // 0x2e0(0x30)

	void SelectCharacterForArchetype(struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeSelectPragueUI.SelectCharacterForArchetype // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e4160
	void RevertLODBias(); // Function Tiger.TigerArchetypeSelectPragueUI.RevertLODBias // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e40c0
	void OnUiStateChanged(enum class ETigerArchetypeSelectUiState InPreviousUiState); // Function Tiger.TigerArchetypeSelectPragueUI.OnUiStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnPlayerCharactersReceived(struct TArray<struct FTigerPersistentPlayerCharacter>& InCharacters, struct FString InErrorString); // Function Tiger.TigerArchetypeSelectPragueUI.OnPlayerCharactersReceived // (Final|Native|Protected|HasOutParms) // @ game+0x13e3db0
	void OnPlayerChangedSelection(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerArchetypeSelectPragueUI.OnPlayerChangedSelection // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnGroupMembersChanged(struct UTigerGroupStateComponent* InGroupStateComponent, struct TArray<struct ATigerPlayerState*>& InPreviousGroupMembers); // Function Tiger.TigerArchetypeSelectPragueUI.OnGroupMembersChanged // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnBackgroundLevelLoaded(); // Function Tiger.TigerArchetypeSelectPragueUI.OnBackgroundLevelLoaded // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnArchetypeSelectionLocked(struct ATigerPlayerState* InPlayerState, enum class ETigerPowerKitType InArchetype); // Function Tiger.TigerArchetypeSelectPragueUI.OnArchetypeSelectionLocked // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void HandleLevelVisibilityChanged(); // Function Tiger.TigerArchetypeSelectPragueUI.HandleLevelVisibilityChanged // (Final|Native|Protected) // @ game+0x13e3980
	float GetSecondsLeftUntilPlayerSelection(enum class ETigerArchetypeSelectUiState InPlayerUiState); // Function Tiger.TigerArchetypeSelectPragueUI.GetSecondsLeftUntilPlayerSelection // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e38f0
	void EnablePaperDollHighlight(struct ATigerPaperDoll* InPaperDoll, bool bInEnable); // Function Tiger.TigerArchetypeSelectPragueUI.EnablePaperDollHighlight // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e2ea0
};

// Class Tiger.TigerBuffInstance
// Size: 0x88 (Inherited: 0x28)
struct UTigerBuffInstance : UObject {
	struct FTigerBuffReplicatedInstanceData BuffReplicatedInstanceData; // 0x28(0x20)
	struct TWeakObjectPtr<struct ATigerCharacter> OwnerCharacter; // 0x48(0x08)
	struct UTigerBuff* Buff; // 0x50(0x08)
	char pad_58[0x10]; // 0x58(0x10)
	struct UParticleSystemComponent* ActiveBuffParticles; // 0x68(0x08)
	struct UNiagaraComponent* ActiveNiagaraParticles; // 0x70(0x08)
	struct TArray<struct UNiagaraComponent*> AdditionalActiveNiagaraParticles; // 0x78(0x10)

	struct ATigerCharacter* GetOwningCharacter(); // Function Tiger.TigerBuffInstance.GetOwningCharacter // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec5e0
	struct UNiagaraComponent* GetActiveNiagaraParticles(); // Function Tiger.TigerBuffInstance.GetActiveNiagaraParticles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec500
	struct UParticleSystemComponent* GetActiveBuffParticles(); // Function Tiger.TigerBuffInstance.GetActiveBuffParticles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec4e0
};

// Class Tiger.TigerAreaBuffInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerAreaBuffInstance : UTigerBuffInstance {
	char pad_88[0x8]; // 0x88(0x08)
};

// Class Tiger.TigerAreaBuff
// Size: 0x268 (Inherited: 0x268)
struct UTigerAreaBuff : UTigerBuff {
};

// Class Tiger.TigerAreaEffect
// Size: 0x4f0 (Inherited: 0x228)
struct ATigerAreaEffect : AActor {
	struct UParticleSystem* StartParticleType; // 0x228(0x08)
	struct UParticleSystem* LoopedParticleType; // 0x230(0x08)
	struct UParticleSystem* EndParticleType; // 0x238(0x08)
	struct UDamageType* DamageType; // 0x240(0x08)
	enum class ETigerDamageCauser DamageCauserType; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct FRuntimeFloatCurve TimeDamageModifierCurve; // 0x250(0x88)
	struct FRuntimeFloatCurve RangeDamageModifierCurve; // 0x2d8(0x88)
	struct FRuntimeFloatCurve TimeHealingModifierCurve; // 0x360(0x88)
	struct FRuntimeFloatCurve RangeHealingModifierCurve; // 0x3e8(0x88)
	struct USphereComponent* CollisionSphere; // 0x470(0x08)
	float Range; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct UTigerBuff* DamageBuff; // 0x480(0x08)
	float InitialDamageAmount; // 0x488(0x04)
	float DamageAmount; // 0x48c(0x04)
	struct UTigerBuff* HealBuff; // 0x490(0x08)
	float InitialHealAmount; // 0x498(0x04)
	float HealAmount; // 0x49c(0x04)
	float TickRate; // 0x4a0(0x04)
	float Duration; // 0x4a4(0x04)
	float Delay; // 0x4a8(0x04)
	bool bShouldAffectCivilians; // 0x4ac(0x01)
	bool bSkipLineTrace; // 0x4ad(0x01)
	char pad_4AE[0x2]; // 0x4ae(0x02)
	struct UParticleSystemComponent* LoopedParticleComponent; // 0x4b0(0x08)
	char pad_4B8[0x20]; // 0x4b8(0x20)
	struct FTigerDamageContext DamageContext; // 0x4d8(0x18)

	void Trigger(); // Function Tiger.TigerAreaEffect.Trigger // (Final|Native|Public) // @ game+0x13e41f0
	void OnVehicleHit(struct AActor* InActor); // Function Tiger.TigerAreaEffect.OnVehicleHit // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnTriggerClient(); // Function Tiger.TigerAreaEffect.OnTriggerClient // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerArena
// Size: 0x28 (Inherited: 0x28)
struct UTigerArena : UObject {
};

// Class Tiger.TigerSimpleTextPrompt
// Size: 0x2a8 (Inherited: 0x280)
struct UTigerSimpleTextPrompt : UTigerWidget {
	struct FText DisplayText; // 0x280(0x18)
	float PromptLifetimeFailsafe; // 0x298(0x04)
	bool bIsVisible; // 0x29c(0x01)
	char pad_29D[0xb]; // 0x29d(0x0b)

	void SetText(struct FText Text); // Function Tiger.TigerSimpleTextPrompt.SetText // (Final|Native|Public|BlueprintCallable) // @ game+0x15207d0
	void OnShowPrompt(); // Function Tiger.TigerSimpleTextPrompt.OnShowPrompt // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnHidePrompt(); // Function Tiger.TigerSimpleTextPrompt.OnHidePrompt // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void Hide(); // Function Tiger.TigerSimpleTextPrompt.Hide // (Final|Native|Public|BlueprintCallable) // @ game+0x1520150
	void FailsafeHide(); // Function Tiger.TigerSimpleTextPrompt.FailsafeHide // (Final|Native|Private) // @ game+0x1520050
	bool CanBeShown(); // Function Tiger.TigerSimpleTextPrompt.CanBeShown // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x151ff40
};

// Class Tiger.TigerArtifactPickedupPrompt
// Size: 0x2b0 (Inherited: 0x2a8)
struct UTigerArtifactPickedupPrompt : UTigerSimpleTextPrompt {
	struct UTigerArtifactAsset* ArtifactAsset; // 0x2a8(0x08)

	void OnArtifactAssetSet(struct UTigerArtifactAsset* InArtifactAsset); // Function Tiger.TigerArtifactPickedupPrompt.OnArtifactAssetSet // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerAssistPromptUi
// Size: 0x380 (Inherited: 0x2a8)
struct UTigerAssistPromptUi : UTigerSimpleTextPrompt {
	struct FTigerPlayerStateGameData PlayerStateData; // 0x2a8(0xd0)
	int32_t ExperienceGained; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
};

// Class Tiger.TigerAsyncChooseNextWaypoint
// Size: 0xf8 (Inherited: 0x70)
struct UTigerAsyncChooseNextWaypoint : UBTTaskNode {
	struct FBlackboardKeySelector Index; // 0x70(0x28)
	struct FBlackboardKeySelector Waypoint; // 0x98(0x28)
	struct FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0(0x28)
	char pad_E8[0x10]; // 0xe8(0x10)
};

// Class Tiger.TigerAudioVisualizationSpawnerComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UTigerAudioVisualizationSpawnerComponent : UActorComponent {
	struct UParticleSystem* ParticleSystemToSpawn; // 0xb0(0x08)
	int32_t MaxSimultaneousVisualizations; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct TArray<struct FTigerHeightenedSensesAudioVisualization> ActiveVisualizations; // 0xc0(0x10)
	char pad_D0[0x8]; // 0xd0(0x08)

	void VisualizeAudioEvent(struct FVector InLocation, bool InShowOnlyInHeightenedSenses); // Function Tiger.TigerAudioVisualizationSpawnerComponent.VisualizeAudioEvent // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x13e80e0
};

// Class Tiger.TigerAuthenticationManager
// Size: 0x198 (Inherited: 0x38)
struct UTigerAuthenticationManager : UTigerAuthenticationManagerBase {
	char pad_38[0x38]; // 0x38(0x38)
	bool bEnableSharkmobAccountLogin; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UTigerGameInstance* GameInstance; // 0x78(0x08)
	char pad_80[0x118]; // 0x80(0x118)

	bool IsSharkmobAccountLoginsEnabled(); // Function Tiger.TigerAuthenticationManager.IsSharkmobAccountLoginsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7b70
	struct FString GetUserLocation(); // Function Tiger.TigerAuthenticationManager.GetUserLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7af0
	enum class EShAccountChannel GetAuthenticatedChannel(); // Function Tiger.TigerAuthenticationManager.GetAuthenticatedChannel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e77b0
};

// Class Tiger.TigerAutoScrollBox
// Size: 0x8a0 (Inherited: 0x880)
struct UTigerAutoScrollBox : UScrollBox {
	char pad_880[0x8]; // 0x880(0x08)
	bool ResetScrollOnEnd; // 0x888(0x01)
	char pad_889[0x3]; // 0x889(0x03)
	float ScrollSpeed; // 0x88c(0x04)
	float WaitDurationBeforeScroll; // 0x890(0x04)
	float WaitDurationAfterScroll; // 0x894(0x04)
	char pad_898[0x8]; // 0x898(0x08)
};

// Class Tiger.TigerBalconyVolumeDefaultValues
// Size: 0x40 (Inherited: 0x30)
struct UTigerBalconyVolumeDefaultValues : UDataAsset {
	struct TArray<struct FTigerBuildingSystemBalconyVolumeDefaults> DefaultBalconyVolumeSets; // 0x30(0x10)
};

// Class Tiger.TigerNPCFacePoseMap
// Size: 0x38 (Inherited: 0x28)
struct UTigerNPCFacePoseMap : UObject {
	struct TArray<struct FTigerFacePoseData> HeadMeshsPoseAssets; // 0x28(0x10)
};

// Class Tiger.TigerCharacter
// Size: 0x860 (Inherited: 0x4c0)
struct ATigerCharacter : ACharacter {
	struct UTigerCharacterMeshManager* MeshManager; // 0x4c0(0x08)
	struct UTigerRangedWeaponComponent* RangedWeaponComponent; // 0x4c8(0x08)
	struct UTigerMeleeWeaponComponent* MeleeWeaponComponent; // 0x4d0(0x08)
	struct UTigerCombatComponent* CombatComponent; // 0x4d8(0x08)
	struct UTigerFeedingComponent* FeedingComponent; // 0x4e0(0x08)
	struct UTigerBuffComponent* BuffComponent; // 0x4e8(0x08)
	struct UTigerOutlineComponent* OutlineComponent; // 0x4f0(0x08)
	struct UAkComponent* AudioComponent; // 0x4f8(0x08)
	struct UAkComponent* NonOccludedAudioComponent; // 0x500(0x08)
	struct USceneComponent* AdditionalMeshes; // 0x508(0x08)
	struct USkeletalMeshComponentBudgeted* HeadMesh; // 0x510(0x08)
	struct USkeletalMeshComponentBudgeted* HoodieMesh; // 0x518(0x08)
	struct USkeletalMeshComponentBudgeted* HairMesh; // 0x520(0x08)
	struct USkeletalMeshComponentBudgeted* HeadgearMesh; // 0x528(0x08)
	struct USkeletalMeshComponentBudgeted* EyewearMesh; // 0x530(0x08)
	struct USkeletalMeshComponentBudgeted* BodyAdditionalMesh; // 0x538(0x08)
	char pad_540[0x20]; // 0x540(0x20)
	struct FMulticastInlineDelegate OnCharacterAction; // 0x560(0x10)
	struct FMulticastInlineDelegate OnDamageMitigated; // 0x570(0x10)
	char pad_580[0x10]; // 0x580(0x10)
	bool bIsRootMotionDisabled; // 0x590(0x01)
	char pad_591[0x3]; // 0x591(0x03)
	float BaseMaxHealth; // 0x594(0x04)
	struct USkeletalMeshComponent* ThirdPersonWeaponMeshRef; // 0x598(0x08)
	struct USkeletalMeshComponent* SecondaryWeaponMeshRef; // 0x5a0(0x08)
	struct USceneComponent* ProjectileSpawnRef; // 0x5a8(0x08)
	struct USceneComponent* SecondaryProjectileSpawnRef; // 0x5b0(0x08)
	struct FTigerCharacterStatModification BaseCharacterStats; // 0x5b8(0xa8)
	struct FTigerReplicatedCharacterStats ReplicatedCharacterStats; // 0x660(0x18)
	char pad_678[0x90]; // 0x678(0x90)
	bool bBlueprintReferencesSetup; // 0x708(0x01)
	char pad_709[0x7]; // 0x709(0x07)
	struct FMulticastInlineDelegate OnCharacterDeath; // 0x710(0x10)
	char pad_720[0x30]; // 0x720(0x30)
	float CurrentHealth; // 0x750(0x04)
	char pad_754[0x4]; // 0x754(0x04)
	struct FMulticastInlineDelegate OnMaxShieldReplicated; // 0x758(0x10)
	uint16_t MaxShield; // 0x768(0x02)
	int16_t MaxAttainableShield; // 0x76a(0x02)
	uint16_t CurrentShield; // 0x76c(0x02)
	char pad_76E[0x2]; // 0x76e(0x02)
	float LowHealthThreshold; // 0x770(0x04)
	char pad_774[0x4]; // 0x774(0x04)
	float HitAnimationInterval; // 0x778(0x04)
	char pad_77C[0xc]; // 0x77c(0x0c)
	struct FVector HealthBarOffset; // 0x788(0x0c)
	enum class ETigerGender BodyType; // 0x794(0x01)
	bool bIsKindred; // 0x795(0x01)
	enum class ETigerCharacterType CharacterType; // 0x796(0x01)
	char pad_797[0x1]; // 0x797(0x01)
	struct FName RangedHitAnimationListName; // 0x798(0x08)
	struct FName MeleeHitAnimationListName; // 0x7a0(0x08)
	struct UPhysicsAsset* HitboxPhysicsAsset; // 0x7a8(0x08)
	struct UPhysicsAsset* RagdollPhysicsAsset; // 0x7b0(0x08)
	char pad_7B8[0x10]; // 0x7b8(0x10)
	struct FTimerHandle RagdollTimer; // 0x7c8(0x08)
	struct UAnimMontage* TimedMontageLoop; // 0x7d0(0x08)
	struct FTimerHandle TimedMontageLoopTimer; // 0x7d8(0x08)
	char pad_7E0[0x10]; // 0x7e0(0x10)
	struct TArray<struct TWeakObjectPtr<struct ATigerCharacter>> CharmedByCharacters; // 0x7f0(0x10)
	bool bIsDodging; // 0x800(0x01)
	char pad_801[0x7]; // 0x801(0x07)
	float SmoothYawInterpSpeed; // 0x808(0x04)
	char pad_80C[0xc]; // 0x80c(0x0c)
	struct UWidgetComponent* HealthBarComponent; // 0x818(0x08)
	struct USkeletalMeshSocket* WidgetSocket; // 0x820(0x08)
	char pad_828[0x38]; // 0x828(0x38)

	void TriggerLimitedHitAnimation(bool bIsRangedHit); // Function Tiger.TigerCharacter.TriggerLimitedHitAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x1404510
	float TriggerHitAnimation(bool bInIsRangedHit); // Function Tiger.TigerCharacter.TriggerHitAnimation // (Native|Public|BlueprintCallable) // @ game+0x1404470
	float TriggerAnimationByName(struct FName AnimationMontageName, float PlayRate); // Function Tiger.TigerCharacter.TriggerAnimationByName // (Final|Native|Public|BlueprintCallable) // @ game+0x14043a0
	void TigerOnMaxShieldReplicated__DelegateSignature(); // DelegateFunction Tiger.TigerCharacter.TigerOnMaxShieldReplicated__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void TigerOnDamageMitigated__DelegateSignature(float InTotalDamage, float InDamageMitigated); // DelegateFunction Tiger.TigerCharacter.TigerOnDamageMitigated__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void TigerOnCrouchStateUpdated__DelegateSignature(bool bInIsCrouched); // DelegateFunction Tiger.TigerCharacter.TigerOnCrouchStateUpdated__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void TigerOnCharacterDeath__DelegateSignature(); // DelegateFunction Tiger.TigerCharacter.TigerOnCharacterDeath__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void TigerOnCharacterAction__DelegateSignature(enum class ETigerCharacterAction InCharacterAction); // DelegateFunction Tiger.TigerCharacter.TigerOnCharacterAction__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void SpawnBloodDecal(); // Function Tiger.TigerCharacter.SpawnBloodDecal // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	bool ShouldHealthbarBeVisible(); // Function Tiger.TigerCharacter.ShouldHealthbarBeVisible // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1404370
	void SetClanSwitch(enum class ETigerClan InTigerClan); // Function Tiger.TigerCharacter.SetClanSwitch // (Final|Native|Public|BlueprintCallable) // @ game+0x14042f0
	void SetBaseMaxHealth(float NewMaxHealth); // Function Tiger.TigerCharacter.SetBaseMaxHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1404270
	void ReportCharacterAction(enum class ETigerCharacterAction Action); // Function Tiger.TigerCharacter.ReportCharacterAction // (Final|Native|Public|BlueprintCallable) // @ game+0x14041f0
	void RefreshCharacterStats(); // Function Tiger.TigerCharacter.RefreshCharacterStats // (Final|Native|Public|BlueprintCallable) // @ game+0x14041d0
	int32_t PostAkEvent(struct UAkAudioEvent* AudioEvent, bool bEnableOcclusion); // Function Tiger.TigerCharacter.PostAkEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x1404100
	void OnWeaponVisualChangedEvent(); // Function Tiger.TigerCharacter.OnWeaponVisualChangedEvent // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnWeaponFired(bool bSecondaryWeaponFired); // Function Tiger.TigerCharacter.OnWeaponFired // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnShowDamageAmount(struct FVector& InHitLocation, struct FLinearColor& InDamageColor, int32_t InTotalDamageAmount, int32_t InHealthDamageAmount, bool bInHasExtraHealth, bool bInHasShield, float InRangedDamageFalloffPercent); // Function Tiger.TigerCharacter.OnShowDamageAmount // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x18b4070
	void OnRep_MaxShieldChanged(uint16_t InOldMaxShield); // Function Tiger.TigerCharacter.OnRep_MaxShieldChanged // (Final|Native|Protected) // @ game+0x1403df0
	void OnRep_CurrentShieldChanged(); // Function Tiger.TigerCharacter.OnRep_CurrentShieldChanged // (Final|Native|Protected) // @ game+0x1403dd0
	void OnRep_CurrentHealth(float InOldHealth); // Function Tiger.TigerCharacter.OnRep_CurrentHealth // (Native|Protected) // @ game+0x1403d40
	void OnPlayMeleeHitEffects(struct UTigerMeleeWeapon* WeaponHitBy, struct FVector& ImpactLocation, struct FVector& HitDirection); // Function Tiger.TigerCharacter.OnPlayMeleeHitEffects // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x18b4070
	void OnLocalDisciplineUseFailed(struct FDisciplineUse& DisciplineUse); // Function Tiger.TigerCharacter.OnLocalDisciplineUseFailed // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnLocalDisciplineUse(struct FDisciplineUse& DisciplineUse, float ExpectedDuration); // Function Tiger.TigerCharacter.OnLocalDisciplineUse // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnLocalDisciplineReleaseFailed(struct FDisciplineUse& DisciplineUse); // Function Tiger.TigerCharacter.OnLocalDisciplineReleaseFailed // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnLocalDisciplineRelease(struct FDisciplineUse& DisciplineUse, float ExpectedDuration); // Function Tiger.TigerCharacter.OnLocalDisciplineRelease // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnDodged(bool IsControllingPlayer, bool bLaunchedInAir, struct FVector LaunchDirection, char DodgeStage); // Function Tiger.TigerCharacter.OnDodged // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0x18b4070
	void OnDisciplineUseSucceeded(struct FDisciplineUse& DisciplineUse); // Function Tiger.TigerCharacter.OnDisciplineUseSucceeded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void OnDisciplineReleaseSucceeded(struct FDisciplineUse& DisciplineUse); // Function Tiger.TigerCharacter.OnDisciplineReleaseSucceeded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	void Multicast_SetRagdollDeath(bool bEnableRagdoll); // Function Tiger.TigerCharacter.Multicast_SetRagdollDeath // (Net|Native|Event|NetMulticast|Public) // @ game+0x1403700
	void Multicast_PostAkEvent(struct UAkAudioEvent* AudioEvent, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_PostAkEvent // (Net|Native|Event|NetMulticast|Public) // @ game+0x1403630
	void Multicast_PlaySoundAtActorLocation(struct USoundBase* SoundBase); // Function Tiger.TigerCharacter.Multicast_PlaySoundAtActorLocation // (Net|Native|Event|NetMulticast|Public) // @ game+0x14035a0
	void Multicast_PlayAnimationBroadcastUnreliable(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_PlayAnimationBroadcastUnreliable // (Net|Native|Event|NetMulticast|Public) // @ game+0x14034d0
	void Multicast_PlayAnimationBroadcast(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_PlayAnimationBroadcast // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1403400
	void Multicast_OnJumped(int32_t InJumpCount); // Function Tiger.TigerCharacter.Multicast_OnJumped // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1403370
	void Multicast_ApplyEffectWithTarget(struct UTigerCharacterEffect* Effect, struct ATigerCharacter* Target); // Function Tiger.TigerCharacter.Multicast_ApplyEffectWithTarget // (Net|Native|Event|NetMulticast|Protected) // @ game+0x14032a0
	void Multicast_ApplyEffectWithSocket(struct UTigerCharacterEffect* Effect, struct FName SocketName); // Function Tiger.TigerCharacter.Multicast_ApplyEffectWithSocket // (Net|Native|Event|NetMulticast|Protected) // @ game+0x14031d0
	void Multicast_ApplyEffect(struct UTigerCharacterEffect* Effect); // Function Tiger.TigerCharacter.Multicast_ApplyEffect // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1403140
	void Multicast_AbortAnimationBroadcastUnreliable(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_AbortAnimationBroadcastUnreliable // (Net|Native|Event|NetMulticast|Public) // @ game+0x1403070
	void Multicast_AbortAnimationBroadcast(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_AbortAnimationBroadcast // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1402fa0
	void LocalApplyEffectWithTarget(struct UTigerCharacterEffect* Effect, struct ATigerCharacter* Target); // Function Tiger.TigerCharacter.LocalApplyEffectWithTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1402ed0
	void LocalApplyEffectWithSocket(struct UTigerCharacterEffect* Effect, struct FName SocketName); // Function Tiger.TigerCharacter.LocalApplyEffectWithSocket // (Final|Native|Public|BlueprintCallable) // @ game+0x1402e00
	void LocalApplyEffect(struct UTigerCharacterEffect* Effect); // Function Tiger.TigerCharacter.LocalApplyEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1402d70
	bool IsSprinting(); // Function Tiger.TigerCharacter.IsSprinting // (Final|Native|Public|BlueprintCallable) // @ game+0x1402d40
	bool IsSimulatedProxy(); // Function Tiger.TigerCharacter.IsSimulatedProxy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402d10
	bool IsPlayingAnimationMontage(); // Function Tiger.TigerCharacter.IsPlayingAnimationMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402ce0
	bool IsInvulnerable(); // Function Tiger.TigerCharacter.IsInvulnerable // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402cb0
	bool IsInJump(); // Function Tiger.TigerCharacter.IsInJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402c80
	bool IsInAir(); // Function Tiger.TigerCharacter.IsInAir // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402c50
	bool IsFriendlyWith(struct ATigerCharacter* OtherCharacter); // Function Tiger.TigerCharacter.IsFriendlyWith // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402bb0
	bool IsDowned(); // Function Tiger.TigerCharacter.IsDowned // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402b80
	bool IsDead(); // Function Tiger.TigerCharacter.IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402b60
	bool IsClimbing(); // Function Tiger.TigerCharacter.IsClimbing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402b30
	bool IsCharacterVisible(); // Function Tiger.TigerCharacter.IsCharacterVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402b10
	bool IsBelowLowHealthThreshold(float InHealthOffset); // Function Tiger.TigerCharacter.IsBelowLowHealthThreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1402a80
	struct UTigerCharacterMovementComponent* GetTigerCharacterMovement(); // Function Tiger.TigerCharacter.GetTigerCharacterMovement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401d90
	struct UTigerAnimInstance* GetTigerAnimInstance(); // Function Tiger.TigerCharacter.GetTigerAnimInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401d60
	float GetSmoothYaw(); // Function Tiger.TigerCharacter.GetSmoothYaw // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401d30
	bool GetShieldFull(); // Function Tiger.TigerCharacter.GetShieldFull // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401d00
	struct FTigerReplicatedCharacterStats GetReplicatedStats(); // Function Tiger.TigerCharacter.GetReplicatedStats // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401cc0
	enum class ETigerHostilityStatus GetPlayerHostilityStatus(struct ATigerCharacter* InOtherCharacter); // Function Tiger.TigerCharacter.GetPlayerHostilityStatus // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401c20
	struct FTigerNonReplicatedCharacterStats GetNonReplicatedStats(); // Function Tiger.TigerCharacter.GetNonReplicatedStats // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401ba0
	float GetMaxShield(); // Function Tiger.TigerCharacter.GetMaxShield // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401b70
	float GetMaxHealth(); // Function Tiger.TigerCharacter.GetMaxHealth // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401b30
	float GetHeartVisibility(); // Function Tiger.TigerCharacter.GetHeartVisibility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401b10
	float GetCurrentShield(); // Function Tiger.TigerCharacter.GetCurrentShield // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401ae0
	float GetCurrentHealthPercentage(); // Function Tiger.TigerCharacter.GetCurrentHealthPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401ab0
	float GetCurrentHealth(); // Function Tiger.TigerCharacter.GetCurrentHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401a80
	float GetBaseMaxHealth(); // Function Tiger.TigerCharacter.GetBaseMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401a50
	enum class ETigerCharacterAkAlignmentType GetAkCharacterAlignment(); // Function Tiger.TigerCharacter.GetAkCharacterAlignment // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1401a20
	struct FRotator GetAimRotation(); // Function Tiger.TigerCharacter.GetAimRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x14019e0
	float GetAimAnglePitch(); // Function Tiger.TigerCharacter.GetAimAnglePitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14019b0
	float ChangeHealth(float InHealAmount, struct ATigerCharacter* InInstigator, bool bInOnlyHealRecentDamage); // Function Tiger.TigerCharacter.ChangeHealth // (Native|Public|BlueprintCallable) // @ game+0x1401890
	void CalculateCharacterStats(struct FTigerCharacterStatModification& AccumulatedStats); // Function Tiger.TigerCharacter.CalculateCharacterStats // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x14017f0
	void AuthorityApplyEffectWithTarget(struct UTigerCharacterEffect* Effect, struct ATigerCharacter* Target); // Function Tiger.TigerCharacter.AuthorityApplyEffectWithTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1401720
	void AuthorityApplyEffectWithSocket(struct UTigerCharacterEffect* Effect, struct FName SocketName); // Function Tiger.TigerCharacter.AuthorityApplyEffectWithSocket // (Final|Native|Public|BlueprintCallable) // @ game+0x1401650
	void AuthorityApplyEffect(struct UTigerCharacterEffect* Effect); // Function Tiger.TigerCharacter.AuthorityApplyEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x14015c0
	void AbortAnimationByName(struct FName InAnimationMontageName, float InBlendOutTime, bool bInStopAllIfNullMontage); // Function Tiger.TigerCharacter.AbortAnimationByName // (Final|Native|Public|BlueprintCallable) // @ game+0x14014a0
	void AbortAnimation(struct UAnimMontage* InAnimationMontage, float InBlendOutTime, bool bInStopAllIfNullMontage); // Function Tiger.TigerCharacter.AbortAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x1401380
};

// Class Tiger.TigerBaseNPC
// Size: 0x9c0 (Inherited: 0x860)
struct ATigerBaseNPC : ATigerCharacter {
	char pad_860[0x10]; // 0x860(0x10)
	struct UTigerHSensesTargetComponent* HeightenedSensesTargetComponent; // 0x870(0x08)
	struct UTigerNPCAsset* NPCAsset; // 0x878(0x08)
	struct UTigerBloodPotencyComponent* BloodPotencyComponent; // 0x880(0x08)
	struct UTigerNPCVisualAsset* VisualAsset; // 0x888(0x08)
	struct UTigerNpcPropAsset* PropAsset; // 0x890(0x08)
	struct UTigerMasqueradeActionResponse* MasqueradeActionResponse; // 0x898(0x08)
	struct UTigerNPCFacePoseMap* HeadMeshsPoseAssetsClass; // 0x8a0(0x08)
	enum class ETigerNPCType NPCType; // 0x8a8(0x01)
	char pad_8A9[0x7]; // 0x8a9(0x07)
	struct UTigerInteractiveNpcComponent* InteractiveNpcComponent; // 0x8b0(0x08)
	struct FTigerMeshCollection ReplicatedMeshCollection; // 0x8b8(0x30)
	struct UObject* ReplicatedAnimationInstanceClass; // 0x8e8(0x08)
	struct ATigerAISplinePath* ActiveSplinePath; // 0x8f0(0x08)
	struct ATigerNPCSpawningBase* Spawner; // 0x8f8(0x08)
	struct USkeletalMeshComponentBudgeted* HeightenedSensesHeartMesh; // 0x900(0x08)
	struct USkeletalMeshComponentBudgeted* InWorldHeartMesh; // 0x908(0x08)
	float LastTimeReactingToLocalPlayerAction; // 0x910(0x04)
	int32_t LastPlayedVoEventId; // 0x914(0x04)
	bool bHasSightOfLocalPlayer; // 0x918(0x01)
	char pad_919[0x7]; // 0x919(0x07)
	enum class ETigerBloodType BloodType; // 0x920(0x01)
	enum class ETigerBloodPotency BloodPotency; // 0x921(0x01)
	char pad_922[0x6]; // 0x922(0x06)
	struct TArray<struct ATigerAISplinePath*> StoredSplines; // 0x928(0x10)
	struct ATigerWorldCompositionGrid* StreamingGrid; // 0x938(0x08)
	char pad_940[0x80]; // 0x940(0x80)

	void QueueVoEvent(struct FName& InVoCategory, bool bInShouldMulticast); // Function Tiger.TigerBaseNPC.QueueVoEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13e7f70
	void PickHeartMeshes(); // Function Tiger.TigerBaseNPC.PickHeartMeshes // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OverrideBloodPotency(enum class ETigerBloodPotency InNewBloodPotency); // Function Tiger.TigerBaseNPC.OverrideBloodPotency // (Final|Native|Public|BlueprintCallable) // @ game+0x13e7590
	void OnStoppedBeingClosestNpcWithPotencyInHeightenedSenses(); // Function Tiger.TigerBaseNPC.OnStoppedBeingClosestNpcWithPotencyInHeightenedSenses // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnSawLocalPlayerBreachMasquerade(); // Function Tiger.TigerBaseNPC.OnSawLocalPlayerBreachMasquerade // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnRep_ReplicatedAnimationInstanceClassChanged(); // Function Tiger.TigerBaseNPC.OnRep_ReplicatedAnimationInstanceClassChanged // (Final|Native|Protected) // @ game+0x13e7f50
	void OnRep_BloodType(); // Function Tiger.TigerBaseNPC.OnRep_BloodType // (Final|Native|Protected) // @ game+0x13e7f10
	void OnRep_BloodPotency(); // Function Tiger.TigerBaseNPC.OnRep_BloodPotency // (Final|Native|Protected) // @ game+0x13e7ed0
	void OnRep_AdditionalMeshCollectionChanged(); // Function Tiger.TigerBaseNPC.OnRep_AdditionalMeshCollectionChanged // (Final|Native|Protected) // @ game+0x13e7eb0
	void OnLostSightOfLocalPlayer(struct ATigerPlayer* InPlayer); // Function Tiger.TigerBaseNPC.OnLostSightOfLocalPlayer // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnGainedSightOfLocalPlayer(struct ATigerPlayer* InPlayer); // Function Tiger.TigerBaseNPC.OnGainedSightOfLocalPlayer // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnBloodTypeChanged(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBaseNPC.OnBloodTypeChanged // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnBloodPotencyChanged(enum class ETigerBloodPotency InBloodPotency); // Function Tiger.TigerBaseNPC.OnBloodPotencyChanged // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnBecameClosestNpcWithPotencyInHeightenedSenses(); // Function Tiger.TigerBaseNPC.OnBecameClosestNpcWithPotencyInHeightenedSenses // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void Multicast_VerifySimulationLocation(struct FVector InAuthorityLocation); // Function Tiger.TigerBaseNPC.Multicast_VerifySimulationLocation // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x13e7ce0
	void Multicast_QueueVoEvent(int8_t InVoCategoryIndex); // Function Tiger.TigerBaseNPC.Multicast_QueueVoEvent // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x13e7c60
	void Multicast_ChangeBlood(enum class ETigerBloodPotency InNewBloodPotency, enum class ETigerBloodType InNewBloodType); // Function Tiger.TigerBaseNPC.Multicast_ChangeBlood // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x13e7b90
	struct ATigerAiBaseController* GetTigerAiBaseController(); // Function Tiger.TigerBaseNPC.GetTigerAiBaseController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7a90
	enum class ETigerBloodType GetBloodType(); // Function Tiger.TigerBaseNPC.GetBloodType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e77f0
	enum class ETigerBloodPotency GetBloodPotency(); // Function Tiger.TigerBaseNPC.GetBloodPotency // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e77d0
	void DeactivateHeightenedSensesVisualization(); // Function Tiger.TigerBaseNPC.DeactivateHeightenedSensesVisualization // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e7790
	void AuthoritySetBloodType(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBaseNPC.AuthoritySetBloodType // (Final|Native|Public|BlueprintCallable) // @ game+0x13e7610
	void AuthoritySetBloodPotency(enum class ETigerBloodPotency InNewBloodPotency); // Function Tiger.TigerBaseNPC.AuthoritySetBloodPotency // (Final|Native|Public|BlueprintCallable) // @ game+0x13e7590
	void AuthoritySetBlood(enum class ETigerBloodPotency InNewBloodPotency, enum class ETigerBloodType InNewBloodType); // Function Tiger.TigerBaseNPC.AuthoritySetBlood // (Final|Native|Public|BlueprintCallable) // @ game+0x13e74c0
	void ActivateHeightenedSensesVisualization(); // Function Tiger.TigerBaseNPC.ActivateHeightenedSensesVisualization // (Final|Native|Protected|BlueprintCallable) // @ game+0x13e7480
};

// Class Tiger.TigerBaseThrallData
// Size: 0xc8 (Inherited: 0x30)
struct UTigerBaseThrallData : UDataAsset {
	enum class ETigerThrallId ThrallId; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FText ThrallName; // 0x38(0x18)
	struct FText ThrallDescription; // 0x50(0x18)
	struct FText ThrallHintText; // 0x68(0x18)
	struct TArray<struct UTexture2D*> ThrallPortraits; // 0x80(0x10)
	struct FText ThrallKeepsakeName; // 0x90(0x18)
	struct UTexture2D* ThrallKeepsakePortrait; // 0xa8(0x08)
	struct FTigerThrallStats StartingStats; // 0xb0(0x10)
	struct UTigerGrimoireEntry* GrimoireEntry; // 0xc0(0x08)
};

// Class Tiger.TigerBattlepassUI
// Size: 0x3f0 (Inherited: 0x3c0)
struct UTigerBattlepassUI : UTigerSceneBackgroundUI {
	int32_t MaxPageItems; // 0x3c0(0x04)
	char pad_3C4[0x4]; // 0x3c4(0x04)
	struct TArray<int32_t> PageSizes; // 0x3c8(0x10)
	int32_t CurrentPageIndex; // 0x3d8(0x04)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct TArray<struct UTigerClientSeasonalRewardTier*> RewardTiers; // 0x3e0(0x10)

	void GetPageItemIndices(int32_t PageIndex, int32_t& FirstItemIndex, int32_t& LastItemIndex); // Function Tiger.TigerBattlepassUI.GetPageItemIndices // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7970
};

// Class Tiger.TigerBelowBalconyEntryTrigger
// Size: 0x268 (Inherited: 0x260)
struct ATigerBelowBalconyEntryTrigger : ATriggerVolume {
	struct FName EnterBalconyFromBelowAnimName; // 0x260(0x08)
};

// Class Tiger.TigerBlindingBeautyEffectActor
// Size: 0x238 (Inherited: 0x228)
struct ATigerBlindingBeautyEffectActor : AActor {
	struct ATigerPlayer* Player; // 0x228(0x08)
	float TriggerTime; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)

	void OnDashExit(bool bInShouldTrigger); // Function Tiger.TigerBlindingBeautyEffectActor.OnDashExit // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnDashEnter(); // Function Tiger.TigerBlindingBeautyEffectActor.OnDashEnter // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerBloodDecalTrail
// Size: 0x230 (Inherited: 0x228)
struct ATigerBloodDecalTrail : AActor {
	char pad_228[0x8]; // 0x228(0x08)
};

// Class Tiger.TigerBloodPotencyVisualizationConfig
// Size: 0x80 (Inherited: 0x30)
struct UTigerBloodPotencyVisualizationConfig : UDataAsset {
	struct TArray<struct UMaterialInstance*> HeartMeshMaterialTarget; // 0x30(0x10)
	struct TSoftObjectPtr<UNiagaraSystem> NiagaraPath; // 0x40(0x28)
	struct UParticleSystem* ParticleSystem; // 0x68(0x08)
	struct FName ParticleSystemAttachmentSocket; // 0x70(0x08)
	bool bParticleSystemAbsoluteRotation; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Tiger.TigerBloodPotencyComponent
// Size: 0x230 (Inherited: 0xb0)
struct UTigerBloodPotencyComponent : UActorComponent {
	float BloodTypeWeights[0x5]; // 0xb0(0x14)
	bool bEnableBloodTypeEffects; // 0xc4(0x01)
	bool bVisualizeBloodTypeNone; // 0xc5(0x01)
	char pad_C6[0x2]; // 0xc6(0x02)
	struct UTigerBloodPotencyVisualizationConfig* CurrentHeightenedSensesConfig; // 0xc8(0x08)
	struct UTigerBloodPotencyVisualizationConfig* CurrentInWorldConfig; // 0xd0(0x08)
	struct UTigerBloodPotencyVisualizationConfig* HeightenedSensesVisualConfiguration[0x4]; // 0xd8(0x20)
	struct UTigerBloodPotencyVisualizationConfig* HeightenedSensesVisualConfigurationByBloodType[0x5]; // 0xf8(0x28)
	struct UTigerBloodPotencyVisualizationConfig* InWorldVisualConfiguration[0x4]; // 0x120(0x20)
	struct UTigerBloodPotencyVisualizationConfig* InWorldVisualConfigurationByBloodType[0x5]; // 0x140(0x28)
	struct FName HeartMeshMaximumVisibilityDistanceName; // 0x168(0x08)
	struct TArray<struct UMaterialInstance*> HsMeshPreviousMaterials; // 0x170(0x10)
	struct TArray<struct UMaterialInstance*> HsMeshTargetMaterials; // 0x180(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> HsMeshCurrentMaterials; // 0x190(0x10)
	struct USkeletalMeshComponent* HsSkeletalMeshComponent; // 0x1a0(0x08)
	struct UParticleSystemComponent* HsParticleSystemComponent; // 0x1a8(0x08)
	struct UNiagaraComponent* HsNiagaraComponent; // 0x1b0(0x08)
	struct TArray<struct UMaterialInstance*> InWorldMeshPreviousMaterials; // 0x1b8(0x10)
	struct TArray<struct UMaterialInstance*> InWorldMeshTargetMaterials; // 0x1c8(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> InWorldMeshCurrentMaterials; // 0x1d8(0x10)
	struct USkeletalMeshComponent* InWorldSkeletalMeshComponent; // 0x1e8(0x08)
	struct UParticleSystemComponent* InWorldParticleSystemComponent; // 0x1f0(0x08)
	struct UNiagaraComponent* InWorldNiagaraComponent; // 0x1f8(0x08)
	struct ATigerBaseNPC* NpcOwner; // 0x200(0x08)
	char pad_208[0x10]; // 0x208(0x10)
	float MaterialInterpolationDuration; // 0x218(0x04)
	char pad_21C[0x14]; // 0x21c(0x14)

	void RefreshBloodPotencyVisualization(bool bInForceRefresh); // Function Tiger.TigerBloodPotencyComponent.RefreshBloodPotencyVisualization // (Final|Native|Public|BlueprintCallable) // @ game+0x13e8050
};

// Class Tiger.TigerBloodResonanceAsset
// Size: 0x1f8 (Inherited: 0x30)
struct UTigerBloodResonanceAsset : UDataAsset {
	struct FText ResonanceName; // 0x30(0x18)
	struct FText InventoryLevel1Description; // 0x48(0x18)
	struct FText InventoryLevel2Description; // 0x60(0x18)
	struct FText InventoryLevel3Description; // 0x78(0x18)
	struct FText FeedRewardLevel1Description; // 0x90(0x18)
	struct FText FeedRewardLevel2Description; // 0xa8(0x18)
	struct FText FeedRewardLevel3Description; // 0xc0(0x18)
	struct FColor ResonanceColor; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TSoftObjectPtr<UTexture2D> ResonanceLevel1; // 0xe0(0x28)
	struct TSoftObjectPtr<UTexture2D> ResonanceLevel2; // 0x108(0x28)
	struct TSoftObjectPtr<UTexture2D> ResonanceLevel3; // 0x130(0x28)
	struct TSoftObjectPtr<UTexture2D> SlotLevel1; // 0x158(0x28)
	struct TSoftObjectPtr<UTexture2D> SlotLevel2; // 0x180(0x28)
	struct TSoftObjectPtr<UTexture2D> SlotLevel3; // 0x1a8(0x28)
	struct TSoftObjectPtr<UMaterial> ResonanceVfx; // 0x1d0(0x28)
};

// Class Tiger.TigerBloodResonanceComponent
// Size: 0x200 (Inherited: 0xb0)
struct UTigerBloodResonanceComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBloodResonanceBlockedByCap; // 0xb0(0x10)
	float BloodCapIncreasePerEvent[0x20]; // 0xc0(0x80)
	struct FTigerBloodResonanceBuffs BloodResonanceBuffs[0x4]; // 0x140(0x40)
	int32_t StartingBloodCap; // 0x180(0x04)
	int32_t StartingBloodCapIncreaseGameMode; // 0x184(0x04)
	int32_t BloodTypeCap; // 0x188(0x04)
	int32_t MaxBloodCap; // 0x18c(0x04)
	int32_t CurrentBloodCap; // 0x190(0x04)
	char pad_194[0x4]; // 0x194(0x04)
	struct FMulticastInlineDelegate OnBloodCapChanged; // 0x198(0x10)
	struct FMulticastInlineDelegate OnBloodResonanceAdded; // 0x1a8(0x10)
	struct TArray<enum class ETigerBloodType> CurrentBloodResonance; // 0x1b8(0x10)
	int32_t BloodResonanceLevels[0x4]; // 0x1c8(0x10)
	int32_t OldBloodResonanceLevels[0x4]; // 0x1d8(0x10)
	char pad_1E8[0x10]; // 0x1e8(0x10)
	float CurrentBloodSlotsIncrease; // 0x1f8(0x04)
	char pad_1FC[0x4]; // 0x1fc(0x04)

	void OnRep_CurrentBloodCap(); // Function Tiger.TigerBloodResonanceComponent.OnRep_CurrentBloodCap // (Final|Native|Private) // @ game+0x13e7f30
	void OnRep_BloodResonanceLevels(); // Function Tiger.TigerBloodResonanceComponent.OnRep_BloodResonanceLevels // (Final|Native|Private) // @ game+0x13e7ef0
	void OnPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerBloodResonanceComponent.OnPlayerEvent // (Final|Native|Private) // @ game+0x13e7de0
	void OnLifeStatusChanged(enum class ETigerPlayerLifeStatus InNewLifeStatus); // Function Tiger.TigerBloodResonanceComponent.OnLifeStatusChanged // (Final|Native|Private) // @ game+0x13e7d60
	int32_t GetTotalBloodResonanceNum(); // Function Tiger.TigerBloodResonanceComponent.GetTotalBloodResonanceNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7ac0
	int32_t GetMaxBloodCap(); // Function Tiger.TigerBloodResonanceComponent.GetMaxBloodCap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7950
	int32_t GetCurrentBloodResonanceOfType(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBloodResonanceComponent.GetCurrentBloodResonanceOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e78c0
	struct TArray<enum class ETigerBloodType> GetCurrentBloodResonance(); // Function Tiger.TigerBloodResonanceComponent.GetCurrentBloodResonance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7830
	int32_t GetCurrentBloodCap(); // Function Tiger.TigerBloodResonanceComponent.GetCurrentBloodCap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13e7810
	void Client_AddBloodResonance(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBloodResonanceComponent.Client_AddBloodResonance // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x13e7710
	void BlueprintServerAddBloodResonance(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBloodResonanceComponent.BlueprintServerAddBloodResonance // (Final|Native|Public|BlueprintCallable) // @ game+0x13e7690
	void AddGameModeStartingBloodResonances(); // Function Tiger.TigerBloodResonanceComponent.AddGameModeStartingBloodResonances // (Final|Native|Private) // @ game+0x13e74a0
};

// Class Tiger.TigerBloodVein
// Size: 0x278 (Inherited: 0x228)
struct ATigerBloodVein : AActor {
	struct FMulticastInlineDelegate OnEndOfVeinReached; // 0x228(0x10)
	struct USplineComponent* Spline; // 0x238(0x08)
	struct USceneComponent* CurrentPlayerSpot; // 0x240(0x08)
	float EarliestDisconnectPoint; // 0x248(0x04)
	float LatestDisconnectPoint; // 0x24c(0x04)
	float VeinMovementSpeed; // 0x250(0x04)
	bool bIsVeinActive; // 0x254(0x01)
	char pad_255[0x3]; // 0x255(0x03)
	struct ATigerHolyIncense* HolyIncense; // 0x258(0x08)
	char pad_260[0xc]; // 0x260(0x0c)
	float StartSynchronizedTime; // 0x26c(0x04)
	char pad_270[0x8]; // 0x270(0x08)

	void TigerOnEndOfVeinReached__DelegateSignature(); // DelegateFunction Tiger.TigerBloodVein.TigerOnEndOfVeinReached__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void OnVeinActivated(); // Function Tiger.TigerBloodVein.OnVeinActivated // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnRep_IsVeinActive(); // Function Tiger.TigerBloodVein.OnRep_IsVeinActive // (Final|Native|Private) // @ game+0x13ecc00
	void Multicast_StartMovement(float ServerTime); // Function Tiger.TigerBloodVein.Multicast_StartMovement // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x13ecb50
	void MatchStateChanged(enum class ETigerMatchState OldMatchState, enum class ETigerMatchState NewMatchState); // Function Tiger.TigerBloodVein.MatchStateChanged // (Final|Native|Private) // @ game+0x13ec830
	struct FVector GetCurrentPlayerLocation(); // Function Tiger.TigerBloodVein.GetCurrentPlayerLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec560
	struct FVector GetCurrentPlayerDirection(); // Function Tiger.TigerBloodVein.GetCurrentPlayerDirection // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec520
};

// Class Tiger.TigerBloodVeinTrackWidget
// Size: 0x280 (Inherited: 0x280)
struct UTigerBloodVeinTrackWidget : UTigerWidget {
};

// Class Tiger.TigerBlueprintLootComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UTigerBlueprintLootComponent : UActorComponent {
	struct UTigerItemLootTable* LootTable; // 0xb0(0x08)
	struct TArray<struct AActor*> SpawnedItemActors; // 0xb8(0x10)

	struct TArray<struct AActor*> GetSpawnedItemActors(); // Function Tiger.TigerBlueprintLootComponent.GetSpawnedItemActors // (Final|Native|Public|Const) // @ game+0x13ec610
	struct UTigerItemLootTable* GetLootTable(); // Function Tiger.TigerBlueprintLootComponent.GetLootTable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec5c0
};

// Class Tiger.TigerBlueprintLootLocationComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UTigerBlueprintLootLocationComponent : UActorComponent {
	struct UTigerLootLocationConfiguration* Configuration; // 0xb0(0x08)
	char GameTypeFilter; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
};

// Class Tiger.TigerBootGameMode
// Size: 0x2e8 (Inherited: 0x2c8)
struct ATigerBootGameMode : AGameModeBase {
	enum class ESessionType SessionTraveledFrom; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct UTigerGameFlowStateMap* GameFlowStateMap; // 0x2d0(0x08)
	struct UTigerGameFlowStateMap* BotGameFlowStateMap; // 0x2d8(0x08)
	struct UTigerLegalDocuments* LegalDocumentsObj; // 0x2e0(0x08)

	struct UTigerLegalDocuments* GetLegalDocuments(); // Function Tiger.TigerBootGameMode.GetLegalDocuments // (Final|Native|Public|BlueprintCallable) // @ game+0x13ec5a0
};

// Class Tiger.TigerGameState
// Size: 0x390 (Inherited: 0x278)
struct ATigerGameState : AGameStateBase {
	struct FMulticastInlineDelegate OnWeatherScenarioChangedEvent; // 0x278(0x10)
	struct TArray<int32_t> FakeMatchmakingDelayGameModeIndices; // 0x288(0x10)
	char pad_298[0x20]; // 0x298(0x20)
	struct FMulticastInlineDelegate OnPrePlayerStateRemoved; // 0x2b8(0x10)
	struct FGuid MatchID; // 0x2c8(0x10)
	struct TWeakObjectPtr<struct ATigerHolyIncense> HolyIncense; // 0x2d8(0x08)
	char pad_2E0[0x4]; // 0x2e0(0x04)
	float SynchronizedTime; // 0x2e4(0x04)
	char pad_2E8[0x10]; // 0x2e8(0x10)
	struct UTigerWeatherScenarioData* WeatherScenarioClass; // 0x2f8(0x08)
	struct UTigerWeatherScenarioData* WeatherScenario; // 0x300(0x08)
	char pad_308[0x50]; // 0x308(0x50)
	struct FString ServerId; // 0x358(0x10)
	enum class ETigerServerScalabilityTarget CurrentScalabilityTarget; // 0x368(0x01)
	char pad_369[0x27]; // 0x369(0x27)

	bool UnsubscribeOnPlayerStateGameDataChanged(int32_t InPlayerId, struct FDelegate& InDelegate); // Function Tiger.TigerGameState.UnsubscribeOnPlayerStateGameDataChanged // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1457a30
	struct ATigerPlayerState* TryGetPlayerStateFromID(struct FTigerPersistentPlayerID& InID); // Function Tiger.TigerGameState.TryGetPlayerStateFromID // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x14578d0
	void TigerPrintServerScalabilityTarget(); // Function Tiger.TigerGameState.TigerPrintServerScalabilityTarget // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerDisplayServerId(); // Function Tiger.TigerGameState.TigerDisplayServerId // (Final|Exec|Native|Private) // @ game+0xb64580
	bool SubscribeOnPlayerStateGameDataChanged(int32_t InPlayerId, struct FDelegate& InDelegate); // Function Tiger.TigerGameState.SubscribeOnPlayerStateGameDataChanged // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x14577d0
	void PlayerStateRemoved__DelegateSignature(struct ATigerPlayerState* InPlayerState); // DelegateFunction Tiger.TigerGameState.PlayerStateRemoved__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void OnWeatherScenarioChanged__DelegateSignature(struct UTigerWeatherScenarioData* WeatherScenarioData); // DelegateFunction Tiger.TigerGameState.OnWeatherScenarioChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void OnRep_WeatherScenarioClass(); // Function Tiger.TigerGameState.OnRep_WeatherScenarioClass // (Final|Native|Private) // @ game+0x14572c0
	void OnRep_SynchronizedTime(); // Function Tiger.TigerGameState.OnRep_SynchronizedTime // (Final|Native|Private) // @ game+0x14572a0
	void OnRep_FakeMatchmakingDelayRemovedForGameModeIndex(); // Function Tiger.TigerGameState.OnRep_FakeMatchmakingDelayRemovedForGameModeIndex // (Final|Native|Private) // @ game+0x1457280
	void OnPlayerStateGameDataChangeDelegate__DelegateSignature(); // DelegateFunction Tiger.TigerGameState.OnPlayerStateGameDataChangeDelegate__DelegateSignature // (Public|Delegate) // @ game+0x18b4070
	void OnPlayerStateGameDataChanged__DelegateSignature(); // DelegateFunction Tiger.TigerGameState.OnPlayerStateGameDataChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void Multicast_SynchronizeTime(float InNewSynchronizedTime); // Function Tiger.TigerGameState.Multicast_SynchronizeTime // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x14571f0
	float GetSynchronizedTimeNonInterpolated(); // Function Tiger.TigerGameState.GetSynchronizedTimeNonInterpolated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1456c70
	float GetSynchronizedTime(); // Function Tiger.TigerGameState.GetSynchronizedTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1456c40
	struct FTigerPlayerStateGameData GetPlayerStateDataCopy(int32_t InPlayerId); // Function Tiger.TigerGameState.GetPlayerStateDataCopy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1456b20
	struct FGuid GetMatchId(); // Function Tiger.TigerGameState.GetMatchId // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1456aa0
};

// Class Tiger.TigerBootGameState
// Size: 0x398 (Inherited: 0x390)
struct ATigerBootGameState : ATigerGameState {
	char pad_390[0x8]; // 0x390(0x08)

	void SetBootStateToArchetypeSelect(); // Function Tiger.TigerBootGameState.SetBootStateToArchetypeSelect // (Final|Native|Public|BlueprintCallable) // @ game+0x13ece90
};

// Class Tiger.TigerPassiveConfig
// Size: 0x140 (Inherited: 0x30)
struct UTigerPassiveConfig : UDataAsset {
	struct FText Name; // 0x30(0x18)
	struct FText Description; // 0x48(0x18)
	struct FText Summary; // 0x60(0x18)
	struct UTexture2D* Icon; // 0x78(0x08)
	struct UMediaSource* PreviewVideo; // 0x80(0x08)
	struct UTigerWidget* CustomWidget; // 0x88(0x08)
	struct UTigerPassiveComponent* LogicComponent; // 0x90(0x08)
	struct FTigerCharacterStatModification PassiveStatChanges; // 0x98(0xa8)
};

// Class Tiger.TigerBrujahBaneRecklessness
// Size: 0x148 (Inherited: 0x140)
struct UTigerBrujahBaneRecklessness : UTigerPassiveConfig {
	float DamageTakenMultiplier; // 0x140(0x04)
	float AutoDeactivateTimer; // 0x144(0x04)
};

// Class Tiger.TigerPassiveComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UTigerPassiveComponent : UActorComponent {
	struct ATigerPlayer* PlayerOwner; // 0xb0(0x08)
	struct UTigerWidget* PassiveWidget; // 0xb8(0x08)
	char pad_C0[0x8]; // 0xc0(0x08)

	void SetPassiveWidget(struct UTigerWidget* InWidget); // Function Tiger.TigerPassiveComponent.SetPassiveWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x14b4760
	void OnFirstPossessed(struct ATigerPlayer* InPlayer, bool InHasAuthority); // Function Tiger.TigerPassiveComponent.OnFirstPossessed // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnCreated(struct ATigerPlayer* InPlayer, bool InHasAuthority); // Function Tiger.TigerPassiveComponent.OnCreated // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	bool IsPassiveActive(); // Function Tiger.TigerPassiveComponent.IsPassiveActive // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x14b4460
	struct UTigerWidget* GetPassiveWidget(); // Function Tiger.TigerPassiveComponent.GetPassiveWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14b3f00
};

// Class Tiger.TigerBrujahBaneRecklessnessLogic
// Size: 0x188 (Inherited: 0xc8)
struct UTigerBrujahBaneRecklessnessLogic : UTigerPassiveComponent {
	struct UTigerBrujahBaneRecklessness* Config; // 0xc8(0x08)
	struct ATigerPlayer* Player; // 0xd0(0x08)
	char pad_D8[0xb0]; // 0xd8(0xb0)
};

// Class Tiger.TigerBrujahTraitMomentum
// Size: 0x160 (Inherited: 0x140)
struct UTigerBrujahTraitMomentum : UTigerPassiveConfig {
	float MomentumActiveTimer; // 0x140(0x04)
	float GroundSlamRadiusMultiplier; // 0x144(0x04)
	float MightyLeapVelocityMultiplier; // 0x148(0x04)
	float FOTTKnockbackDistanceMultiplier; // 0x14c(0x04)
	float FOTTWallImpactDamageMultiplier; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct UAkAudioEvent* MomentumStartedAudioEvent; // 0x158(0x08)
};

// Class Tiger.TigerBrujahTraitMomentumLogic
// Size: 0xe8 (Inherited: 0xc8)
struct UTigerBrujahTraitMomentumLogic : UTigerPassiveComponent {
	struct UTigerBrujahTraitMomentum* Config; // 0xc8(0x08)
	struct ATigerPlayer* Player; // 0xd0(0x08)
	char pad_D8[0x10]; // 0xd8(0x10)

	bool IsMomentumActive(); // Function Tiger.TigerBrujahTraitMomentumLogic.IsMomentumActive // (Final|Native|Public|BlueprintCallable) // @ game+0x13ec800
};

// Class Tiger.TigerBuffAdrenalineRushInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffAdrenalineRushInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffAdrenalineRush
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffAdrenalineRush : UTigerBuff {
};

// Class Tiger.TigerBuffAnarchHuntingKnife
// Size: 0x288 (Inherited: 0x268)
struct UTigerBuffAnarchHuntingKnife : UTigerBuff {
	struct UCurveFloat* EffectStrengthBasedOnDistance; // 0x268(0x08)
	struct UCurveFloat* EffectStrengthBasedOnKills; // 0x270(0x08)
	struct UCurveFloat* DamageBasedOnEnemiesKilled; // 0x278(0x08)
	float MaxDistanceToCheckForEnemies; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
};

// Class Tiger.TigerBuffAnarchHuntingKnifeInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffAnarchHuntingKnifeInstance : UTigerBuffInstance {
	struct UTigerBuffAnarchHuntingKnife* HuntingKnifeBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffAnarchHuntingKnifeStack
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffAnarchHuntingKnifeStack : UTigerBuff {
};

// Class Tiger.TigerBuffAnarchHuntingKnifeStackInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffAnarchHuntingKnifeStackInstance : UTigerBuffInstance {
	struct ATigerPlayer* Player; // 0x88(0x08)
};

// Class Tiger.TigerBuffArtifactFeedingBonus
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffArtifactFeedingBonus : UTigerBuff {
	float FeedBonusHealthMultiplier; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
};

// Class Tiger.TigerBuffArtifactFeedingBonusInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffArtifactFeedingBonusInstance : UTigerBuffInstance {
	struct UTigerBuffArtifactFeedingBonus* ArtifactFeedingBonusBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffHealthRegenBase
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffHealthRegenBase : UTigerBuff {
	float HealthToHeal; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
};

// Class Tiger.TigerBuffArtifactHealthRegen
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffArtifactHealthRegen : UTigerBuffHealthRegenBase {
};

// Class Tiger.TigerBuffHealthRegenBaseInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffHealthRegenBaseInstance : UTigerBuffInstance {
	struct UTigerBuffHealthRegenBase* HealthRegenBuff; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerBuffArtifactHealthRegenInstance
// Size: 0x98 (Inherited: 0x98)
struct UTigerBuffArtifactHealthRegenInstance : UTigerBuffHealthRegenBaseInstance {
};

// Class Tiger.TigerBuffBlindingBeautyInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffBlindingBeautyInstance : UTigerBuffInstance {
	char pad_88[0x10]; // 0x88(0x10)
};

// Class Tiger.TigerBuffBlindingBeauty
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffBlindingBeauty : UTigerBuff {
	float BlockJumpDuration; // 0x268(0x04)
	float TurnRateCap; // 0x26c(0x04)
};

// Class Tiger.TigerBuffClanReducesCooldown
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffClanReducesCooldown : UTigerBuff {
	float AbilityCooldownReduction; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
};

// Class Tiger.TigerBuffClanReducesCooldownInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffClanReducesCooldownInstance : UTigerBuffInstance {
	struct UTigerBuffClanReducesCooldown* ClanReduceCooldownBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffClimbInterrupt
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffClimbInterrupt : UTigerBuffDisableClimbing {
};

// Class Tiger.TigerBuffClimbInterruptInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffClimbInterruptInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffComponent
// Size: 0x148 (Inherited: 0xb0)
struct UTigerBuffComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBuffAdded; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnBuffRemoved; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnBuffRefreshed; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnClientBuffIdUpdated; // 0xe0(0x10)
	bool bDrawDebugString; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct TArray<struct UTigerBuffInstance*> BuffInstances; // 0xf8(0x10)
	struct TArray<struct UTigerBuffInstance*> NonVerifiedBuffInstances; // 0x108(0x10)
	struct TArray<struct FTigerDeferredBuffInstantiation> DeferredBuffs; // 0x118(0x10)
	char pad_128[0x20]; // 0x128(0x20)

	void Server_RequestRemoveBuffIfNonExistentFor(struct ATigerCharacter* Target, struct UTigerBuff* BuffType, int32_t BuffID, struct ATigerCharacter* BuffCaster, float BuffEndTime); // Function Tiger.TigerBuffComponent.Server_RequestRemoveBuffIfNonExistentFor // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x13eccb0
	void RemoveBuffByID(int32_t BuffID); // Function Tiger.TigerBuffComponent.RemoveBuffByID // (Final|Native|Public|BlueprintCallable) // @ game+0x13ecc20
	void OnRep_BuffInstances(); // Function Tiger.TigerBuffComponent.OnRep_BuffInstances // (Final|Native|Private) // @ game+0x13ecbe0
	void Multicast_ClearBuff(int32_t BuffID); // Function Tiger.TigerBuffComponent.Multicast_ClearBuff // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x13ecac0
	void Multicast_ClearAllBuffs(); // Function Tiger.TigerBuffComponent.Multicast_ClearAllBuffs // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x13ecaa0
	void Multicast_AddBuff(struct UTigerBuff* BuffType, int32_t BuffID, struct ATigerCharacter* BuffCaster, float Length, float BuffStrength); // Function Tiger.TigerBuffComponent.Multicast_AddBuff // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x13ec900
	bool IsDisablingDisciplines(); // Function Tiger.TigerBuffComponent.IsDisablingDisciplines // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec7e0
	bool HasBuff(struct UTigerBuff* BuffType); // Function Tiger.TigerBuffComponent.HasBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec740
	float GetTimeLeft(struct UTigerBuff* BuffType); // Function Tiger.TigerBuffComponent.GetTimeLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec6a0
	struct UTigerBuffInstance* FindExistingBuffOfType(struct UTigerBuff* BuffType, struct ATigerCharacter* Caster); // Function Tiger.TigerBuffComponent.FindExistingBuffOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13ec410
	void Client_ClearBuffFor(struct ATigerCharacter* Target, int32_t BuffID); // Function Tiger.TigerBuffComponent.Client_ClearBuffFor // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x13ec270
	void Client_ClearAllBuffs(); // Function Tiger.TigerBuffComponent.Client_ClearAllBuffs // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0xd01030
	void Client_AddBuff(struct UTigerBuff* BuffType, int32_t BuffID, struct ATigerCharacter* BuffCaster, float Length, float BuffStrength); // Function Tiger.TigerBuffComponent.Client_AddBuff // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x13ec0d0
	int32_t ApplyStun(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyStun // (Final|Native|Public|BlueprintCallable) // @ game+0x13ec000
	int32_t ApplyInvulnerable(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyInvulnerable // (Final|Native|Public|BlueprintCallable) // @ game+0x13ebf30
	int32_t ApplyImmobilized(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyImmobilized // (Final|Native|Public|BlueprintCallable) // @ game+0x13ebe60
	int32_t ApplyGrounded(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyGrounded // (Final|Native|Public|BlueprintCallable) // @ game+0x13ebd90
	int32_t ApplyBuff(struct UTigerBuff* BuffType, struct ATigerCharacter* BuffCaster, float OverrideLength, float OverrideBuffStrength, bool bDoLagCompensation); // Function Tiger.TigerBuffComponent.ApplyBuff // (Final|Native|Public|BlueprintCallable) // @ game+0x13ebbf0
};

// Class Tiger.TigerBuffDisciplineVentrueClanInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffDisciplineVentrueClanInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffDisciplineVentrueClan
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffDisciplineVentrueClan : UTigerBuff {
};

// Class Tiger.TigerBuffDOT
// Size: 0x278 (Inherited: 0x268)
struct UTigerBuffDOT : UTigerBuff {
	struct UDamageType* DamageType; // 0x268(0x08)
	float DamagePerTick; // 0x270(0x04)
	bool bPlayHitAnimation; // 0x274(0x01)
	bool bSpawnBloodDecals; // 0x275(0x01)
	bool bUseCasterAsInstigator; // 0x276(0x01)
	char pad_277[0x1]; // 0x277(0x01)
};

// Class Tiger.TigerBuffDOTInstance
// Size: 0xa0 (Inherited: 0x88)
struct UTigerBuffDOTInstance : UTigerBuffInstance {
	struct UTigerBuffDOT* BuffDOT; // 0x88(0x08)
	char pad_90[0x10]; // 0x90(0x10)
};

// Class Tiger.TigerBufferedAction
// Size: 0x48 (Inherited: 0x28)
struct UTigerBufferedAction : UObject {
	struct ATigerPlayerController* OwnerPlayerController; // 0x28(0x08)
	struct UTigerActionBuffer* OwnerActionBuffer; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
};

// Class Tiger.TigerBufferedActionQuickAttack
// Size: 0x48 (Inherited: 0x48)
struct UTigerBufferedActionQuickAttack : UTigerBufferedAction {
};

// Class Tiger.TigerBuffExtraArtifacts
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffExtraArtifacts : UTigerBuff {
};

// Class Tiger.TigerBuffExtraArtifactsInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffExtraArtifactsInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffFOTTChargeup
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffFOTTChargeup : UTigerBuff {
};

// Class Tiger.TigerBuffFOTTChargeupInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffFOTTChargeupInstance : UTigerBuffInstance {
	struct UTigerBuffFOTTChargeup* FOTTChargeupBuff; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerBuffFOTTKnockbackWallStun
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffFOTTKnockbackWallStun : UTigerBuff {
	float WallStunnedTimer; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
};

// Class Tiger.TigerBuffFOTTKnockbackWallStunInstance
// Size: 0xa0 (Inherited: 0x88)
struct UTigerBuffFOTTKnockbackWallStunInstance : UTigerBuffInstance {
	struct UTigerBuffFOTTKnockbackWallStun* FOTTKnockbackWallStun; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
	struct ATigerCharacter* Target; // 0x98(0x08)
};

// Class Tiger.TigerBuffFrenzy
// Size: 0x278 (Inherited: 0x268)
struct UTigerBuffFrenzy : UTigerBuff {
	float HPRegenPercentPerSecond; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UTigerWeapon* WeaponClassToEquip; // 0x270(0x08)
};

// Class Tiger.TigerBuffFrenzyInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffFrenzyInstance : UTigerBuffInstance {
	struct UTigerBuffFrenzy* FrenzyBuff; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerBuffInAirMomentumLossInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffInAirMomentumLossInstance : UTigerBuffInstance {
	char pad_88[0x10]; // 0x88(0x10)

	void OnLandedDelegate(struct FHitResult& InHit); // Function Tiger.TigerBuffInAirMomentumLossInstance.OnLandedDelegate // (Final|Native|Public|HasOutParms) // @ game+0x13f2f50
};

// Class Tiger.TigerBuffInAirMomentumLoss
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffInAirMomentumLoss : UTigerBuff {
	float MinimumHorizontalSpeed; // 0x268(0x04)
	float TimeToDecelerate; // 0x26c(0x04)
};

// Class Tiger.TigerBuffKindredCharmInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffKindredCharmInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffKindredCharm
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffKindredCharm : UTigerBuff {
};

// Class Tiger.TigerBuffMasqueradeKeepingMovement
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffMasqueradeKeepingMovement : UTigerBuff {
};

// Class Tiger.TigerBuffMasqueradeKeepingMovementInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffMasqueradeKeepingMovementInstance : UTigerBuffInstance {
	char pad_88[0x8]; // 0x88(0x08)
};

// Class Tiger.TigerBuffMeleeCharge
// Size: 0x278 (Inherited: 0x268)
struct UTigerBuffMeleeCharge : UTigerBuff {
	float TimeRunningBeforeBuffIsActive; // 0x268(0x04)
	float MaxDeviationAllowedInDegrees; // 0x26c(0x04)
	struct UTigerBuff* AttackBuff; // 0x270(0x08)
};

// Class Tiger.TigerBuffMeleeChargeInstance
// Size: 0xb0 (Inherited: 0x88)
struct UTigerBuffMeleeChargeInstance : UTigerBuffInstance {
	struct UTigerBuffMeleeCharge* MeleeChargeBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
	char pad_98[0x18]; // 0x98(0x18)
};

// Class Tiger.TigerBuffMeleeChargeAttack
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffMeleeChargeAttack : UTigerBuff {
	struct UParticleSystem* AttackParticleEffect; // 0x268(0x08)
};

// Class Tiger.TigerBuffMeleeChargeAttackInstance
// Size: 0xa8 (Inherited: 0x88)
struct UTigerBuffMeleeChargeAttackInstance : UTigerBuffInstance {
	struct UTigerBuffMeleeChargeAttack* MeleeChargeAttackBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
	struct UParticleSystemComponent* ActiveAttackParticles; // 0x98(0x08)
	char pad_A0[0x8]; // 0xa0(0x08)

	void SwingFinished(); // Function Tiger.TigerBuffMeleeChargeAttackInstance.SwingFinished // (Final|Native|Private) // @ game+0x13f30c0
};

// Class Tiger.TigerBuffApathy
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffApathy : UTigerBuff {
};

// Class Tiger.TigerBuffApathyInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffApathyInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffWrath
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffWrath : UTigerBuff {
};

// Class Tiger.TigerBuffWrathInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffWrathInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffPostProcess
// Size: 0x238 (Inherited: 0x228)
struct ATigerBuffPostProcess : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct UPostProcessComponent* PostProcess; // 0x230(0x08)
};

// Class Tiger.TigerBuffPreventMasqueradeBreak
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffPreventMasqueradeBreak : UTigerBuff {
	struct UAkAudioEvent* ArtifactBreakAudioEvent; // 0x268(0x08)
};

// Class Tiger.TigerBuffPreventMasqueradeBreakInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffPreventMasqueradeBreakInstance : UTigerBuffInstance {
	struct UTigerBuffPreventMasqueradeBreak* PreventMasqueradeBreakBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffRejuvenatingVoiceInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffRejuvenatingVoiceInstance : UTigerBuffInstance {
	char pad_88[0x8]; // 0x88(0x08)
};

// Class Tiger.TigerBuffRejuvenatingVoice
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffRejuvenatingVoice : UTigerBuff {

	void OnHealStop(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuffRejuvenatingVoice.OnHealStop // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnHealStart(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuffRejuvenatingVoice.OnHealStart // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerBuffRespawnGhost
// Size: 0x278 (Inherited: 0x268)
struct UTigerBuffRespawnGhost : UTigerBuff {
	struct UMaterialInterface* GhostMaterial; // 0x268(0x08)
	struct UTigerBuffRespawnGhostInstance* BuffInstanceClass; // 0x270(0x08)
};

// Class Tiger.TigerBuffRespawnGhostInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffRespawnGhostInstance : UTigerBuffInstance {

	void OnDeactivatedBP(struct ATigerPlayer* InTigerPlayer); // Function Tiger.TigerBuffRespawnGhostInstance.OnDeactivatedBP // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnActivatedBP(struct ATigerPlayer* InTigerPlayer); // Function Tiger.TigerBuffRespawnGhostInstance.OnActivatedBP // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerBuffShackles
// Size: 0x280 (Inherited: 0x268)
struct UTigerBuffShackles : UTigerBuff {
	struct UTigerCharacterEffect* ActiveEffect; // 0x268(0x08)
	struct FName ShacklesStaggerAnimationName; // 0x270(0x08)
	float DamageToDeal; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
};

// Class Tiger.TigerBuffShacklesInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffShacklesInstance : UTigerBuffInstance {
	struct UTigerBuffShackles* ShacklesBuff; // 0x88(0x08)
};

// Class Tiger.TigerBuffShark
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffShark : UTigerBuff {
};

// Class Tiger.TigerBuffSharkInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffSharkInstance : UTigerBuffInstance {
	struct UTigerBuffShark* SharkBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffShieldBase
// Size: 0x270 (Inherited: 0x268)
struct UTigerBuffShieldBase : UTigerBuff {
	float MaxShield; // 0x268(0x04)
	float InitialShield; // 0x26c(0x04)
};

// Class Tiger.TigerBuffShieldAdrenalineRush
// Size: 0x280 (Inherited: 0x270)
struct UTigerBuffShieldAdrenalineRush : UTigerBuffShieldBase {
	float TimeBeforeDecay; // 0x270(0x04)
	float DecayPerSecond; // 0x274(0x04)
	float DamageToShieldScale; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
};

// Class Tiger.TigerBuffShieldBaseInstance
// Size: 0xa0 (Inherited: 0x88)
struct UTigerBuffShieldBaseInstance : UTigerBuffInstance {
	char pad_88[0x18]; // 0x88(0x18)
};

// Class Tiger.TigerBuffShieldAdrenalineRushInstance
// Size: 0xa8 (Inherited: 0xa0)
struct UTigerBuffShieldAdrenalineRushInstance : UTigerBuffShieldBaseInstance {
	char pad_A0[0x8]; // 0xa0(0x08)
};

// Class Tiger.TigerBuffSingleSwing
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffSingleSwing : UTigerBuff {
};

// Class Tiger.TigerBuffSingleSwingInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffSingleSwingInstance : UTigerBuffInstance {
	struct ATigerPlayer* Player; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)

	void SwingFinished(); // Function Tiger.TigerBuffSingleSwingInstance.SwingFinished // (Final|Native|Private) // @ game+0x13f30e0
};

// Class Tiger.TigerBuffStunBaton
// Size: 0x288 (Inherited: 0x268)
struct UTigerBuffStunBaton : UTigerBuff {
	float StunBonusDamage; // 0x268(0x04)
	float ChargeGainedOnHit; // 0x26c(0x04)
	float ChargeGainedPerUpdate; // 0x270(0x04)
	float PassiveChargeRate; // 0x274(0x04)
	bool bRegisterMultipleHitsOnChargeUp; // 0x278(0x01)
	bool bRegisterMultipleHitsOnStun; // 0x279(0x01)
	char pad_27A[0x6]; // 0x27a(0x06)
	struct UTigerBuffInstance* TBPInstanceBuff; // 0x280(0x08)
};

// Class Tiger.TigerBuffStunBatonInstance
// Size: 0xa8 (Inherited: 0x88)
struct UTigerBuffStunBatonInstance : UTigerBuffInstance {
	struct UTigerBuffStunBaton* StunBatonBuff; // 0x88(0x08)
	char pad_90[0x10]; // 0x90(0x10)
	struct ATigerPlayer* Player; // 0xa0(0x08)

	void TargetHitShockConsumed(struct ATigerCharacter* Target); // Function Tiger.TigerBuffStunBatonInstance.TargetHitShockConsumed // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void SwingStarted(bool bWasHeavyAttack); // Function Tiger.TigerBuffStunBatonInstance.SwingStarted // (Final|Native|Public) // @ game+0x13f3120
	void SwingFinished(); // Function Tiger.TigerBuffStunBatonInstance.SwingFinished // (Final|Native|Public) // @ game+0x13f3100
	void MaxChargeReachedEvent(); // Function Tiger.TigerBuffStunBatonInstance.MaxChargeReachedEvent // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	bool IsStunReady(); // Function Tiger.TigerBuffStunBatonInstance.IsStunReady // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f2ea0
	void HitTarget(struct ATigerCharacter* InTarget); // Function Tiger.TigerBuffStunBatonInstance.HitTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x13f2e10
	void ChargeGainedEvent(float CurrentChargeValue); // Function Tiger.TigerBuffStunBatonInstance.ChargeGainedEvent // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void AddCharge(float ValueToAdd); // Function Tiger.TigerBuffStunBatonInstance.AddCharge // (Final|Native|Public|BlueprintCallable) // @ game+0x13f2d90
};

// Class Tiger.TigerBuffThorns
// Size: 0x290 (Inherited: 0x278)
struct UTigerBuffThorns : UTigerBuffDOT {
	float HealInterval; // 0x278(0x04)
	float HealPercentage; // 0x27c(0x04)
	struct UTigerCharacterEffect* HealEffect; // 0x280(0x08)
	struct UAkAudioEvent* DOTTriggerEvent; // 0x288(0x08)
};

// Class Tiger.TigerBuffThornsInstance
// Size: 0xb0 (Inherited: 0xa0)
struct UTigerBuffThornsInstance : UTigerBuffDOTInstance {
	char pad_A0[0x8]; // 0xa0(0x08)
	struct UTigerBuffThorns* ThornsBuff; // 0xa8(0x08)
};

// Class Tiger.TigerBuffUnholyStimulant
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffUnholyStimulant : UTigerBuff {
};

// Class Tiger.TigerBuffUnholyStimulantInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffUnholyStimulantInstance : UTigerBuffInstance {

	void OnInsideHolyIncenseChanged(bool bInIsInsideHolyIncense); // Function Tiger.TigerBuffUnholyStimulantInstance.OnInsideHolyIncenseChanged // (Final|Native|Private) // @ game+0x13f2ec0
};

// Class Tiger.TigerBuffVanish
// Size: 0x288 (Inherited: 0x268)
struct UTigerBuffVanish : UTigerBuffInvisible {
	float TimeReductionPerMeterMoved; // 0x268(0x04)
	float NoiseNotifyEventRange; // 0x26c(0x04)
	struct UCurveFloat* MaterialTransitionIntoCurve; // 0x270(0x08)
	struct UCurveFloat* MaterialTransitionOutFromCurve; // 0x278(0x08)
	struct UParticleSystem* BlendOutParticles; // 0x280(0x08)
};

// Class Tiger.TigerBuffVanishInstance
// Size: 0xb0 (Inherited: 0x88)
struct UTigerBuffVanishInstance : UTigerBuffInstance {
	struct UTigerBuffVanish* VanishBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
	char pad_98[0x18]; // 0x98(0x18)
};

// Class Tiger.TigerBuffVoiceOfInspiration
// Size: 0x268 (Inherited: 0x268)
struct UTigerBuffVoiceOfInspiration : UTigerBuff {
};

// Class Tiger.TigerBuffVoiceOfInspirationInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffVoiceOfInspirationInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuildingWallPreset
// Size: 0x38 (Inherited: 0x28)
struct UTigerBuildingWallPreset : UObject {
	struct TArray<struct TSoftObjectPtr<UStaticMesh>> Meshes; // 0x28(0x10)
};

// Class Tiger.TigerBuildingSystem
// Size: 0x290 (Inherited: 0x228)
struct ATigerBuildingSystem : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct USplineComponent* SplineLeft; // 0x230(0x08)
	struct USplineComponent* SplineRight; // 0x238(0x08)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerFrontComponents; // 0x240(0x10)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerLeftComponents; // 0x250(0x10)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerBackComponents; // 0x260(0x10)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerRightComponents; // 0x270(0x10)
	struct FTigerBuildingSystemWallPieceInstancingData WallPieceInstancingDatas; // 0x280(0x10)

	void OnUpgrade(int32_t InVersion); // Function Tiger.TigerBuildingSystem.OnUpgrade // (Native|Event|Protected|BlueprintEvent) // @ game+0x13f3030
};

// Class Tiger.TigerBuildingSystemDepricated
// Size: 0x4b0 (Inherited: 0x290)
struct ATigerBuildingSystemDepricated : ATigerBuildingSystem {
	struct UHierarchicalInstancedStaticMeshComponent* Front_00; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_01; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_02; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_03; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_04; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_05; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_06; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_07; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_00; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_01; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_02; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_03; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_04; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_05; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_06; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_07; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_00; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_01; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_02; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_03; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_04; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_05; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_06; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_07; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_00; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_01; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_02; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_03; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_04; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_05; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_06; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_07; // 0x388(0x08)
	struct UStaticMeshComponent* CornerFL_00; // 0x390(0x08)
	struct UStaticMeshComponent* CornerFL_01; // 0x398(0x08)
	struct UStaticMeshComponent* CornerFL_02; // 0x3a0(0x08)
	struct UStaticMeshComponent* CornerFL_03; // 0x3a8(0x08)
	struct UStaticMeshComponent* CornerFL_04; // 0x3b0(0x08)
	struct UStaticMeshComponent* CornerFL_05; // 0x3b8(0x08)
	struct UStaticMeshComponent* CornerFL_06; // 0x3c0(0x08)
	struct UStaticMeshComponent* CornerFL_07; // 0x3c8(0x08)
	struct UStaticMeshComponent* CornerLB_00; // 0x3d0(0x08)
	struct UStaticMeshComponent* CornerLB_01; // 0x3d8(0x08)
	struct UStaticMeshComponent* CornerLB_02; // 0x3e0(0x08)
	struct UStaticMeshComponent* CornerLB_03; // 0x3e8(0x08)
	struct UStaticMeshComponent* CornerLB_04; // 0x3f0(0x08)
	struct UStaticMeshComponent* CornerLB_05; // 0x3f8(0x08)
	struct UStaticMeshComponent* CornerLB_06; // 0x400(0x08)
	struct UStaticMeshComponent* CornerLB_07; // 0x408(0x08)
	struct UStaticMeshComponent* CornerBR_00; // 0x410(0x08)
	struct UStaticMeshComponent* CornerBR_01; // 0x418(0x08)
	struct UStaticMeshComponent* CornerBR_02; // 0x420(0x08)
	struct UStaticMeshComponent* CornerBR_03; // 0x428(0x08)
	struct UStaticMeshComponent* CornerBR_04; // 0x430(0x08)
	struct UStaticMeshComponent* CornerBR_05; // 0x438(0x08)
	struct UStaticMeshComponent* CornerBR_06; // 0x440(0x08)
	struct UStaticMeshComponent* CornerBR_07; // 0x448(0x08)
	struct UStaticMeshComponent* CornerRF_00; // 0x450(0x08)
	struct UStaticMeshComponent* CornerRF_01; // 0x458(0x08)
	struct UStaticMeshComponent* CornerRF_02; // 0x460(0x08)
	struct UStaticMeshComponent* CornerRF_03; // 0x468(0x08)
	struct UStaticMeshComponent* CornerRF_04; // 0x470(0x08)
	struct UStaticMeshComponent* CornerRF_05; // 0x478(0x08)
	struct UStaticMeshComponent* CornerRF_06; // 0x480(0x08)
	struct UStaticMeshComponent* CornerRF_07; // 0x488(0x08)
	char pad_490[0x20]; // 0x490(0x20)

	void RemoveUnusedParts(); // Function Tiger.TigerBuildingSystemDepricated.RemoveUnusedParts // (Final|Native|Public|BlueprintCallable) // @ game+0x13f8510
	struct UHierarchicalInstancedStaticMeshComponent* GetFloorMeshComponent(enum class UTigerBuildingSide Side, int32_t FloorNumber); // Function Tiger.TigerBuildingSystemDepricated.GetFloorMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7360
	struct UStaticMeshComponent* GetCornerMeshComponent(enum class UTigerBuildingSide Side, int32_t FloorNumber); // Function Tiger.TigerBuildingSystemDepricated.GetCornerMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7110
	struct TArray<struct UHierarchicalInstancedStaticMeshComponent*> GetAllFloorMeshComponents(); // Function Tiger.TigerBuildingSystemDepricated.GetAllFloorMeshComponents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6bd0
	struct TArray<struct UStaticMeshComponent*> GetAllCornerMeshComponents(); // Function Tiger.TigerBuildingSystemDepricated.GetAllCornerMeshComponents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6ba0
};

// Class Tiger.TigerBuildingWallStreamingSettings
// Size: 0x40 (Inherited: 0x38)
struct UTigerBuildingWallStreamingSettings : USharkLocalDeveloperSettings {
	int32_t WallsToStreamPerFrame; // 0x38(0x04)
	bool bLoggingEnabled; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class Tiger.TigerBuildingSystemWallStreamer
// Size: 0x250 (Inherited: 0x228)
struct ATigerBuildingSystemWallStreamer : AActor {
	struct TArray<struct FTigerStreamableBuildingSides> StreamableBuildingParts; // 0x228(0x10)
	struct TArray<struct UStaticMeshComponent*> ComponentsToCreateRenderstateOn; // 0x238(0x10)
	char pad_248[0x8]; // 0x248(0x08)
};

// Class Tiger.TigerBuildingWallPreviewer
// Size: 0x230 (Inherited: 0x228)
struct ATigerBuildingWallPreviewer : AActor {
	struct UTigerBuildingWallPreset* Preset; // 0x228(0x08)
};

// Class Tiger.TigerCamarillaDecal
// Size: 0x238 (Inherited: 0x230)
struct ATigerCamarillaDecal : ADecalActor {
	char pad_230[0x8]; // 0x230(0x08)
};

// Class Tiger.TigerCameraPreset
// Size: 0xa8 (Inherited: 0x28)
struct UTigerCameraPreset : UObject {
	float FOV; // 0x28(0x04)
	float SpringArmLength; // 0x2c(0x04)
	struct FVector CameraOffset; // 0x30(0x0c)
	struct FVector TargetOffset; // 0x3c(0x0c)
	struct UCurveFloat* TransitionCurveIn; // 0x48(0x08)
	struct UCurveFloat* TransitionCurveOutOverride; // 0x50(0x08)
	struct UCurveFloat* RotatePawnTransition; // 0x58(0x08)
	float SidewaysCameraMirrorTime; // 0x60(0x04)
	struct FVector CameraLagSpeed; // 0x64(0x0c)
	struct FVector CameraLagMaxDistance; // 0x70(0x0c)
	float CameraRotationLagSpeed; // 0x7c(0x04)
	float CameraSensitivityModifier; // 0x80(0x04)
	bool bUseCameraSensitivtyModifierDuringFade; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	struct UTigerCameraBehavior* CameraBehavior; // 0x88(0x08)
	struct UMatineeCameraShake* CameraShakeBehaviour; // 0x90(0x08)
	bool bShortenSpringArmWhenLookingUp; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float ViewPitchMax; // 0x9c(0x04)
	float ArmLengthInterpSpeed; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Tiger.TigerCapturePointProgressUI
// Size: 0x2d0 (Inherited: 0x280)
struct UTigerCapturePointProgressUI : UTigerWidget {
	struct FText YouCapturingStatusText; // 0x280(0x18)
	struct FText EnemyCapturingStatusText; // 0x298(0x18)
	struct FText ContestedStatusText; // 0x2b0(0x18)
	enum class ETigerCapturePointStatus CaptureStatus; // 0x2c8(0x01)
	char pad_2C9[0x3]; // 0x2c9(0x03)
	float PercentageLeft; // 0x2cc(0x04)

	void StatusChanged(); // Function Tiger.TigerCapturePointProgressUI.StatusChanged // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnCapturePointEnabled(); // Function Tiger.TigerCapturePointProgressUI.OnCapturePointEnabled // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerChallenge
// Size: 0xf8 (Inherited: 0x28)
struct UTigerChallenge : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FMulticastInlineDelegate OnValueChangedEvent; // 0x30(0x10)
	struct FMulticastInlineDelegate OnChallengeCompletedEvent; // 0x40(0x10)
	struct FMulticastInlineDelegate OnChallengeTierCompletedEvent; // 0x50(0x10)
	struct UWorld* World; // 0x60(0x08)
	struct ATigerPlayerController* OwningPlayerController; // 0x68(0x08)
	int32_t PreSessionValue; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FText ChallengeDisplayName; // 0x78(0x18)
	struct FText ChallengeGameDisplayName; // 0x90(0x18)
	int32_t DefaultTargetValue; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct TArray<int32_t> DefaultTieredTargetValues; // 0xb0(0x10)
	bool bInOneGame; // 0xc0(0x01)
	bool bWithoutDamage; // 0xc1(0x01)
	char pad_C2[0x2]; // 0xc2(0x02)
	int32_t TargetValue; // 0xc4(0x04)
	struct FText Description; // 0xc8(0x18)
	uint64_t ChallengeTypeTelemetryID; // 0xe0(0x08)
	bool bChallengeCompleteEventRaised; // 0xe8(0x01)
	bool bTierCompleteEventRaised; // 0xe9(0x01)
	bool bUseTiers; // 0xea(0x01)
	char pad_EB[0x1]; // 0xeb(0x01)
	uint32_t CurrentTier; // 0xec(0x04)
	uint32_t NumberOfTiers; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)

	bool WithoutTakingDamage(); // Function Tiger.TigerChallenge.WithoutTakingDamage // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f85e0
	void SetCurrentValue(int32_t NewValue); // Function Tiger.TigerChallenge.SetCurrentValue // (Native|Public|BlueprintCallable) // @ game+0x13f8550
	void ResetFromTakingDamage(); // Function Tiger.TigerChallenge.ResetFromTakingDamage // (Final|Native|Private) // @ game+0x13f8530
	void OnValueChangedEvent__DelegateSignature(struct UTigerChallenge* Challenge); // DelegateFunction Tiger.TigerChallenge.OnValueChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void OnChallengeTierCompletedEvent__DelegateSignature(struct UTigerChallenge* Challenge); // DelegateFunction Tiger.TigerChallenge.OnChallengeTierCompletedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	void OnChallengeCompletedEvent__DelegateSignature(struct UTigerChallenge* Challenge); // DelegateFunction Tiger.TigerChallenge.OnChallengeCompletedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	bool IsTierComplete(); // Function Tiger.TigerChallenge.IsTierComplete // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8400
	bool IsSingleMatch(); // Function Tiger.TigerChallenge.IsSingleMatch // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f83d0
	bool IsComplete(); // Function Tiger.TigerChallenge.IsComplete // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8340
	bool HasTiers(); // Function Tiger.TigerChallenge.HasTiers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8320
	bool HasCompletedAllTiers(); // Function Tiger.TigerChallenge.HasCompletedAllTiers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8290
	struct FText GetVariableName(); // Function Tiger.TigerChallenge.GetVariableName // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f80b0
	int32_t GetTargetValueOfLastTier(); // Function Tiger.TigerChallenge.GetTargetValueOfLastTier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8030
	int32_t GetTargetValueOfCurrentTier(); // Function Tiger.TigerChallenge.GetTargetValueOfCurrentTier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7fc0
	int32_t GetTargetValueByTier(int32_t InTier); // Function Tiger.TigerChallenge.GetTargetValueByTier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7ef0
	int32_t GetTargetValue(); // Function Tiger.TigerChallenge.GetTargetValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7ed0
	struct FTigerQuestIdentifier GetQuestIds(); // Function Tiger.TigerChallenge.GetQuestIds // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f77e0
	float GetProgressAcrossAllTiers(); // Function Tiger.TigerChallenge.GetProgressAcrossAllTiers // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f77a0
	float GetProgress(); // Function Tiger.TigerChallenge.GetProgress // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7760
	int32_t GetPreSessionValue(); // Function Tiger.TigerChallenge.GetPreSessionValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7740
	int32_t GetNumberOfTiers(); // Function Tiger.TigerChallenge.GetNumberOfTiers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7680
	struct FText GetDescription(); // Function Tiger.TigerChallenge.GetDescription // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f72b0
	int32_t GetCurrentValueClamped(); // Function Tiger.TigerChallenge.GetCurrentValueClamped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7250
	int32_t GetCurrentValue(); // Function Tiger.TigerChallenge.GetCurrentValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7220
	int32_t GetCurrentTier(); // Function Tiger.TigerChallenge.GetCurrentTier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f71e0
	struct FText GetClanRequirementsText(); // Function Tiger.TigerChallenge.GetClanRequirementsText // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x18b4070
	struct FString GetChallengeName(); // Function Tiger.TigerChallenge.GetChallengeName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6fd0
	struct FText GetChallengeGameDisplayName(); // Function Tiger.TigerChallenge.GetChallengeGameDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6fa0
	struct FText GetChallengeDisplayName(); // Function Tiger.TigerChallenge.GetChallengeDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6ea0
	struct TArray<int32_t> GetAllTargetValues(); // Function Tiger.TigerChallenge.GetAllTargetValues // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6c60
	struct FText BuildDescriptionText(); // Function Tiger.TigerChallenge.BuildDescriptionText // (Event|Protected|BlueprintEvent|Const) // @ game+0x18b4070
	void AdvanceTier(); // Function Tiger.TigerChallenge.AdvanceTier // (Final|Native|Public) // @ game+0x13f6b80
	void AdvanceChallenge(); // Function Tiger.TigerChallenge.AdvanceChallenge // (Final|Native|Public) // @ game+0x13f6b60
};

// Class Tiger.TigerChallengeBreakMasquerade
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeBreakMasquerade : UTigerChallenge {
	char pad_F8[0x8]; // 0xf8(0x08)

	void OnTigerPlayerStateCreated(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeBreakMasquerade.OnTigerPlayerStateCreated // (Final|Native|Private) // @ game+0x13f8480
	void HandlePlayerMasqueradeChange(bool InIsMasqueradeBreached, enum class ETigerAIPlayerAction InPlayerAction); // Function Tiger.TigerChallengeBreakMasquerade.HandlePlayerMasqueradeChange // (Final|Native|Private) // @ game+0x13f81c0
};

// Class Tiger.TigerChallengeCollectibles
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeCollectibles : UTigerChallenge {
	char pad_F8[0x8]; // 0xf8(0x08)

	void HandleCollectibleCollected(uint32_t InCollectibleId); // Function Tiger.TigerChallengeCollectibles.HandleCollectibleCollected // (Final|Native|Private) // @ game+0x13f8130
};

// Class Tiger.TigerChallengeCollectibleSet
// Size: 0x110 (Inherited: 0xf8)
struct UTigerChallengeCollectibleSet : UTigerChallenge {
	struct UTigerGrimoireCategory* CategoryToComplete; // 0xf8(0x08)
	struct UTigerGrimoireEntry* EntryToComplete; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)

	void OnPersistentPlayerInitialised(); // Function Tiger.TigerChallengeCollectibleSet.OnPersistentPlayerInitialised // (Final|Native|Private) // @ game+0x13f8460
};

// Class Tiger.TigerChallengeCollection
// Size: 0x48 (Inherited: 0x30)
struct UTigerChallengeCollection : UDataAsset {
	struct TArray<struct FTigerChallengeCollectionEntry> Challenges; // 0x30(0x10)
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Tiger.TigerClientRewardTrackChallenges
// Size: 0x38 (Inherited: 0x28)
struct UTigerClientRewardTrackChallenges : UObject {
	int32_t RewardHighlightIndex; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UTigerPersistentPlayerState* PersistentPlayerState; // 0x30(0x08)

	bool IsComplete(); // Function Tiger.TigerClientRewardTrackChallenges.IsComplete // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8370
	struct UTigerInventoryItemBase* GetRewardTiedToSpecificChallengeByIndex(int32_t InChallengeIndex); // Function Tiger.TigerClientRewardTrackChallenges.GetRewardTiedToSpecificChallengeByIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7e30
	struct FTigerItemId GetRewardIdTiedToSpecificChallengeByIndex(int32_t InChallengeIndex); // Function Tiger.TigerClientRewardTrackChallenges.GetRewardIdTiedToSpecificChallengeByIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7ad0
	int32_t GetNumCompletedChallenges(); // Function Tiger.TigerClientRewardTrackChallenges.GetNumCompletedChallenges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f75c0
	int32_t GetNumChallenges(); // Function Tiger.TigerClientRewardTrackChallenges.GetNumChallenges // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7430
	float GetCompletionPercentage(); // Function Tiger.TigerClientRewardTrackChallenges.GetCompletionPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7050
	enum class ETigerChallengeCategory GetChallengeCategory(); // Function Tiger.TigerClientRewardTrackChallenges.GetChallengeCategory // (Native|Public|Const) // @ game+0xe0c130
	struct UTigerChallenge* GetChallengeByIndex(int32_t InChallengeIndex); // Function Tiger.TigerClientRewardTrackChallenges.GetChallengeByIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6e00
};

// Class Tiger.TigerClientRewardTrackTransientChallenges
// Size: 0x58 (Inherited: 0x38)
struct UTigerClientRewardTrackTransientChallenges : UTigerClientRewardTrackChallenges {
	struct TArray<struct FTigerChallengeTypeID> ChallengeStorageIDs; // 0x38(0x10)
	struct TArray<struct FTigerItemId> RewardIdForSpecificChallenge; // 0x48(0x10)
};

// Class Tiger.TigerClientRewardTrackDailyChallenges
// Size: 0x70 (Inherited: 0x38)
struct UTigerClientRewardTrackDailyChallenges : UTigerClientRewardTrackChallenges {
	struct TArray<struct FTigerItemId> RewardIds; // 0x38(0x10)
	struct TArray<struct FTigerChallengeTypeID> DailyChallengeIDs; // 0x48(0x10)
	struct FTigerItemId DailyChallengeExpReward; // 0x58(0x08)
	struct FTigerItemId PersistentDailyChallengeTokenReward; // 0x60(0x08)
	bool bIsFirstChallengePersistent; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)

	struct UTigerInventoryItemBase* GetRewardByIndex(int32_t InRewardIndex); // Function Tiger.TigerClientRewardTrackDailyChallenges.GetRewardByIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7960
};

// Class Tiger.TigerClientRewardTrackWeeklyChallenges
// Size: 0x68 (Inherited: 0x58)
struct UTigerClientRewardTrackWeeklyChallenges : UTigerClientRewardTrackTransientChallenges {
	struct FDateTime UnlockDate; // 0x58(0x08)
	struct FDateTime LockDate; // 0x60(0x08)

	bool IsUnlocked(); // Function Tiger.TigerClientRewardTrackWeeklyChallenges.IsUnlocked // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8430
	bool HasExpired(); // Function Tiger.TigerClientRewardTrackWeeklyChallenges.HasExpired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f82f0
	struct FTimespan GetTimeRemainingToUnlock(); // Function Tiger.TigerClientRewardTrackWeeklyChallenges.GetTimeRemainingToUnlock // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f8070
};

// Class Tiger.TigerClientRewardTrackMasteryChallenges
// Size: 0x88 (Inherited: 0x38)
struct UTigerClientRewardTrackMasteryChallenges : UTigerClientRewardTrackChallenges {
	struct TMap<enum class ETigerChallengeSubCategory, struct FTigerNestedSubCategoryContainer> Challenges; // 0x38(0x50)

	struct FTigerItemId GetRewardIdTiedToSpecificChallengeByIndexOfSubcategory(enum class ETigerChallengeSubCategory InSubCategory, int32_t InChallengeIndex); // Function Tiger.TigerClientRewardTrackMasteryChallenges.GetRewardIdTiedToSpecificChallengeByIndexOfSubcategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7b70
	int32_t GetNumCompletedChallengesOfSubCategory(enum class ETigerChallengeSubCategory InSubCategory); // Function Tiger.TigerClientRewardTrackMasteryChallenges.GetNumCompletedChallengesOfSubCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f75f0
	int32_t GetNumChallengesOfSubCategory(enum class ETigerChallengeSubCategory InSubCategory); // Function Tiger.TigerClientRewardTrackMasteryChallenges.GetNumChallengesOfSubCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7530
	struct TMap<enum class ETigerChallengeSubCategory, int32_t> GetNumChallengesBySubCategory(); // Function Tiger.TigerClientRewardTrackMasteryChallenges.GetNumChallengesBySubCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7460
	int32_t GetCompletionPercentageOfSubcategory(enum class ETigerChallengeSubCategory InSubCategory); // Function Tiger.TigerClientRewardTrackMasteryChallenges.GetCompletionPercentageOfSubcategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7080
	struct UTigerChallenge* GetChallengeFromSubCategoryByIndex(enum class ETigerChallengeSubCategory InSubCategory, int32_t InChallengeIndex); // Function Tiger.TigerClientRewardTrackMasteryChallenges.GetChallengeFromSubCategoryByIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f6ed0
};

// Class Tiger.TigerClientRewardTrackTestChallenges
// Size: 0x58 (Inherited: 0x58)
struct UTigerClientRewardTrackTestChallenges : UTigerClientRewardTrackTransientChallenges {
};

// Class Tiger.TigerClientChallengesCollection
// Size: 0x58 (Inherited: 0x28)
struct UTigerClientChallengesCollection : UObject {
	struct TArray<struct UTigerClientRewardTrackWeeklyChallenges*> WeeklyChallenges; // 0x28(0x10)
	struct UTigerClientRewardTrackDailyChallenges* DailyChallenges; // 0x38(0x08)
	struct TArray<struct UTigerClientRewardTrackMasteryChallenges*> MasteryChallenges; // 0x40(0x10)
	struct UTigerClientRewardTrackTestChallenges* TestChallenges; // 0x50(0x08)

	struct UTigerInventoryItemBase* GetRewardTiedToChallengeOfCategory(enum class ETigerChallengeCategory InCategory, struct UTigerChallenge* InChallenge, int32_t InTier); // Function Tiger.TigerClientChallengesCollection.GetRewardTiedToChallengeOfCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7d20
	struct UTigerInventoryItemBase* GetRewardTiedToChallenge(struct UTigerChallenge* InChallenge, int32_t InTier); // Function Tiger.TigerClientChallengesCollection.GetRewardTiedToChallenge // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7c50
	struct FTigerItemId GetRewardIdTiedToChallenge(struct UTigerChallenge* InChallenge, int32_t InTier); // Function Tiger.TigerClientChallengesCollection.GetRewardIdTiedToChallenge // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f7a00
	int32_t GetPercentageCompletionOfCategory(enum class ETigerChallengeCategory InCategory); // Function Tiger.TigerClientChallengesCollection.GetPercentageCompletionOfCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13f76b0
	bool AllowTestChallenges(); // Function Tiger.TigerClientChallengesCollection.AllowTestChallenges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xb53540
};

// Class Tiger.TigerChallengeDealDamage
// Size: 0x168 (Inherited: 0xf8)
struct UTigerChallengeDealDamage : UTigerChallenge {
	bool bNeedsToDamagePlayer; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0x100(0x18)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x118(0x10)
	struct FTigerChallengeRequirementBloodhunted EnemyBloodhuntedRequirement; // 0x128(0x10)
	struct FTigerChallengeRequirementDistance DistanceToEnemyRequirement; // 0x138(0x10)
	struct FTigerChallengeRequirementPowerKit PlayerArchetypeRequirement; // 0x148(0x10)
	char pad_158[0x10]; // 0x158(0x10)
};

// Class Tiger.TigerChallengeDiablerize
// Size: 0x130 (Inherited: 0xf8)
struct UTigerChallengeDiablerize : UTigerChallenge {
	struct FTigerChallengeRequirementClan TargetRequiredClan; // 0xf8(0x10)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x108(0x10)
	struct FTigerChallengeRequirementBloodhunted EnemyBloodhuntedRequirement; // 0x118(0x10)
	char pad_128[0x8]; // 0x128(0x08)

	void OnDiablerizedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeDiablerize.OnDiablerizedPlayerEvent // (Final|Native|Private) // @ game+0x13fd0b0
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeDiablerize.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x13fcdb0
};

// Class Tiger.TigerChallengeDownPlayer
// Size: 0x158 (Inherited: 0xf8)
struct UTigerChallengeDownPlayer : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xf8(0x18)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x110(0x10)
	struct FTigerChallengeRequirementBloodhunted EnemyBloodhuntedRequirement; // 0x120(0x10)
	struct FTigerChallengeRequirementDisciplineSlot DisciplineFailRequirement; // 0x130(0x10)
	struct FTigerChallengeRequirementAirborne AirborneRequirement; // 0x140(0x10)
	bool bIsAirborneRequirementForPlayer; // 0x150(0x01)
	bool bDownWithHeadShot; // 0x151(0x01)
	char pad_152[0x6]; // 0x152(0x06)

	void OnDownedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeDownPlayer.OnDownedPlayerEvent // (Final|Native|Private) // @ game+0x13fd250
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeDownPlayer.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x13fce40
};

// Class Tiger.TigerChallengeDrainNpc
// Size: 0x118 (Inherited: 0xf8)
struct UTigerChallengeDrainNpc : UTigerChallenge {
	bool bSpecificNPCType; // 0xf8(0x01)
	enum class ETigerNPCType TargetNPCType; // 0xf9(0x01)
	enum class ETigerBloodPotency MinimumPotency; // 0xfa(0x01)
	char pad_FB[0x5]; // 0xfb(0x05)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x100(0x10)
	char pad_110[0x8]; // 0x110(0x08)

	bool IsBloodPotencyRelevant(); // Function Tiger.TigerChallengeDrainNpc.IsBloodPotencyRelevant // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x13fd080
	void InitOnPlayerEvent(struct AController* NewPlayer); // Function Tiger.TigerChallengeDrainNpc.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x13fced0
	void HandleOnFeedingDoneEvent(bool bTargetIsDrained, struct ATigerCharacter* InTargetFedOn); // Function Tiger.TigerChallengeDrainNpc.HandleOnFeedingDoneEvent // (Final|Native|Private) // @ game+0x13fc910
};

// Class Tiger.TigerChallengeDropOffItem
// Size: 0x128 (Inherited: 0xf8)
struct UTigerChallengeDropOffItem : UTigerChallenge {
	struct TSoftObjectPtr<ATigerInteractiveItemDropOff> DropOffPoint; // 0xf8(0x28)
	char pad_120[0x8]; // 0x120(0x08)

	void HandleDropoffCompleted(struct TSoftObjectPtr<ATigerInteractiveItemDropOff> InDropoffPoint); // Function Tiger.TigerChallengeDropOffItem.HandleDropoffCompleted // (Final|Native|Private) // @ game+0x13fc800
};

// Class Tiger.TigerChallengeEliminateGroup
// Size: 0x158 (Inherited: 0xf8)
struct UTigerChallengeEliminateGroup : UTigerChallenge {
	bool bDownedPlayersOnly; // 0xf8(0x01)
	char pad_F9[0x5f]; // 0xf9(0x5f)

	void OnKilledOrDownedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeEliminateGroup.OnKilledOrDownedPlayerEvent // (Final|Native|Private) // @ game+0x13fd3f0
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeEliminateGroup.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x13fcf60
};

// Class Tiger.TigerChallengeGetEatenByShark
// Size: 0x110 (Inherited: 0xf8)
struct UTigerChallengeGetEatenByShark : UTigerChallenge {
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0xf8(0x10)
	char pad_108[0x8]; // 0x108(0x08)

	void OnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeGetEatenByShark.OnRestartPlayer // (Final|Native|Public) // @ game+0x13fd720
	void OnPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeGetEatenByShark.OnPlayerEvent // (Final|Native|Private) // @ game+0x13fd650
};

// Class Tiger.TigerChallengeHeadshots
// Size: 0x140 (Inherited: 0xf8)
struct UTigerChallengeHeadshots : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xf8(0x18)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x110(0x10)
	struct FTigerChallengeRequirementBloodhunted EnemyBloodhuntedRequirement; // 0x120(0x10)
	bool bOnlyOnPlayers; // 0x130(0x01)
	char pad_131[0xf]; // 0x131(0x0f)
};

// Class Tiger.TigerChallengeHitBullets
// Size: 0x140 (Inherited: 0xf8)
struct UTigerChallengeHitBullets : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xf8(0x18)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x110(0x10)
	struct FTigerChallengeRequirementBloodhunted EnemyBloodhuntedRequirement; // 0x120(0x10)
	char pad_130[0x10]; // 0x130(0x10)
};

// Class Tiger.TigerChallengeKillEntity
// Size: 0x120 (Inherited: 0xf8)
struct UTigerChallengeKillEntity : UTigerChallenge {
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0xf8(0x10)
	struct FTigerChallengeRequirementClan EnemyClanRequirement; // 0x108(0x10)
	char pad_118[0x8]; // 0x118(0x08)

	void HandleOnNpcDeathEvent(struct ATigerNPC* NPC, struct AController* Instigator); // Function Tiger.TigerChallengeKillEntity.HandleOnNpcDeathEvent // (Final|Native|Private) // @ game+0x13fc9e0
};

// Class Tiger.TigerChallengeKillMultipleTimed
// Size: 0x148 (Inherited: 0xf8)
struct UTigerChallengeKillMultipleTimed : UTigerChallenge {
	float TimeToKillGroup; // 0xf8(0x04)
	enum class ETigerEnemyType TypeOfEnemy; // 0xfc(0x01)
	char pad_FD[0x3]; // 0xfd(0x03)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x100(0x10)
	int32_t NumOfEnemiesToKill; // 0x110(0x04)
	char pad_114[0x34]; // 0x114(0x34)

	void OnKilledPlayer(struct ATigerPlayer* InDeadPlayer, struct FDamageEvent& InDamageEvent); // Function Tiger.TigerChallengeKillMultipleTimed.OnKilledPlayer // (Final|Native|Private|HasOutParms) // @ game+0x13fd4c0
	void OnKilledNpc(struct ATigerNPC* InNpc, struct AController* InInstigator); // Function Tiger.TigerChallengeKillMultipleTimed.OnKilledNpc // (Final|Native|Private) // @ game+0x13fd320
	void HandlePlayerLeft(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeKillMultipleTimed.HandlePlayerLeft // (Final|Native|Private) // @ game+0x13fcab0
};

// Class Tiger.TigerChallengeKillPlayers
// Size: 0x168 (Inherited: 0xf8)
struct UTigerChallengeKillPlayers : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xf8(0x18)
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0x110(0x10)
	struct FTigerChallengeRequirementBloodhunted EnemyBloodhuntedRequirement; // 0x120(0x10)
	struct FTigerChallengeRequirementClan EnemyClanRequirement; // 0x130(0x10)
	bool bKillOnlyDownedStateInstigators; // 0x140(0x01)
	char pad_141[0x27]; // 0x141(0x27)

	void OnDownedByPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeKillPlayers.OnDownedByPlayerEvent // (Final|Native|Protected) // @ game+0x13fd180
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeKillPlayers.InitOnPlayerEvent // (Final|Native|Protected) // @ game+0x13fcff0
};

// Class Tiger.TigerChallengePlayGames
// Size: 0x168 (Inherited: 0xf8)
struct UTigerChallengePlayGames : UTigerChallenge {
	struct FTigerChallengeRequirementClan RequiredClanCondition; // 0xf8(0x10)
	struct FTigerChallengeRequirementBalanceMode RequiredBalanceModeCondition; // 0x108(0x10)
	struct FTigerChallengeRequirementGameMode RequiredGameModeCondition; // 0x118(0x20)
	struct FTigerChallengeRequirementExcludeGameMode RequiredExcludeGameModeCondition; // 0x138(0x20)
	bool bWithoutBecomingBloodhunted; // 0x158(0x01)
	bool bResetOnBloodhunted; // 0x159(0x01)
	char pad_15A[0xe]; // 0x15a(0x0e)

	void OnTigerPlayerStateCreated(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengePlayGames.OnTigerPlayerStateCreated // (Final|Native|Private) // @ game+0x13fd7b0
	void HandlePlayerMasqueradeChange(bool InIsMasqueradeBreached, enum class ETigerAIPlayerAction InPlayerAction); // Function Tiger.TigerChallengePlayGames.HandlePlayerMasqueradeChange // (Final|Native|Private) // @ game+0x13fcbd0
	void HandlePlayerLeft(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengePlayGames.HandlePlayerLeft // (Final|Native|Private) // @ game+0x13fcb40
};

// Class Tiger.TigerChallengeQuestItemPickup
// Size: 0x128 (Inherited: 0xf8)
struct UTigerChallengeQuestItemPickup : UTigerChallenge {
	struct TSoftObjectPtr<ATigerInteractiveQuestItem> QuestItem; // 0xf8(0x28)
	char pad_120[0x8]; // 0x120(0x08)

	void HandleQuestItemCollected(struct TSoftObjectPtr<ATigerInteractiveQuestItem> InQuestItem); // Function Tiger.TigerChallengeQuestItemPickup.HandleQuestItemCollected // (Final|Native|Private) // @ game+0x13fcca0
};

// Class Tiger.TigerChallengeReachLevel
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeReachLevel : UTigerChallenge {
	char pad_F8[0x4]; // 0xf8(0x04)
	enum class ETigerPlayerLevelType LevelType; // 0xfc(0x01)
	bool bIsAnyArchetypeAtTargetLevel; // 0xfd(0x01)
	enum class ETigerPowerKitType ArchetypeLevelType; // 0xfe(0x01)
	char pad_FF[0x1]; // 0xff(0x01)

	void OnTigerPlayerStateCreated(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeReachLevel.OnTigerPlayerStateCreated // (Final|Native|Private) // @ game+0x13fd840
	void OnPersistentPlayerInitialised(); // Function Tiger.TigerChallengeReachLevel.OnPersistentPlayerInitialised // (Final|Native|Private) // @ game+0x13fd630
	void OnLevelChanged(int32_t InLevel); // Function Tiger.TigerChallengeReachLevel.OnLevelChanged // (Final|Native|Private) // @ game+0x13fd5a0
};

// Class Tiger.TigerChallengeRevive
// Size: 0x110 (Inherited: 0xf8)
struct UTigerChallengeRevive : UTigerChallenge {
	struct FTigerChallengeRequirementBloodhunted PlayerBloodhuntedRequirement; // 0xf8(0x10)
	char pad_108[0x8]; // 0x108(0x08)

	void OnRevivedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeRevive.OnRevivedPlayerEvent // (Final|Native|Private) // @ game+0x1403f10
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeRevive.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x1402720
};

// Class Tiger.TigerChallengeSharkAssist
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeSharkAssist : UTigerChallenge {
	char pad_F8[0x8]; // 0xf8(0x08)

	void OnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeSharkAssist.OnRestartPlayer // (Final|Native|Public) // @ game+0x1403e80
	void OnPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeSharkAssist.OnPlayerEvent // (Final|Native|Private) // @ game+0x1403ba0
};

// Class Tiger.TigerChallengeSpeakToNpc
// Size: 0x158 (Inherited: 0xf8)
struct UTigerChallengeSpeakToNpc : UTigerChallenge {
	struct FText RequiredNpcToSpeakToName; // 0xf8(0x18)
	struct FTigerChallengeRequirementClan PlayerClanRequirment; // 0x110(0x10)
	bool bTestAgainstSpecificDialogue; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct FString RequiredDialogueBaseKey; // 0x128(0x10)
	struct FString RequiredDialogueKey; // 0x138(0x10)
	char pad_148[0x10]; // 0x148(0x10)

	void HandleNpcSpokenTo(struct FText InNPCName); // Function Tiger.TigerChallengeSpeakToNpc.HandleNpcSpokenTo // (Final|Native|Private|BlueprintCallable) // @ game+0x1401f60
};

// Class Tiger.TigerChallengeSurviveBeingDowned
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeSurviveBeingDowned : UTigerChallenge {
	char pad_F8[0x8]; // 0xf8(0x08)

	void OnPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeSurviveBeingDowned.OnPlayerEvent // (Final|Native|Private) // @ game+0x1403c70
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeSurviveBeingDowned.InitOnPlayerEvent // (Final|Native|Public) // @ game+0x14027b0
};

// Class Tiger.TigerChallengeSurviveBloodhunt
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeSurviveBloodhunt : UTigerChallenge {
	char pad_F8[0x8]; // 0xf8(0x08)

	void OnTigerPlayerStateCreated(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeSurviveBloodhunt.OnTigerPlayerStateCreated // (Final|Native|Private) // @ game+0x1403fe0
	void HandlePlayerMasqueradeChange(bool InIsMasqueradeBreached, enum class ETigerAIPlayerAction InPlayerAction); // Function Tiger.TigerChallengeSurviveBloodhunt.HandlePlayerMasqueradeChange // (Final|Native|Private) // @ game+0x14020d0
};

// Class Tiger.TigerChallengeSurviveTime
// Size: 0x118 (Inherited: 0xf8)
struct UTigerChallengeSurviveTime : UTigerChallenge {
	char pad_F8[0x20]; // 0xf8(0x20)

	void OnPlayerDeath(struct ATigerPlayer* InDeadPlayer, struct AActor* InInstigator, bool bInWillRespawn); // Function Tiger.TigerChallengeSurviveTime.OnPlayerDeath // (Final|Native|Public) // @ game+0x1403a90
	void InitOnPlayerStart(struct AController* InNewPlayer); // Function Tiger.TigerChallengeSurviveTime.InitOnPlayerStart // (Final|Native|Public) // @ game+0x14029f0
};

// Class Tiger.TigerChallengeTopPlayer
// Size: 0x140 (Inherited: 0xf8)
struct UTigerChallengeTopPlayer : UTigerChallenge {
	int32_t TopPlacementRequirement; // 0xf8(0x04)
	bool bWithoutBecomingBloodhunted; // 0xfc(0x01)
	bool bWithoutUsingDiscipline; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FTigerChallengeRequirementPowerKit PlayerRequiredArchetype; // 0x100(0x10)
	struct FTigerChallengeRequirementWeaponType OnlyUseWeaponTypeConstraint; // 0x110(0x18)
	char pad_128[0x18]; // 0x128(0x18)

	void OnTigerPlayerStateCreated(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeTopPlayer.OnTigerPlayerStateCreated // (Final|Native|Private) // @ game+0x1404070
	void OnPlayerDealtDamage(struct ATigerCharacter* InTargetCharacter, struct FDamageEvent& InDamageEvent, float InActualDamage); // Function Tiger.TigerChallengeTopPlayer.OnPlayerDealtDamage // (Final|Native|Private|HasOutParms) // @ game+0x1403960
	void OnDisciplineActivated(enum class ETigerDisciplinesEnum InDisciplineActivated); // Function Tiger.TigerChallengeTopPlayer.OnDisciplineActivated // (Final|Native|Private) // @ game+0x1403790
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeTopPlayer.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x1402840
	void HandlePlayerMasqueradeChange(bool InIsMasqueradeBreached, enum class ETigerAIPlayerAction InPlayerAction); // Function Tiger.TigerChallengeTopPlayer.HandlePlayerMasqueradeChange // (Final|Native|Private) // @ game+0x14021a0
	void HandlePlayerLeft(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeTopPlayer.HandlePlayerLeft // (Final|Native|Private) // @ game+0x1402040
};

// Class Tiger.TigerChallengeTravelDistance
// Size: 0x100 (Inherited: 0xf8)
struct UTigerChallengeTravelDistance : UTigerChallenge {
	char pad_F8[0x8]; // 0xf8(0x08)

	void OnMovementUpdated(float InDelta, struct ATigerPlayerController* InPlayerController); // Function Tiger.TigerChallengeTravelDistance.OnMovementUpdated // (Final|Native|Private) // @ game+0x1403890
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeTravelDistance.InitOnPlayerEvent // (Final|Native|Public) // @ game+0x14028d0
};

// Class Tiger.TigerChallengeTypeDatabase
// Size: 0x80 (Inherited: 0x28)
struct UTigerChallengeTypeDatabase : UObject {
	bool bFirstDailyChallengeIsPersistent; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct TMap<enum class ETigerChallengeCategory, struct FTigerChallengeCollectionArray> ChallengeCategoryCollections; // 0x30(0x50)
};

// Class Tiger.TigerChallengeUseDiscipline
// Size: 0x110 (Inherited: 0xf8)
struct UTigerChallengeUseDiscipline : UTigerChallenge {
	struct FTigerChallengeRequirementDisciplineSlot DisciplineSlotRequirement; // 0xf8(0x10)
	char pad_108[0x8]; // 0x108(0x08)

	void OnDisciplineActivated(enum class ETigerDisciplinesEnum InDisciplineActivated); // Function Tiger.TigerChallengeUseDiscipline.OnDisciplineActivated // (Final|Native|Private) // @ game+0x1403810
	void InitOnPlayerEvent(struct AController* InNewPlayer); // Function Tiger.TigerChallengeUseDiscipline.InitOnPlayerEvent // (Final|Native|Private) // @ game+0x1402960
};

// Class Tiger.TigerChallengeUtilityBFL
// Size: 0x28 (Inherited: 0x28)
struct UTigerChallengeUtilityBFL : UBlueprintFunctionLibrary {

	bool HasRequirement_WeaponType(struct FTigerChallengeRequirementWeaponType& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_WeaponType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402670
	bool HasRequirement_TraversalState(struct FTigerChallengeRequirementTraversalState& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_TraversalState // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402270
	bool HasRequirement_PowerKit(struct FTigerChallengeRequirementPowerKit& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_PowerKit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402270
	bool HasRequirement_GameMode(struct FTigerChallengeRequirementGameMode& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_GameMode // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14025b0
	bool HasRequirement_ExcludeGameMode(struct FTigerChallengeRequirementExcludeGameMode& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_ExcludeGameMode // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14025b0
	bool HasRequirement_Distance(struct FTigerChallengeRequirementDistance& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_Distance // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402500
	bool HasRequirement_DisciplineSlot(struct FTigerChallengeRequirementDisciplineSlot& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_DisciplineSlot // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402450
	bool HasRequirement_Clan(struct FTigerChallengeRequirementClan& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_Clan // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x14023b0
	bool HasRequirement_Bloodhunted(struct FTigerChallengeRequirementBloodhunted& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_Bloodhunted // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402270
	bool HasRequirement_BalanceMode(struct FTigerChallengeRequirementBalanceMode& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_BalanceMode // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402310
	bool HasRequirement_Airborne(struct FTigerChallengeRequirementAirborne& InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_Airborne // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1402270
};

// Class Tiger.TigerChallengeVisitLocation
// Size: 0x158 (Inherited: 0xf8)
struct UTigerChallengeVisitLocation : UTigerChallenge {
	struct TSoftObjectPtr<ATigerVisitLocationTriggerVolume> TriggerVolume; // 0xf8(0x28)
	bool bHasInteraction; // 0x120(0x01)
	bool bHideInteractorUntillVolumeEntered; // 0x121(0x01)
	char pad_122[0x6]; // 0x122(0x06)
	struct TSoftObjectPtr<ATigerInteractivePoint> InteractionPoint; // 0x128(0x28)
	char pad_150[0x8]; // 0x150(0x08)

	void HandleLocationEntered(struct ATigerPlayerController* InIntersectingPlayerController); // Function Tiger.TigerChallengeVisitLocation.HandleLocationEntered // (Final|Native|Private) // @ game+0x1401ed0
	void HandleInteractionComplete(struct TSoftObjectPtr<ATigerInteractivePoint> InInteractedItem); // Function Tiger.TigerChallengeVisitLocation.HandleInteractionComplete // (Final|Native|Private) // @ game+0x1401dc0
};

// Class Tiger.TigerCharacterCardBase
// Size: 0x288 (Inherited: 0x280)
struct UTigerCharacterCardBase : UTigerWidget {
	struct TWeakObjectPtr<struct ATigerPlayerState> RepresentedPlayer; // 0x280(0x08)

	void OnInit(struct ATigerPlayerState* InRepresentedPlayer); // Function Tiger.TigerCharacterCardBase.OnInit // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void Init(struct ATigerPlayerState* InRepresentedPlayer); // Function Tiger.TigerCharacterCardBase.Init // (Final|Native|Private|BlueprintCallable) // @ game+0x140b040
	struct ATigerPlayerState* GetRepresentedPlayer(); // Function Tiger.TigerCharacterCardBase.GetRepresentedPlayer // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x140b010
	void BuildCharacterCard(); // Function Tiger.TigerCharacterCardBase.BuildCharacterCard // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerCharacterCustomizablePreviewThumbnailUI
// Size: 0x2f0 (Inherited: 0x280)
struct UTigerCharacterCustomizablePreviewThumbnailUI : UTigerWidget {
	struct ATigerThumbnailActor* ThumbnailActorType; // 0x280(0x08)
	bool bIsRealtime; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct UMaterialInterface* PostRenderMaterial; // 0x290(0x08)
	char pad_298[0x40]; // 0x298(0x40)
	struct ATigerThumbnailActor* ThumbnailActor; // 0x2d8(0x08)
	float FOV; // 0x2e0(0x04)
	char pad_2E4[0xc]; // 0x2e4(0x0c)

	void TickViewport(float InDeltaTime); // Function Tiger.TigerCharacterCustomizablePreviewThumbnailUI.TickViewport // (Final|Native|Public|BlueprintCallable) // @ game+0x140b0d0
};

// Class Tiger.TigerInventoryItemBase
// Size: 0x130 (Inherited: 0x28)
struct UTigerInventoryItemBase : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FText UiName; // 0x30(0x18)
	struct FText UIDescription; // 0x48(0x18)
	struct FText TemporaryVs2CategoryName; // 0x60(0x18)
	struct TSoftObjectPtr<UTexture2D> UITexture; // 0x78(0x28)
	struct TSoftObjectPtr<UTexture2D> UiBackgroundTexture; // 0xa0(0x28)
	struct FLinearColor TintColor; // 0xc8(0x10)
	bool bForceToFrontWhenSorted; // 0xd8(0x01)
	enum class ETigerItemRarity Rarity; // 0xd9(0x01)
	bool bIsAvailableForEveryone; // 0xda(0x01)
	bool bUseCustomOwner; // 0xdb(0x01)
	enum class ETigerOutfitGender OutfitGender; // 0xdc(0x01)
	char pad_DD[0x3]; // 0xdd(0x03)
	struct TArray<struct FTigerInventoryItemOwnerType> PossibleOwners; // 0xe0(0x10)
	struct FString CameraTag; // 0xf0(0x10)
	struct TSoftClassPtr<UObject> ReplacementAsset; // 0x100(0x28)
	uint64_t TelemetryID; // 0x128(0x08)

	void TakeTelemetryIDFromCombinedItem(struct UTigerCharacterCombinedItemConfiguration* InCombinedItem); // Function Tiger.TigerInventoryItemBase.TakeTelemetryIDFromCombinedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x14bb190
	void SetUIMaterialParameters(struct UMaterialInstanceDynamic* InMaterial); // Function Tiger.TigerInventoryItemBase.SetUIMaterialParameters // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	struct UMaterialInterface* GetUiMaterialOverride(); // Function Tiger.TigerInventoryItemBase.GetUiMaterialOverride // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	enum class ETigerPersistentStoreCategory GetStoreCategory(); // Function Tiger.TigerInventoryItemBase.GetStoreCategory // (Native|Public|BlueprintCallable|Const) // @ game+0x144dbb0
	bool GetPrimaryOwnerNoArchetype(enum class ETigerClan& OutClan, enum class ETigerGender& OutBodyType); // Function Tiger.TigerInventoryItemBase.GetPrimaryOwnerNoArchetype // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x14bac80
	bool GetPrimaryOwner(enum class ETigerClan& OutClan, enum class ETigerPowerKitType& OutArchetype, enum class ETigerGender& OutBodyType); // Function Tiger.TigerInventoryItemBase.GetPrimaryOwner // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x14bab40
	struct TArray<enum class ETigerClan> GetPossibleOwningClans(); // Function Tiger.TigerInventoryItemBase.GetPossibleOwningClans // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x14baa90
	struct TArray<enum class ETigerGender> GetPossibleOwningBodyTypes(); // Function Tiger.TigerInventoryItemBase.GetPossibleOwningBodyTypes // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x14baa10
	struct TArray<enum class ETigerPowerKitType> GetPossibleOwningArchetypes(); // Function Tiger.TigerInventoryItemBase.GetPossibleOwningArchetypes // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x14ba990
	enum class ETigerGender GetGender(); // Function Tiger.TigerInventoryItemBase.GetGender // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ba960
	bool CanBeOwnedByBodyWithArchetypeRestriction(enum class ETigerGender InBodyType, enum class ETigerPowerKitType InPowerKit); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByBodyWithArchetypeRestriction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ba700
	bool CanBeOwnedByBodyType(enum class ETigerGender InBodyType); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByBodyType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ba670
	bool CanBeOwnedByArchetype(enum class ETigerPowerKitType InArchetypeType); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByArchetype // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ba5e0
	bool CanBeOwnedByAnyArchetypeOfClan(struct UTigerPlayerClanData* InClan, enum class ETigerGender BodyType); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByAnyArchetypeOfClan // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14ba510
};

// Class Tiger.TigerCharacterOutfitConfiguration
// Size: 0x2c0 (Inherited: 0x130)
struct UTigerCharacterOutfitConfiguration : UTigerInventoryItemBase {
	struct FTigerLodSplitMesh SplitMesh; // 0x130(0x78)
	struct TSoftObjectPtr<USkeletalMesh> AdditionalMesh; // 0x1a8(0x28)
	struct TArray<struct FTigerCharacterOutfitHoodieVariation> HoodieVariations; // 0x1d0(0x10)
	struct TMap<int32_t, struct TSoftObjectPtr<UMaterialInterface>> Materials; // 0x1e0(0x50)
	struct FTigerCharacterHolsteredWeaponTransforms HolsteredWeaponsTransforms; // 0x230(0x60)
	bool bUseBodyTypeJointScaling; // 0x290(0x01)
	bool bUseBodyTypeBlendShapes; // 0x291(0x01)
	bool bHoodieUpOnThumbnail; // 0x292(0x01)
	char pad_293[0x5]; // 0x293(0x05)
	struct TSoftObjectPtr<USkeletalMesh> Mesh; // 0x298(0x28)
};

// Class Tiger.TigerCharacterCombinedItemConfiguration
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterCombinedItemConfiguration : UTigerInventoryItemBase {
	struct TSoftClassPtr<UObject> CombinedItemClassType; // 0x130(0x28)
	struct TArray<struct FTigerInventoryCombinedItemValue> Items; // 0x158(0x10)

	struct UTigerInventoryItemBase* GetItemFromCombinedContainer(enum class ETigerGender InBodyType, enum class ETigerPowerKitType InPowerKit, enum class ETigerClan InClan); // Function Tiger.TigerCharacterCombinedItemConfiguration.GetItemFromCombinedContainer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140aef0
};

// Class Tiger.TigerCharacterSkinToneCustomization
// Size: 0x180 (Inherited: 0x130)
struct UTigerCharacterSkinToneCustomization : UTigerInventoryItemBase {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
	struct FLinearColor LightColor; // 0x168(0x10)
	float LightIntensity; // 0x178(0x04)
	char pad_17C[0x4]; // 0x17c(0x04)
};

// Class Tiger.TigerCharacterBodyTypeCustomization
// Size: 0x1c8 (Inherited: 0x130)
struct UTigerCharacterBodyTypeCustomization : UTigerInventoryItemBase {
	struct TSoftObjectPtr<UTigerCharacterPreset> CharacterPreset; // 0x130(0x28)
	struct TSoftObjectPtr<UAnimSequence> JointScalings; // 0x158(0x28)
	struct TArray<struct FTigerCharacterBlendShapeScalarValue> BlendShapeScalarValues; // 0x180(0x10)
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x190(0x38)
};

// Class Tiger.TigerCharacterPartOfHeadCustomization
// Size: 0x130 (Inherited: 0x130)
struct UTigerCharacterPartOfHeadCustomization : UTigerInventoryItemBase {
};

// Class Tiger.TigerPlayerCardCustomization
// Size: 0x130 (Inherited: 0x130)
struct UTigerPlayerCardCustomization : UTigerInventoryItemBase {
};

// Class Tiger.TigerCharacterHeadConfiguration
// Size: 0x330 (Inherited: 0x130)
struct UTigerCharacterHeadConfiguration : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
	struct FTigerLodSplitMesh SplitMesh; // 0x168(0x78)
	struct FTigerLodSplitMesh SplitNeckMesh; // 0x1e0(0x78)
	struct TSoftObjectPtr<UPoseAsset> FacePostAsset; // 0x258(0x28)
	struct TSoftObjectPtr<UAnimSequence> FacePoseSourceAnimation; // 0x280(0x28)
	struct TArray<struct TSoftObjectPtr<UMaterialInterface>> BodySkinMaterials; // 0x2a8(0x10)
	struct TArray<struct TSoftClassPtr<UObject>> SkinTones; // 0x2b8(0x10)
	struct FName HeadgearMaleSocket; // 0x2c8(0x08)
	struct FName HeadgearFemaleSocket; // 0x2d0(0x08)
	struct FName HeadgearOffsetSocketName; // 0x2d8(0x08)
	struct FName HeadgearOffsetLocator; // 0x2e0(0x08)
	struct FTigerCharacterHeadHeadgearOffset HeadgearOffset; // 0x2e8(0x18)
	struct FName EyewearSocket; // 0x300(0x08)
	struct TSoftObjectPtr<USkeletalMesh> Mesh; // 0x308(0x28)

	void SetPoseableHair(struct UTigerCharacterHairStyleCustomization* InHair, struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString>& InFilter); // Function Tiger.TigerCharacterHeadConfiguration.SetPoseableHair // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
	void SetPoseableBeard(struct UTigerCharacterBeardCustomization* InBeard, struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString>& InFilter); // Function Tiger.TigerCharacterHeadConfiguration.SetPoseableBeard // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
	void SetPiercingSlotLocationAndRotation(struct UTigerCharacterMeshManager* InMeshManager, struct FName InName, struct FVector InLocation, struct FRotator InRotation); // Function Tiger.TigerCharacterHeadConfiguration.SetPiercingSlotLocationAndRotation // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x18b4070
	void SetPiercings(struct UTigerCharacterPiercingSetCustomization* InPiercingSet, struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString>& InFilter); // Function Tiger.TigerCharacterHeadConfiguration.SetPiercings // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
	void SetEyewearOffset(struct UTigerCharacterMeshManager* MeshManager); // Function Tiger.TigerCharacterHeadConfiguration.SetEyewearOffset // (Event|Public|BlueprintEvent|Const) // @ game+0x18b4070
	void GetPiercingSlots(struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString>& InFilter, struct TMap<struct FName, struct FTigerCharacterHeadPiercingSocket>& OutSlots); // Function Tiger.TigerCharacterHeadConfiguration.GetPiercingSlots // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
	void DrawDebugPiercingSlots(struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString>& InFilter); // Function Tiger.TigerCharacterHeadConfiguration.DrawDebugPiercingSlots // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
};

// Class Tiger.TigerCharacterFacePaintCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterFacePaintCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterHeadgearCustomization
// Size: 0x1f0 (Inherited: 0x130)
struct UTigerCharacterHeadgearCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
	struct TSoftObjectPtr<USkeletalMesh> Mesh; // 0x168(0x28)
	struct TMap<int32_t, struct TSoftObjectPtr<UMaterialInterface>> Materials; // 0x190(0x50)
	struct UTigerAnimationFilter* AnimationFilter; // 0x1e0(0x08)
	bool bUseNeckMeshOnly; // 0x1e8(0x01)
	bool bHideBeard; // 0x1e9(0x01)
	bool bHideEyewear; // 0x1ea(0x01)
	char pad_1EB[0x5]; // 0x1eb(0x05)

	void GatherPiercingFilter(struct TSet<struct FString>& InOutPiercingFilter); // Function Tiger.TigerCharacterHeadgearCustomization.GatherPiercingFilter // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
};

// Class Tiger.TigerCharacterEyewearCustomization
// Size: 0x1e0 (Inherited: 0x130)
struct UTigerCharacterEyewearCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
	struct TSoftObjectPtr<USkeletalMesh> Mesh; // 0x168(0x28)
	struct TMap<int32_t, struct TSoftObjectPtr<UMaterialInterface>> Materials; // 0x190(0x50)

	void GatherPiercingFilter(struct TSet<struct FString>& InOutPiercingFilter); // Function Tiger.TigerCharacterEyewearCustomization.GatherPiercingFilter // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x18b4070
};

// Class Tiger.TigerCharacterHairStyleCustomization
// Size: 0x228 (Inherited: 0x130)
struct UTigerCharacterHairStyleCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
	bool bUseLegacyHair; // 0x168(0x01)
	char pad_169[0x7]; // 0x169(0x07)
	struct UAnimInstance* Animation; // 0x170(0x08)
	struct FTigerLodSplitMesh SplitMesh; // 0x178(0x78)
	struct FName SocketAttachments[0x2]; // 0x1f0(0x10)
	struct TSoftObjectPtr<USkeletalMesh> Mesh; // 0x200(0x28)
};

// Class Tiger.TigerCharacterHairColorCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterHairColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterEyeColorCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterEyeColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterEyebrowCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterEyebrowCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterEyebrowColorCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterEyebrowColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterBeardCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterBeardCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterBeardColorCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterBeardColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterTattooCustomization
// Size: 0x168 (Inherited: 0x130)
struct UTigerCharacterTattooCustomization : UTigerInventoryItemBase {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x130(0x38)
};

// Class Tiger.TigerCharacterPiercingSetCustomization
// Size: 0x130 (Inherited: 0x130)
struct UTigerCharacterPiercingSetCustomization : UTigerCharacterPartOfHeadCustomization {
};

// Class Tiger.TigerCharacterIconCustomization
// Size: 0x158 (Inherited: 0x130)
struct UTigerCharacterIconCustomization : UTigerPlayerCardCustomization {
	struct TSoftObjectPtr<UTexture2D> CharacterIcon; // 0x130(0x28)
};

// Class Tiger.TigerCharacterCardShapeCustomization
// Size: 0x158 (Inherited: 0x130)
struct UTigerCharacterCardShapeCustomization : UTigerPlayerCardCustomization {
	struct TSoftObjectPtr<UTexture2D> CardShapeMask; // 0x130(0x28)
};

// Class Tiger.TigerCharacterCardBackgroundCustomization
// Size: 0x158 (Inherited: 0x130)
struct UTigerCharacterCardBackgroundCustomization : UTigerPlayerCardCustomization {
	struct TSoftObjectPtr<UTexture2D> CardBackground; // 0x130(0x28)
};

// Class Tiger.TigerCharacterEmoteCustomization
// Size: 0x140 (Inherited: 0x130)
struct UTigerCharacterEmoteCustomization : UTigerInventoryItemBase {
	struct UAnimMontage* EmoteMontage; // 0x130(0x08)
	bool bStopsMovement; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	float ThumbnailPoseTime; // 0x13c(0x04)
};

// Class Tiger.TigerClanCustomizationOptions
// Size: 0x3b0 (Inherited: 0x28)
struct UTigerClanCustomizationOptions : UObject {
	struct TArray<struct FTigerCharacterCustomizationOutfitData> Outfits; // 0x28(0x10)
	struct TArray<struct FTigerCharacterCustomizationHeadData> Heads; // 0x38(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Hairs; // 0x48(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> HairColors; // 0x58(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> EyeColors; // 0x68(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Tattoos; // 0x78(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> FacePaints; // 0x88(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> PiercingSets; // 0x98(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Headgears; // 0xa8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Eyewears; // 0xb8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Eyebrows; // 0xc8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> EyebrowColors; // 0xd8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Beards; // 0xe8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> BeardColors; // 0xf8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> CharacterIcons; // 0x108(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> CharacterCardShapes; // 0x118(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> CharacterCardTextures; // 0x128(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Emotes; // 0x138(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> BodyTypeModifiers; // 0x148(0x10)
	struct TMap<enum class ETigerCustomizationType, struct FTigerCombinedItemCustomizations> CombinedItems; // 0x158(0x50)
	struct FTigerCharacterCardData DefaultPlayerCard; // 0x1a8(0x78)
	struct TMap<uint64_t, struct TSoftClassPtr<UObject>> TelemetryIdToItemLut; // 0x220(0x50)
	struct TMap<struct TSoftClassPtr<UObject>, uint64_t> ItemToTelemetryIdLut; // 0x270(0x50)
	struct TMap<uint64_t, int32_t> TelemetryIdToIndexLut; // 0x2c0(0x50)
	struct TMap<uint64_t, uint64_t> TelemetryIdToCombinedTelemetryIdMap; // 0x310(0x50)
	struct TSet<uint64_t> StandardSetItemTelemetryIds; // 0x360(0x50)
};

// Class Tiger.TigerCharacterEffect
// Size: 0x28 (Inherited: 0x28)
struct UTigerCharacterEffect : UObject {

	void ApplyWithTarget(struct ATigerCharacter* Character, struct ATigerCharacter* Target); // Function Tiger.TigerCharacterEffect.ApplyWithTarget // (BlueprintCosmetic|Event|Public|BlueprintEvent|Const) // @ game+0x18b4070
	void ApplyWithSocket(struct ATigerCharacter* Character, struct FName SocketName); // Function Tiger.TigerCharacterEffect.ApplyWithSocket // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x18b4070
	void Apply(struct ATigerCharacter* Character); // Function Tiger.TigerCharacterEffect.Apply // (BlueprintCosmetic|Event|Public|BlueprintEvent|Const) // @ game+0x18b4070
};

// Class Tiger.TigerCharacterMenuUI
// Size: 0x2c0 (Inherited: 0x2c0)
struct UTigerCharacterMenuUI : UTigerIngameSubmenuWidget {

	void OnDisciplinesUpdated(); // Function Tiger.TigerCharacterMenuUI.OnDisciplinesUpdated // (Event|Public|BlueprintEvent) // @ game+0x18b4070
};

// Class Tiger.TigerCharacterMeshManager
// Size: 0x1f0 (Inherited: 0xb0)
struct UTigerCharacterMeshManager : UActorComponent {
	struct TArray<struct FTigerStaticMeshData> StaticMeshes; // 0xb0(0x10)
	struct TArray<struct FTigerPoseableMeshData> PoseableMeshes; // 0xc0(0x10)
	struct FTigerCharacterMeshData Mesh[0xb]; // 0xd0(0x108)
	struct UStaticPiercingPhysics* StaticPiercingPhysics; // 0x1d8(0x08)
	char pad_1E0[0x10]; // 0x1e0(0x10)

	void SetVisibilityOnMeshes(bool bInNewVisibility); // Function Tiger.TigerCharacterMeshManager.SetVisibilityOnMeshes // (Native|Public|BlueprintCallable) // @ game+0x140f2e0
	void SetVisibilityOnMesh(enum class ETigerCharacterMeshPart InMeshType, bool bInNewVisibility); // Function Tiger.TigerCharacterMeshManager.SetVisibilityOnMesh // (Native|Public|BlueprintCallable) // @ game+0x140f200
	void SetVisibilityOnDynamicMesh(enum class ETigerCharacterDynamicMeshType InMeshType, bool bInNewVisibility); // Function Tiger.TigerCharacterMeshManager.SetVisibilityOnDynamicMesh // (Native|Public|BlueprintCallable) // @ game+0x140f120
	void SetVisibilityAllowanceOnMeshes(bool bInNewVisibilityIsAllowed); // Function Tiger.TigerCharacterMeshManager.SetVisibilityAllowanceOnMeshes // (Native|Public|BlueprintCallable) // @ game+0x140f090
	void SetVisibilityAllowanceOnMesh(enum class ETigerCharacterMeshPart InMeshType, bool bInNewVisibilityIsAllowed); // Function Tiger.TigerCharacterMeshManager.SetVisibilityAllowanceOnMesh // (Native|Public|BlueprintCallable) // @ game+0x140efb0
	void SetVisibilityAllowanceOnDynamicMesh(enum class ETigerCharacterDynamicMeshType InMeshType, bool bInNewVisibilityIsAllowed); // Function Tiger.TigerCharacterMeshManager.SetVisibilityAllowanceOnDynamicMesh // (Native|Public|BlueprintCallable) // @ game+0x140eed0
	void SetSkeletalMesh(enum class ETigerCharacterMeshPart Part, struct USkeletalMesh* Mesh, bool bForceClothNextUpdateTeleport); // Function Tiger.TigerCharacterMeshManager.SetSkeletalMesh // (Native|Public|BlueprintCallable) // @ game+0x140edc0
	void SetScalarParameterValueOnMeshes(struct FName InParameterName, float InParameterValue); // Function Tiger.TigerCharacterMeshManager.SetScalarParameterValueOnMeshes // (Native|Public|BlueprintCallable) // @ game+0x140ece0
	void SetMaterial(enum class ETigerCharacterMeshPart Part, int32_t MaterialIndex, struct UMaterialInterface* Material); // Function Tiger.TigerCharacterMeshManager.SetMaterial // (Native|Public|BlueprintCallable) // @ game+0x140ebd0
	void RemoveMeshComponent(struct UStaticMeshComponent* InMesh); // Function Tiger.TigerCharacterMeshManager.RemoveMeshComponent // (Native|Public|BlueprintCallable) // @ game+0x140e720
	void RegisterMeshComponent(enum class ETigerCharacterMeshPart Part, struct USkeletalMeshComponent* MeshComponent); // Function Tiger.TigerCharacterMeshManager.RegisterMeshComponent // (Native|Public|BlueprintCallable) // @ game+0x140e650
	struct USkeletalMeshComponent* GetSkeletalMeshComponent(enum class ETigerCharacterMeshPart Part); // Function Tiger.TigerCharacterMeshManager.GetSkeletalMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140ddc0
	struct TArray<struct UMeshComponent*> GetRegisteredMeshes(); // Function Tiger.TigerCharacterMeshManager.GetRegisteredMeshes // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dd40
	void AddPoseableMesh(struct USkeletalMesh* InMesh, struct UTigerCharacterPoseableMeshAnimInstance* InAnimClass, enum class ETigerCharacterDynamicMeshType InType, struct TArray<struct FTigerCharacterPoseableMeshBoneSetupData> InPoseableMeshSetupData, struct FVector InOffsetLocation, struct FRotator InOffsetRotation); // Function Tiger.TigerCharacterMeshManager.AddPoseableMesh // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x140d750
	void AddPiercing(struct UStaticMesh* InPiercingMesh, struct FName InFaceSlotName, struct FName InPiercingSlotName, struct FVector InLocalLocation, struct FRotator InLocalRotation); // Function Tiger.TigerCharacterMeshManager.AddPiercing // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x140d5a0
	void AddMeshComponent(struct UStaticMeshComponent* InMesh); // Function Tiger.TigerCharacterMeshManager.AddMeshComponent // (Native|Public|BlueprintCallable) // @ game+0x140d510
};

// Class Tiger.TigerCharacterMovementComponent
// Size: 0xde0 (Inherited: 0xb00)
struct UTigerCharacterMovementComponent : UCharacterMovementComponent {
	struct UTigerTraversalFiniteStateMachine* FiniteStateMachine; // 0xb00(0x08)
	char pad_B08[0x30]; // 0xb08(0x30)
	float MaxSprintSpeed; // 0xb38(0x04)
	float SprintSpeedMultiplier; // 0xb3c(0x04)
	char pad_B40[0x4]; // 0xb40(0x04)
	float ForwardAngleThreshold; // 0xb44(0x04)
	char pad_B48[0x8]; // 0xb48(0x08)
	struct UTigerSprintConfig* SprintConfig; // 0xb50(0x08)
	float MaxJumpHeight; // 0xb58(0x04)
	bool bPreventFallingSlide; // 0xb5c(0x01)
	char pad_B5D[0x3]; // 0xb5d(0x03)
	float DownedMaxSpeed; // 0xb60(0x04)
	char pad_B64[0x4]; // 0xb64(0x04)
	struct FMulticastInlineDelegate OnDodge; // 0xb68(0x10)
	float WallClimbCombineThresholdSquared; // 0xb78(0x04)
	char pad_B7C[0x4]; // 0xb7c(0x04)
	struct UTigerImpendingCollisionCalculator* ImpendingCollisionCalculator; // 0xb80(0x08)
	float TimeUntilCollision; // 0xb88(0x04)
	float AngleToImpendingCollisionWithClimbableSurface; // 0xb8c(0x04)
	float CharacterAngleToImpendingCollisionWithClimbableSurface; // 0xb90(0x04)
	bool bAboutToCollideWithClimbableSurface; // 0xb94(0x01)
	char pad_B95[0x17]; // 0xb95(0x17)
	uint32_t ElysiumBlockedTraversalStates; // 0xbac(0x04)
	bool bEnableRestrictedElysiumMobility; // 0xbb0(0x01)
	bool bIsInLedgeGrab; // 0xbb1(0x01)
	bool bContinueToUseClimbCameraDuringLedgeGrab; // 0xbb2(0x01)
	bool bWasLastLandingHard; // 0xbb3(0x01)
	char pad_BB4[0x8]; // 0xbb4(0x08)
	struct FName RightHandBoneName; // 0xbbc(0x08)
	struct FName LeftHandBoneName; // 0xbc4(0x08)
	struct FName RightFootBoneName; // 0xbcc(0x08)
	struct FName LeftFootBoneName; // 0xbd4(0x08)
	float JumpCapsuleHeightReduction; // 0xbdc(0x04)
	char pad_BE0[0x48]; // 0xbe0(0x48)
	struct FTigerDeltaCorrectionData CurrentDeltaCorrectedAnimationData; // 0xc28(0x40)
	bool bUseCustomCurvesExclusivelyForInclineSpeedModification; // 0xc68(0x01)
	char pad_C69[0x7]; // 0xc69(0x07)
	struct UCurveFloat* InclineMovementMultiplierCurve; // 0xc70(0x08)
	struct UCurveFloat* DeclineMovementMultiplierCurve; // 0xc78(0x08)
	struct UCurveFloat* BackwardsMovementMultiplierCurve; // 0xc80(0x08)
	float BackwardsAngleThreshold; // 0xc88(0x04)
	char pad_C8C[0x14]; // 0xc8c(0x14)
	struct UTigerSprintConfig* SprintConfigClass; // 0xca0(0x08)
	struct UCurveFloat* AimGlideProgressCurve; // 0xca8(0x08)
	struct UCurveFloat* AimGlideDragOverVelocityCurve; // 0xcb0(0x08)
	struct UCurveFloat* AimGlideLateralDragCurve; // 0xcb8(0x08)
	struct UCurveFloat* AimGlideAirControlCurve; // 0xcc0(0x08)
	bool bResetAimGlideOnDoubleJump; // 0xcc8(0x01)
	char pad_CC9[0x7]; // 0xcc9(0x07)
	struct UAnimMontage* PendingPreMovementMontage; // 0xcd0(0x08)
	char pad_CD8[0x54]; // 0xcd8(0x54)
	struct FVector LastWallJumpedNormal; // 0xd2c(0x0c)
	char pad_D38[0xa8]; // 0xd38(0xa8)

	void TigerDelegateOnDodged__DelegateSignature(struct FVector RelativeLaunchDirection); // DelegateFunction Tiger.TigerCharacterMovementComponent.TigerDelegateOnDodged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasDefaults) // @ game+0x18b4070
	bool ShouldUseClimbingCamera(); // Function Tiger.TigerCharacterMovementComponent.ShouldUseClimbingCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140f400
	bool ShouldRestrictMobility(enum class ETigerTraversalState InPotentialActionToRestrict); // Function Tiger.TigerCharacterMovementComponent.ShouldRestrictMobility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140f370
	void Server_SetDeltaCorrectionEndPoint(struct FVector EndPosition); // Function Tiger.TigerCharacterMovementComponent.Server_SetDeltaCorrectionEndPoint // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults|NetValidate) // @ game+0x140e9a0
	void Server_NetworkDesyncDetected(float InDistanceFromPlayer, float InTeleportingDistance, float InVelocitySize, float InTimeSinceLastServerUpdate, float InClientDeltaTime); // Function Tiger.TigerCharacterMovementComponent.Server_NetworkDesyncDetected // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x140e7b0
	void PlayDeltaCorrectedAnimation(struct UAnimMontage* AnimMontageToCorrect, struct FVector PositionToCorrectTo, bool bShouldAdjustAnimationPlayRate); // Function Tiger.TigerCharacterMovementComponent.PlayDeltaCorrectedAnimation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x140e530
	void Multicast_WallJump(); // Function Tiger.TigerCharacterMovementComponent.Multicast_WallJump // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x140e510
	void Multicast_UpdateWallJump(enum class ESharkFourWayDirection InDesiredWallJumpDirection, char InDesiredWallJumpAnimState, struct FVector InWallNormal, struct FVector InWallJumpVelocity); // Function Tiger.TigerCharacterMovementComponent.Multicast_UpdateWallJump // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x140e380
	void Multicast_StopClimb(); // Function Tiger.TigerCharacterMovementComponent.Multicast_StopClimb // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x140e360
	void Multicast_ReplicateState(enum class ETigerTraversalState InTraversalStateType, enum class ETigerTraversalTransitionAction InAction); // Function Tiger.TigerCharacterMovementComponent.Multicast_ReplicateState // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x140e290
	void Multicast_FinishWallJump(); // Function Tiger.TigerCharacterMovementComponent.Multicast_FinishWallJump // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x140e270
	void Multicast_BeginClimb(struct AActor* InTargetClimbObject, struct FVector InClimbStartLocation); // Function Tiger.TigerCharacterMovementComponent.Multicast_BeginClimb // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x140e190
	void Multicast_AirDash(enum class ESharkFourWayDirection InDashDirection, float InAirDashAngleInDegrees); // Function Tiger.TigerCharacterMovementComponent.Multicast_AirDash // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x140e0c0
	bool IsSprintingAtFullSpeed(); // Function Tiger.TigerCharacterMovementComponent.IsSprintingAtFullSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140e090
	bool IsSprinting(); // Function Tiger.TigerCharacterMovementComponent.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140e060
	bool IsSliding(); // Function Tiger.TigerCharacterMovementComponent.IsSliding // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140e030
	bool IsSlideJumping(); // Function Tiger.TigerCharacterMovementComponent.IsSlideJumping // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140e000
	bool IsInWallJump(); // Function Tiger.TigerCharacterMovementComponent.IsInWallJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dfd0
	bool IsInWallHang(); // Function Tiger.TigerCharacterMovementComponent.IsInWallHang // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dfa0
	bool IsInWallGrind(); // Function Tiger.TigerCharacterMovementComponent.IsInWallGrind // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140df70
	bool IsInLowVault(); // Function Tiger.TigerCharacterMovementComponent.IsInLowVault // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140df40
	bool IsInLedgeGrab(); // Function Tiger.TigerCharacterMovementComponent.IsInLedgeGrab // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140df10
	bool IsInAirDash(); // Function Tiger.TigerCharacterMovementComponent.IsInAirDash // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dee0
	bool IsAimGliding(); // Function Tiger.TigerCharacterMovementComponent.IsAimGliding // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140deb0
	float GetTimeSinceStartedMovingFreely(); // Function Tiger.TigerCharacterMovementComponent.GetTimeSinceStartedMovingFreely // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140de80
	float GetSlideSurfacePitch(); // Function Tiger.TigerCharacterMovementComponent.GetSlideSurfacePitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140de50
	float GetLastDodgeTime(); // Function Tiger.TigerCharacterMovementComponent.GetLastDodgeTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xb53520
	float GetFloorPitch(); // Function Tiger.TigerCharacterMovementComponent.GetFloorPitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dce0
	float GetAimGlideStrength(); // Function Tiger.TigerCharacterMovementComponent.GetAimGlideStrength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dcb0
	void FreezeMovement(); // Function Tiger.TigerCharacterMovementComponent.FreezeMovement // (Final|Native|Public|BlueprintCallable) // @ game+0x140dc90
	void DoForcedMove(struct FVector& TargetLocation, float TravelTime, bool bInAir, float ExitVelocityScale, bool bAllowPlayerBreak, bool bAllowCancelOnArrival); // Function Tiger.TigerCharacterMovementComponent.DoForcedMove // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x140da70
	void ApplyKnockback(struct FVector& InVelocity, struct ATigerPlayer* InInstigator); // Function Tiger.TigerCharacterMovementComponent.ApplyKnockback // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x140d990
};

// Class Tiger.TigerSceneRenderItemWidget
// Size: 0x2f0 (Inherited: 0x280)
struct UTigerSceneRenderItemWidget : UTigerWidget {
	struct FMulticastInlineDelegate OnItemSpawned; // 0x280(0x10)
	struct FVector ItemSpawnLocation; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct TSoftClassPtr<UObject> DefaultItemClass; // 0x2a0(0x28)
	struct UMaterialInterface* RenderTargetMaterial; // 0x2c8(0x08)
	bool bOverrideItemRenderTarget; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct AActor* SpawnedItem; // 0x2d8(0x08)
	char pad_2E0[0x10]; // 0x2e0(0x10)

	void SpawnItem(struct AActor* InActorClass); // Function Tiger.TigerSceneRenderItemWidget.SpawnItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x15176c0
	void OverrideRenderTextureTarget(struct AActor* InActor); // Function Tiger.TigerSceneRenderItemWidget.OverrideRenderTextureTarget // (Final|Native|Protected|BlueprintCallable) // @ game+0x1517410
	void OnItemSpawned__DelegateSignature(struct AActor* InSpawnedItem); // DelegateFunction Tiger.TigerSceneRenderItemWidget.OnItemSpawned__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	struct UTextureRenderTarget2D* GetRenderTextureFromMaterial(); // Function Tiger.TigerSceneRenderItemWidget.GetRenderTextureFromMaterial // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1517360
};

// Class Tiger.TigerCharacterPaperDollWidget
// Size: 0x3c8 (Inherited: 0x2f0)
struct UTigerCharacterPaperDollWidget : UTigerSceneRenderItemWidget {
	struct FTigerCharacterAppearance Appearance; // 0x2f0(0xc8)
	struct UTigerPlayerClanData* ClanData; // 0x3b8(0x08)
	bool bUseSharedPaperDoll; // 0x3c0(0x01)
	char pad_3C1[0x7]; // 0x3c1(0x07)

	void SetFromApperance(struct FTigerPreviewerData& InAppearance, struct UTigerPlayerClanData* InClanData, struct FDelegate InDelegate); // Function Tiger.TigerCharacterPaperDollWidget.SetFromApperance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x140ea70
	void OnCharacterAppearanceUpdated__DelegateSignature(); // DelegateFunction Tiger.TigerCharacterPaperDollWidget.OnCharacterAppearanceUpdated__DelegateSignature // (Public|Delegate) // @ game+0x18b4070
	struct ATigerPaperDoll* GetPaperDoll(); // Function Tiger.TigerCharacterPaperDollWidget.GetPaperDoll // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x140dd10
};

// Class Tiger.TigerPhysicalInteractionAnimationAsset
// Size: 0xf0 (Inherited: 0x30)
struct UTigerPhysicalInteractionAnimationAsset : UDataAsset {
	struct FTigerPhysicalInteractionMontages FeedingDataByVampireGender[0x2]; // 0x30(0xc0)
};

// Class Tiger.TigerPhysicalInteraction
// Size: 0x40 (Inherited: 0x28)
struct UTigerPhysicalInteraction : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TWeakObjectPtr<struct ATigerPlayer> OtherPlayer; // 0x38(0x08)
};

// Class Tiger.TigerPhysicalInteractionDiablerize
// Size: 0xa0 (Inherited: 0x40)
struct UTigerPhysicalInteractionDiablerize : UTigerPhysicalInteraction {
	float DiablerizeTime; // 0x40(0x04)
	bool bInstantInterrupt; // 0x44(0x01)
	bool bResetPowerCooldownsOnSuccess; // 0x45(0x01)
	char pad_46[0x2]; // 0x46(0x02)
	struct UTigerPhysicalInteractionAnimationAsset* DiablerizeAnimationAsset; // 0x48(0x08)
	char pad_50[0x50]; // 0x50(0x50)
};

// Class Tiger.TigerPhysicalInteractionRevive
// Size: 0x48 (Inherited: 0x40)
struct UTigerPhysicalInteractionRevive : UTigerPhysicalInteraction {
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Tiger.TigerCharacterPoseableMeshAnimInstance
// Size: 0x330 (Inherited: 0x2c0)
struct UTigerCharacterPoseableMeshAnimInstance : UAnimInstance {
	struct UTigerCharacterMeshManager* MeshManager; // 0x2b8(0x08)
	struct TMap<struct FName, struct FTigerCharacterPoseableMeshBoneData> NameToDataLut; // 0x2c0(0x50)
	char pad_318[0x18]; // 0x318(0x18)

	void SetOffsetLocationAndRotation(struct FVector InOffsetLocation, struct FRotator InOffsetRotation); // Function Tiger.TigerCharacterPoseableMeshAnimInstance.SetOffsetLocationAndRotation // (Final|Native|Public|HasDefaults) // @ game+0x1413440
	void GetBoneOffsetTransform(struct FName InName, struct FVector& OutLocation, struct FRotator& OutRotation); // Function Tiger.TigerCharacterPoseableMeshAnimInstance.GetBoneOffsetTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1412a00
};

// Class Tiger.TigerCharacterPoseableMesh
// Size: 0x38 (Inherited: 0x28)
struct UTigerCharacterPoseableMesh : UObject {
	struct USkeletalMesh* Mesh; // 0x28(0x08)
	struct UTigerCharacterPoseableMeshAnimInstance* AnimClass; // 0x30(0x08)
};

// Class Tiger.TigerCharCustomizationComponent
// Size: 0x108 (Inherited: 0xb0)
struct UTigerCharCustomizationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAppearanceChanged; // 0xb0(0x10)
	char pad_C0[0x10]; // 0xc0(0x10)
	struct UTigerCharacterMeshManager* MeshManager; // 0xd0(0x08)
	struct UTigerClanCustomizationOptions* CustomizationOptions; // 0xd8(0x08)
	struct TArray<struct FTigerCharacterCustomizationParameters> AdditionalParametersToApply; // 0xe0(0x10)
	char pad_F0[0x11]; // 0xf0(0x11)
	enum class ETigerLodSplitMeshQuality MeshQuality; // 0x101(0x01)
	char pad_102[0x6]; // 0x102(0x06)

	void SetMeshManager(struct UTigerCharacterMeshManager* MeshManager); // Function Tiger.TigerCharCustomizationComponent.SetMeshManager // (Final|Native|Public|BlueprintCallable) // @ game+0x14133b0
	void SetAppearanceByPreviewDataAsync(struct FTigerPreviewerData& NewAppearance); // Function Tiger.TigerCharCustomizationComponent.SetAppearanceByPreviewDataAsync // (Final|Native|Public|HasOutParms) // @ game+0x1413300
	void SetAppearanceByPreviewData(struct FTigerPreviewerData& NewAppearance); // Function Tiger.TigerCharCustomizationComponent.SetAppearanceByPreviewData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1413250
	void OnAppearanceChangedMulticast__DelegateSignature(); // DelegateFunction Tiger.TigerCharCustomizationComponent.OnAppearanceChangedMulticast__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x18b4070
	bool HasAppearanceBeenSet(); // Function Tiger.TigerCharCustomizationComponent.HasAppearanceBeenSet // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1412d30
	struct UTigerCharacterTattooCustomization* GetTattoo(int32_t TattooIndex, bool& bIsValid); // Function Tiger.TigerCharCustomizationComponent.GetTattoo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1412c50
	struct UTigerCharacterOutfitConfiguration* GetOutfitConfigurationByPath(struct TSoftClassPtr<UObject>& OutfitClassPath); // Function Tiger.TigerCharCustomizationComponent.GetOutfitConfigurationByPath // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1412b80
	struct FTigerPreviewerData GetAppearanceData(); // Function Tiger.TigerCharCustomizationComponent.GetAppearanceData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x14129d0
};

// Class Tiger.TigerChatComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UTigerChatComponent : UActorComponent {
	struct FSharkTokenBucket ClientMessageTokenBucket; // 0xb0(0x0c)
	struct FSharkTokenBucket ServerMessageTokenBucket; // 0xbc(0x0c)
	bool bIsChatBanned; // 0xc8(0x01)
	bool bIsChatAllowed; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)

	bool TryGetMessageToken(float& OutTimeUntilTokenAvailable); // Function Tiger.TigerChatComponent.TryGetMessageToken // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1414720
	void Server_SetChatMessageCategoryMuteStatus(enum class ETigerChatMessageCategory InCategory, bool bInShouldMute); // Function Tiger.TigerChatComponent.Server_SetChatMessageCategoryMuteStatus // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1413170
	void Server_MuteChatForRestrictedPlayer(bool bInShouldMute); // Function Tiger.TigerChatComponent.Server_MuteChatForRestrictedPlayer // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x14130e0
	void OnPersistentPlayerStateInitialized(struct ATigerPlayerController* InPlayerController); // Function Tiger.TigerChatComponent.OnPersistentPlayerStateInitialized // (Final|Native|Protected) // @ game+0x1413050
	void OnMuteStatusChanged(struct FTigerMuteInfo& InMuteInfo); // Function Tiger.TigerChatComponent.OnMuteStatusChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1412fa0
	void OnLeftPartyDueToBlockedPlayerJoinBlueprint(bool bInWasKicked); // Function Tiger.TigerChatComponent.OnLeftPartyDueToBlockedPlayerJoinBlueprint // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnLeftPartyDueToBlockedPlayerJoin(struct UTigerPartyManager* InPartyManager); // Function Tiger.TigerChatComponent.OnLeftPartyDueToBlockedPlayerJoin // (Final|Native|Protected) // @ game+0x1412f10
	void OnFailedToJoinParty(enum class ETigerJoinedPartyFailedReason InJoinedPartyFailedReason); // Function Tiger.TigerChatComponent.OnFailedToJoinParty // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void OnChatMessageReceived(struct FTigerChatMessage& InMessage); // Function Tiger.TigerChatComponent.OnChatMessageReceived // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x18b4070
	void OnBlockedPlayerWasRemovedFromParty(bool bInWasBlockedByMe); // Function Tiger.TigerChatComponent.OnBlockedPlayerWasRemovedFromParty // (Event|Public|BlueprintEvent) // @ game+0x18b4070
	void OnBanStatusUpdated(struct FTigerMuteInfo& InMuteInfo); // Function Tiger.TigerChatComponent.OnBanStatusUpdated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x18b4070
	bool IsSoloMatch(); // Function Tiger.TigerChatComponent.IsSoloMatch // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1412d80
	bool IsGeneralChatMuted(); // Function Tiger.TigerChatComponent.IsGeneralChatMuted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1412d50
	struct FTigerMuteInfo GetMutedInfo(); // Function Tiger.TigerChatComponent.GetMutedInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1412b30
	void CreateChatWindow(); // Function Tiger.TigerChatComponent.CreateChatWindow // (Event|Protected|BlueprintEvent) // @ game+0x18b4070
	void Client_ReceiveServerMessage(struct FString InServerMessage); // Function Tiger.TigerChatComponent.Client_ReceiveServerMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1412930
	void Client_ReceiveChatMessage(struct FTigerChatMessage InMessage); // Function Tiger.TigerChatComponent.Client_ReceiveChatMessage // (Net|Native|Event|Public|NetClient) // @ game+0x14127f0
};

// Class Tiger.TigerCheatManager
// Size: 0x88 (Inherited: 0x78)
struct UTigerCheatManager : UCheatManager {
	struct ATigerVideoCameraController* TigerVideoCameraControllerClass; // 0x78(0x08)
	struct ATigerVideoCameraController* TigerVideoCameraController; // 0x80(0x08)

	void TigerUpdateSeasonProgress(int32_t ExpToAdd, int32_t LevelsToAdd); // Function Tiger.TigerCheatManager.TigerUpdateSeasonProgress // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1414650
	void TigerUnlockVanityItem(struct FString InItemName); // Function Tiger.TigerCheatManager.TigerUnlockVanityItem // (Final|Exec|Native|Public) // @ game+0x1414560
	void TigerUnlockThrall(enum class ETigerThrallId InThrallId); // Function Tiger.TigerCheatManager.TigerUnlockThrall // (Final|Exec|Native|Public) // @ game+0x1413ff0
	void TigerUnlockAllThralls(); // Function Tiger.TigerCheatManager.TigerUnlockAllThralls // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerUnlockAllPerks(); // Function Tiger.TigerCheatManager.TigerUnlockAllPerks // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerUnlockAllItemsInDatabase(); // Function Tiger.TigerCheatManager.TigerUnlockAllItemsInDatabase // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerToggleVisualLogger(); // Function Tiger.TigerCheatManager.TigerToggleVisualLogger // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerToggleNoAggro(); // Function Tiger.TigerCheatManager.TigerToggleNoAggro // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerToggleClientSideHitDetectionRanged(); // Function Tiger.TigerCheatManager.TigerToggleClientSideHitDetectionRanged // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerToggleClientSideHitDetectionMelee(); // Function Tiger.TigerCheatManager.TigerToggleClientSideHitDetectionMelee // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerThrallTickAllStatModifiers(); // Function Tiger.TigerCheatManager.TigerThrallTickAllStatModifiers // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerThrallMissionUpdateAll(); // Function Tiger.TigerCheatManager.TigerThrallMissionUpdateAll // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerThrallMissionStatusChange(int32_t InThrallMissionId, bool bIsActive); // Function Tiger.TigerCheatManager.TigerThrallMissionStatusChange // (Final|Exec|Native|Public) // @ game+0x1414070
	void TigerThrallMissionAdvanceTurns(int32_t InThrallMissionId, uint32_t InTurns); // Function Tiger.TigerCheatManager.TigerThrallMissionAdvanceTurns // (Final|Exec|Native|Public) // @ game+0x1414490
	void TigerThrallAddStatModifier(char InSlotIndex, struct FName InModifierName); // Function Tiger.TigerCheatManager.TigerThrallAddStatModifier // (Final|Exec|Native|Public) // @ game+0x14143c0
	void TigerTeleportToCameraLink(struct FString InUrl); // Function Tiger.TigerCheatManager.TigerTeleportToCameraLink // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerSubmitChallengeProgress(); // Function Tiger.TigerCheatManager.TigerSubmitChallengeProgress // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerStartQuest(struct FString InQuestlineId, struct FString InQuestId); // Function Tiger.TigerCheatManager.TigerStartQuest // (Final|Exec|Native|Public) // @ game+0x1413a20
	void TigerSpawnNpcsAroundPlayer(struct FName& InNpcType, int32_t InCount); // Function Tiger.TigerCheatManager.TigerSpawnNpcsAroundPlayer // (Final|Exec|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x14142f0
	void TigerSpawnNpcAtCursorWithPotency(struct FName& NPCType, enum class ETigerBloodPotency InPotency, enum class ETigerBloodType InBloodType); // Function Tiger.TigerCheatManager.TigerSpawnNpcAtCursorWithPotency // (Final|Exec|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x14141d0
	void TigerSpawnNpcAtCursor(struct FName& NPCType); // Function Tiger.TigerCheatManager.TigerSpawnNpcAtCursor // (Final|Exec|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1414140
	void TigerSleep(float SleepMs); // Function Tiger.TigerCheatManager.TigerSleep // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413c00
	void TigerSkipPsoCaching(); // Function Tiger.TigerCheatManager.TigerSkipPsoCaching // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerShowPlayerLevel(); // Function Tiger.TigerCheatManager.TigerShowPlayerLevel // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerShowMatchTimer(); // Function Tiger.TigerCheatManager.TigerShowMatchTimer // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerShowDoNotUseMeshes(); // Function Tiger.TigerCheatManager.TigerShowDoNotUseMeshes // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerShowArchetypeLevel(); // Function Tiger.TigerCheatManager.TigerShowArchetypeLevel // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerShowActiveAnimationsOnActors(bool bShouldShow); // Function Tiger.TigerCheatManager.TigerShowActiveAnimationsOnActors // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x13f3120
	void TigerSetWeatherScenario(struct FString InScenarioName); // Function Tiger.TigerCheatManager.TigerSetWeatherScenario // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerSetSessionProgressToBattlepassLevel(int32_t InLevel, bool bInShouldOwnBattlepass); // Function Tiger.TigerCheatManager.TigerSetSessionProgressToBattlepassLevel // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1414070
	void TigerSetPlayerLevel(int32_t InPlayerLevel); // Function Tiger.TigerCheatManager.TigerSetPlayerLevel // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413700
	void TigerSetMatchesPlayed(int32_t InNumberMatches); // Function Tiger.TigerCheatManager.TigerSetMatchesPlayed // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413700
	void TigerSetFov(float InFov); // Function Tiger.TigerCheatManager.TigerSetFov // (Final|Exec|Native|Public) // @ game+0x1413c00
	void TigerSetDutchAngle(struct FString InAngle); // Function Tiger.TigerCheatManager.TigerSetDutchAngle // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerSetCinematicQuality(enum class ETigerCinematicQuality InQualityLevel); // Function Tiger.TigerCheatManager.TigerSetCinematicQuality // (Final|Exec|Native|Public) // @ game+0x1413ff0
	void TigerSetCinematicOutfit(struct FString InCharacterName); // Function Tiger.TigerCheatManager.TigerSetCinematicOutfit // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerSetCharacterData(struct FString ClanText, int32_t PowerKitIndex, struct FString GenderText); // Function Tiger.TigerCheatManager.TigerSetCharacterData // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413eb0
	void TigerSetArchetypeLevel(int32_t InArchetypeLevel); // Function Tiger.TigerCheatManager.TigerSetArchetypeLevel // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413700
	void TigerSetAppearanceItemById(struct FString InDatabaseId); // Function Tiger.TigerCheatManager.TigerSetAppearanceItemById // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413530
	void TigerSetAppearance(struct FString AppearanceText); // Function Tiger.TigerCheatManager.TigerSetAppearance // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413530
	void TigerServerCrash(); // Function Tiger.TigerCheatManager.TigerServerCrash // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerSerializeStatistics(); // Function Tiger.TigerCheatManager.TigerSerializeStatistics // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerResetQuests(); // Function Tiger.TigerCheatManager.TigerResetQuests // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerReportSelf(int32_t InReportReason); // Function Tiger.TigerCheatManager.TigerReportSelf // (Final|Exec|Native|Public) // @ game+0x1413700
	void TigerRemoveThrall(char InSlot); // Function Tiger.TigerCheatManager.TigerRemoveThrall // (Final|Exec|Native|Public) // @ game+0x1413e30
	void TigerRemoveHolyIncense(); // Function Tiger.TigerCheatManager.TigerRemoveHolyIncense // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerRemoveAllThralls(); // Function Tiger.TigerCheatManager.TigerRemoveAllThralls // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerRegisterGrimoireEntryAsUnread(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsUnread // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerRegisterGrimoireEntryAsUnlocked(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsUnlocked // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerRegisterGrimoireEntryAsRead(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsRead // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerRegisterGrimoireEntryAsLocked(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsLocked // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerRegisterGrimoireEntryAndSiblingsAsUnlocked(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAndSiblingsAsUnlocked // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerRegisterAllGrimoireEntriesAsUnread(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsUnread // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerRegisterAllGrimoireEntriesAsUnlocked(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsUnlocked // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerRegisterAllGrimoireEntriesAsRead(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsRead // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerRegisterAllGrimoireEntriesAsLocked(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsLocked // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerRainAmount(float RainAmount); // Function Tiger.TigerCheatManager.TigerRainAmount // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413c00
	void TigerQuitTutorial(); // Function Tiger.TigerCheatManager.TigerQuitTutorial // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerPrintCompleteQuestInfo(); // Function Tiger.TigerCheatManager.TigerPrintCompleteQuestInfo // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerPrintActiveQuestInfo(); // Function Tiger.TigerCheatManager.TigerPrintActiveQuestInfo // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerMatchAddPlayerExp(int32_t InPlayerExp); // Function Tiger.TigerCheatManager.TigerMatchAddPlayerExp // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413700
	void TigerMatchAddArchetypeExp(int32_t InArchetypeExp); // Function Tiger.TigerCheatManager.TigerMatchAddArchetypeExp // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413700
	void TigerListThrallTrueStats(); // Function Tiger.TigerCheatManager.TigerListThrallTrueStats // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerListThralls(); // Function Tiger.TigerCheatManager.TigerListThralls // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerListSoftCurrencies(); // Function Tiger.TigerCheatManager.TigerListSoftCurrencies // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerListPlayerCharacters(); // Function Tiger.TigerCheatManager.TigerListPlayerCharacters // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerKickByMod(); // Function Tiger.TigerCheatManager.TigerKickByMod // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerJumpToLink(struct FString InUrl); // Function Tiger.TigerCheatManager.TigerJumpToLink // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerIncrementPremiumCurrency(uint64_t InAmountToAdd); // Function Tiger.TigerCheatManager.TigerIncrementPremiumCurrency // (Final|Exec|Native|Public) // @ game+0x1413da0
	void TigerFreeReload(); // Function Tiger.TigerCheatManager.TigerFreeReload // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerExportMetadata(); // Function Tiger.TigerCheatManager.TigerExportMetadata // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerEnableVideoFreeCamPlayerController(); // Function Tiger.TigerCheatManager.TigerEnableVideoFreeCamPlayerController // (Exec|Native|Public) // @ game+0x1413d80
	void TigerEnableStatisticsGathering(bool bShouldBeEnabled); // Function Tiger.TigerCheatManager.TigerEnableStatisticsGathering // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x13f3120
	void TigerDisableDisciplineCost(); // Function Tiger.TigerCheatManager.TigerDisableDisciplineCost // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerDestroyNpcWithinRadiusIgnoreDebugTarget(float InRadius); // Function Tiger.TigerCheatManager.TigerDestroyNpcWithinRadiusIgnoreDebugTarget // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413d00
	void TigerDestroyNpcWithinRadius(float Radius); // Function Tiger.TigerCheatManager.TigerDestroyNpcWithinRadius // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413c80
	void TigerDemoStop(); // Function Tiger.TigerCheatManager.TigerDemoStop // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerDemoRec(struct FString InRecordingName); // Function Tiger.TigerCheatManager.TigerDemoRec // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerDebugHolyIncenseProgressBetweenServerAndClient(bool bInEnable); // Function Tiger.TigerCheatManager.TigerDebugHolyIncenseProgressBetweenServerAndClient // (Final|Exec|Native|Public) // @ game+0x13f3120
	void TigerDebugHolyIncenseDrawServerAndClientVertices(float InDuration); // Function Tiger.TigerCheatManager.TigerDebugHolyIncenseDrawServerAndClientVertices // (Final|Exec|Native|Public) // @ game+0x1413c00
	void TigerDebugDrawPlayerGrid(float DebugDrawLifetime); // Function Tiger.TigerCheatManager.TigerDebugDrawPlayerGrid // (Final|Exec|Native|Public) // @ game+0x1413c00
	void TigerDeactivateEvent(struct FString InEventName); // Function Tiger.TigerCheatManager.TigerDeactivateEvent // (Final|Exec|Native|Public) // @ game+0x1413530
	void TigerCreateDefaultCharacterAtSlot(struct FString InArchetypeName, char InCharacterSlot); // Function Tiger.TigerCheatManager.TigerCreateDefaultCharacterAtSlot // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1413b20
	void TigerCrash(); // Function Tiger.TigerCheatManager.TigerCrash // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerCopyPlayerId(); // Function Tiger.TigerCheatManager.TigerCopyPlayerId // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerCompleteQuestActiveObjectiveSet(struct FString InQuestlineId, struct FString InQuestId); // Function Tiger.TigerCheatManager.TigerCompleteQuestActiveObjectiveSet // (Final|Exec|Native|Public) // @ game+0x1413a20
	void TigerCompleteQuest(struct FString InQuestlineId, struct FString InQuestId); // Function Tiger.TigerCheatManager.TigerCompleteQuest // (Final|Exec|Native|Public) // @ game+0x1413a20
	void TigerCompleteNextTierMastery(); // Function Tiger.TigerCheatManager.TigerCompleteNextTierMastery // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerCompleteNextChallengeWeekly(); // Function Tiger.TigerCheatManager.TigerCompleteNextChallengeWeekly // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerCompleteNextChallengeMastery(); // Function Tiger.TigerCheatManager.TigerCompleteNextChallengeMastery // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerCompleteNextChallengeDaily(); // Function Tiger.TigerCheatManager.TigerCompleteNextChallengeDaily // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerClearQuest(struct FString InQuestlineId, struct FString InQuestId); // Function Tiger.TigerCheatManager.TigerClearQuest // (Final|Exec|Native|Public) // @ game+0x1413a20
	void TigerChangeThrallStats(char InSlotIndex, int32_t InPerception, int32_t InCommitment, int32_t InDominance, int32_t InSociability, int32_t InProficiency, int32_t InStealth, int32_t InStamina, int32_t InCombat); // Function Tiger.TigerCheatManager.TigerChangeThrallStats // (Final|Exec|Native|Public) // @ game+0x1413790
	void TigerChangeRespawnTokenCount(int32_t InChange); // Function Tiger.TigerCheatManager.TigerChangeRespawnTokenCount // (Final|Exec|Native|Public) // @ game+0x1413700
	void TigerBringMeHome(); // Function Tiger.TigerCheatManager.TigerBringMeHome // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb64580
	void TigerBreakMasquerade(); // Function Tiger.TigerCheatManager.TigerBreakMasquerade // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerBanMeForProfanity(); // Function Tiger.TigerCheatManager.TigerBanMeForProfanity // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerBanMeForLoadData(); // Function Tiger.TigerCheatManager.TigerBanMeForLoadData // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerBanMeForAntiCheat(); // Function Tiger.TigerCheatManager.TigerBanMeForAntiCheat // (Final|Exec|Native|Public) // @ game+0xb64580
	void TigerAddSoftCurrency(int32_t InAmount, struct FString InCurrencyIdAsString); // Function Tiger.TigerCheatManager.TigerAddSoftCurrency // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x14135d0
